{"halley":{"name":"Halley","bio":"<p><strong>Эдмонд Галлей</strong> (1656 - 1742) был английским математиком, физиком и вторым <em>королевским астрономом</em>. Он рассчитал орбиту кометы Галлея, которая названа в его честь.</p>"},"gauss":{"name":"Gauss","born":1777,"died":1855,"bio":"<p><strong>Карл Фридрих Гаусс</strong> (1777 - 1855) был, вероятно, величайшим математиком в истории. Он сделал новаторские открытия почти во всех областях математики, от алгебры и теории чисел до статистики, исчисления, геометрии, геологии и астрономии.</p><p>Согласно легенде, он исправил ошибку в учете своего отца в возрасте 3 лет и нашел способ быстро сложить все целые числа от 1 до 100 в возрасте 8 лет. Он сделал свои первые важные открытия, будучи еще подростком, а затем обучал многих других известных математиков в качестве профессора.</p>","links":[{"title":"Теорема простых чисел","url":"/course/divisibility/the-distribution-of-primes#riemann"},{"title":"Неевклидова геометрия","url":"/world/Dimensions_and_Distortions"},{"title":"Суммы треугольных чисел","url":"/course/sequences/figurate#triangle-sums"}]},"fibonacci":{"name":"Fibonacci","born":1175,"died":1250,"bio":"<p><strong>Леонардо Пизанский</strong>, обычно известный как <strong>Фибоначчи</strong> (1175 - 1250), был итальянским математиком. Он наиболее известен по числовой последовательности, названной его именем: 1, 1, 2, 3, 5, 8, 13,…</p><p>Фибоначчи также отвечает за популяризацию арабских цифр (0, 1, 2, 3, 4, ...) в Европе, которая еще использовала римские цифры (I, V, X, D, ...) в 12 веке нашей эры. Он объяснил десятичную систему в книге «Liber Abaci», практическом учебнике для торговцев.</p>","links":[{"title":"Числа Фибоначчи","url":"/course/sequences/fibonacci"}]},"euclid":{"name":"Euclid","born":-330,"died":-270,"bio":"<p><strong>Александрийский Эвклид</strong> (около 300 г. до н.э.) был греческим математиком и его часто называют <em>отцом геометрии</em>. Он опубликовал книгу <em>Elements</em>, которая впервые представила евклидову геометрию и содержала много важных доказательств в геометрии и теории чисел. Это был основной учебник по математике до 19 века. Он преподавал математику в Александрии, но очень мало что известно о его жизни.</p>","links":[{"title":"Аксиомы Эвклида","url":"/course/euclidean-geometry/euclids-axioms"},{"title":"Большие простые числа","url":"/course/divisibility/primes#primes3"}]},"pythagoras":{"name":"Pythagoras","born":-570,"died":-495,"bio":"<p><strong>Пифагор Самосский</strong> (ок. 570 - 495 до н.э.) был древнегреческим философом и математиком. Он наиболее известен тем, что доказал <em>теорему Пифагора</em>, но сделал много других математических и научных открытий.</p><p>Пифагор попытался объяснить музыку математическим путем и обнаружил, что два тона звучат «хорошо» вместе (согласные), если отношение их частот - простая дробь.</p><p>Он также основал школу в Италии, где он и его ученики поклонялись математике почти как религии, следуя ряду странных правил - но в конечном итоге школа была сожжена их противниками.</p>","links":[{"title":"Теорема Пифагора","url":"/course/triangles/pythagoras"}]},"nicomachus":{"name":"Nicomachus","born":60,"died":120,"overflow":true,"bio":"<p><strong>Никомах Герасский</strong> (ок. 60 - 120) был древнегреческим математиком, который также много времени размышлял о мистических свойствах чисел. Его книга <em>Введение в арифметику</em> содержит первое упоминание о совершенных числах.</p>","links":[{"title":"Совершенные числа","url":"/course/sequences/special#perfect"}]},"collatz":{"name":"Collatz","bio":"<p><strong>Лотар Коллатц</strong> (1910 - 1990) - немецкий математик, работающий над дифференциальными уравнениями и задачами оптимизации. Проблема <em>гипотезы Коллатца</em> или <span class=\"math\" data-voice=\"3 x plus 1\"><mn>3</mn><mi>x</mi><mo value=\"+\">+</mo><mn>1</mn></span> названа в его честь и до сих пор не решена.</p>"},"conway":{"name":"Conway","born":1937,"died":2020,"bio":"<p><strong>Джон Хортон Конвей</strong> (1937–2020) был британским математиком, который работал в Кембриджском и Принстонском университетах. Он был членом Королевского общества и первым лауреатом премии Пойа.</p><p>Он исследовал основную математику повседневных предметов, таких как узлы и игры, и он внес вклад в теорию групп, теорию чисел и многие другие области математики. Конвей известен тем, что изобрел «Игру жизни Конвея», <em>клеточный автомат</em> с захватывающими свойствами.</p>","links":[{"title":"Последовательность \"Посмотри и скажи\"","url":"/course/sequences/special#look-and-say"}]},"pascal":{"name":"Pascal","born":1623,"died":1662,"bio":"<p><strong>Блез Паскаль</strong> (1623 - 1662) был французским математиком, физиком и философом. Он изобрел некоторые из первых механических калькуляторов, а также работал над проективной геометрией, теории вероятности и физикой вакуума.</p><p>Наиболее известный Паскаль известен тем, что назвал <em>Треугольник Паскаля</em>, бесконечный треугольник чисел с удивительными свойствами.</p>","links":[{"title":"Вероятность","url":"/course/probability/introduction"},{"title":"Треугольник Паскаля","url":"/course/sequences/pascals-triangle"}]},"pingala":{"name":"Pingala","born":-330,"died":-270,"bio":"<p><strong>Пингала</strong> (पिङ्गल) был древнеиндийским поэтом и математиком, который жил около 300 г. до н.э., но очень мало известно о его жизни. Он написал «Чандас-шастру», где математически анализировал санскритскую поэзию. Он также предоставил первые известные объяснения двоичных чисел, чисел Фибоначчи и треугольника Паскаля.</p>","links":[{"title":"Треугольник Паскаля","url":"/course/sequences/pascals-triangle"}]},"khayyam":{"name":"Khayyam","born":1048,"died":1131,"bio":"<p><strong>Омар Хайям</strong> (عمر خیّام, 1048 - 1131) был персидским математиком, астрономом и поэтом. Ему удалось классифицировать и решить все кубические уравнения, и он нашел новые способы понять <strong>параллельную аксиому Евклида</strong>. Хайям также разработал <em>календарь Джалали</em>, точный солнечный календарь, который до сих пор используется в некоторых странах.</p>","links":[{"title":"Треугольник Паскаля","url":"/course/sequences/pascals-triangle"}]},"singmaster":{"name":"Singmaster","bio":"<p><strong>Дэвид Сингмастер</strong> (1939 года рождения) - американский математик, который особенно известен своими математическими головоломками. Он был первым, кто предложил математические алгоритмы для анализа и решения <em>кубика Рубика</em>.</p>"}}