{"halley":{"name":"Halley","bio":"<p><strong>Edmond Halley</strong> (1656 – 1742) was an English mathematician and physicist, and the second <em>Astronomer Royal</em>. He calculated the orbit of Halley’s Comet, which is named after him.</p>"},"gauss":{"name":"Gauss","full":"Carl Friedrich Gauss","born":1777,"died":1855,"bio":"<p><strong>Carl Friedrich Gauss</strong> (1777 – 1855) was arguably the greatest mathematician in history. He made groundbreaking discoveries in just about every field of mathematics, from algebra and number theory to statistics, calculus, geometry, geology and astronomy.</p><p>According to legend, he corrected a mistake in his father‘s accounting at the age of 3, and found a way to quickly add up all integers from 1 to 100 at the age of 8. He made his first important discoveries while still a teenager, and later tutored many other famous mathematicians as Professor.</p>","links":[{"title":"Prime Number Theorem","url":"/course/divisibility/the-distribution-of-primes#riemann"},{"title":"Non-Euclidean Geometry","url":"/world/Dimensions_and_Distortions"},{"title":"Sums of Triangle Numbers","url":"/course/sequences/figurate#triangle-sums"}]},"fibonacci":{"name":"Fibonacci","born":1175,"died":1250,"bio":"<p><strong>Leonardo Pisano</strong>, commonly known as <strong>Fibonacci</strong> (1175 – 1250) was an Italian mathematician. He is best known for the number sequence named after him: 1, 1, 2, 3, 5, 8, 13, …</p><p>Fibonacci is also responsible for popularising the Arabic numerals (0, 1, 2, 3, 4, …) in Europe, which was still using Roman numerals (I, V, X, D, …) in the 12th century CE. He explained the decimal system in a book called “Liber Abaci”, a practical textbook for merchants.</p>","links":[{"title":"Fibonacci Numbers","url":"/course/sequences/fibonacci"}]},"euclid":{"name":"Euclid","full":"Euclid of Alexandria","born":-330,"died":-270,"location":"africa","bio":"<p><strong>Euclid of Alexandria</strong> (around 300 BCE) was a Greek mathematician and is often called the <em>father of geometry</em>. He published a book <em>Elements</em> that first introduced Euclidean geometry and contained many important proofs in geometry and number theory. It was the main mathematics textbook until the 19th century. He taught mathematics in Alexandria, but very little else is known about his life.</p>","links":[{"title":"Euclid’s Axioms","url":"/course/euclidean-geometry/euclids-axioms"},{"title":"Infinitely many Primes","url":"/course/divisibility/primes#primes3"}]},"pythagoras":{"name":"Pythagoras","born":-570,"died":-495,"overflow":true,"bio":"<p><strong>Pythagoras of Samos</strong> (c. 570 – 495 BCE) was a Greek philosopher and mathematician. He is best known for proving <em>Pythagoras’ Theorem</em>, but made many other mathematical and scientific discoveries.</p><p>Pythagoras tried to explain music in a mathematical way, and discovered that two tones sound “nice” together (consonant) if the ratio of their frequencies is a simple fraction.</p><p>He also founded a school in Italy where he and his students worshipped mathematics almost like a religion, while following a number of bizarre rules – but the school was eventually burned down by their adversaries.</p>","links":[{"title":"Pythagoras’ Theorem","url":"/course/triangles/pythagoras"}]},"nicomachus":{"name":"Nicomachus","full":"Nicomachus of Gerasa","born":60,"died":120,"overflow":true,"location":"middle-east","bio":"<p><strong>Nicomachus of Gerasa</strong> (c. 60 – 120) was an ancient Greek mathematician who also spent much time thinking about the mystical properties of numbers. His book <em>Introduction to Arithmetic</em> contains the first mention of perfect numbers.</p>","links":[{"title":"Perfect Numbers","url":"/course/sequences/special#perfect"}]},"collatz":{"name":"Collatz","bio":"<p><strong>Lothar Collatz</strong> (1910 – 1990) was a German mathematician working on differential equations and optimisation problems. The <em>Collatz conjecture</em> or <span class=\"math\" data-voice=\"3 x plus 1\"><mn>3</mn><mi>x</mi><mo value=\"+\">+</mo><mn>1</mn></span> problem is named after him – and still unsolved.</p>"},"conway":{"name":"Conway","full":"John Horton Conway","born":1937,"died":2020,"bio":"<p><strong>John Horton Conway</strong> (1937 – 2020) was a British mathematician who worked at Cambridge and Princeton University. He was a fellow of the Royal Society, and the first recipient of the Pólya Prize.</p><p>He explored the underlying mathematics of everyday objects like knots and games, and he contributed to group theory, number theory and many other areas of mathematics. Conway is known for inventing “Conway’s Game of Life”, a <em>cellular automaton</em> with fascinating properties.</p>","links":[{"title":"Look-and-say Sequence","url":"/course/sequences/special#look-and-say"}]},"pascal":{"name":"Pascal","full":"Blaise Pascal","born":1623,"died":1662,"bio":"<p><strong>Blaise Pascal</strong> (1623 – 1662) was a French mathematician, physicist and philosopher. He invented some of the first mechanical calculators, as well as working on projective geometry, probability and the physics of the vacuum.</p><p>Most famously, Pascal is remembered for naming <em>Pascal’s Triangle</em>, an infinite triangle of numbers with some amazing properties.</p>","links":[{"title":"Probability","url":"/course/probability/introduction"},{"title":"Pascal’s Triangle","url":"/course/sequences/pascals-triangle"}]},"pingala":{"name":"Pingala","born":-330,"died":-270,"location":"asia","bio":"<p><strong>Pingala</strong> (पिङ्गल) was an ancient Indian poet and mathematician who lived around 300 BCE, but very little is known about his life. He wrote the Chandaḥśāstra, where he analysed Sanskrit poetry mathematically. It also contained the first known explanations of binary numbers, Fibonacci numbers and Pascal’s triangle.</p>","links":[{"title":"Pascal’s Triangle","url":"/course/sequences/pascals-triangle"}]},"khayyam":{"name":"Khayyam","full":"Omar Khayyam","born":1048,"died":1131,"location":"middle-east","bio":"<p><strong>Omar Khayyam</strong> (عمر خیّام‎, 1048 – 1131) was a Persian mathematician, astronomer and poet. He managed to classify and solve all cubic equations, and found new ways to understand Euclid’s <em>parallel axiom</em>. Khayyam also designed the <em>Jalali calendar</em>, a precise solar calendar that is still used in some countries.</p>","links":[{"title":"Pascal’s Triangle","url":"/course/sequences/pascals-triangle"}]},"singmaster":{"name":"Singmaster","bio":"<p><strong>David Singmaster</strong> (born 1939) is an American mathematician who is particularly well known for his mathematical puzzles and brain teasers. He was the first to come up with mathematical algorithms for analysing and solving the <em>Rubik’s Cube</em>.</p>"}}