{"thales":{"name":"Thales","born":-624,"died":-546,"bio":"<p><strong>Milet’li Tales</strong> (M.Ö. 624 – 546 ) Yunan bir matematikçi ve filozoftu.</p><p>Thales genellikle Batı medeniyetinde ilk bilim insanı olarak tanınır: doğal fenomenleri din ya da mitoloji kullanmak yerine bilimsel bir yaklaşımla açıklamaya çalıştı. Ayrıca tarihte matematiksel bir keşfe ismi verilen ilk kişidir: Thales teoremi.</p>","links":[{"title":"Thales Teoremi","url":"/course/euclidean-geometry/introduction"}]},"euclid":{"name":"Euclid","born":-330,"died":-270,"bio":"<p><strong>İskenderiye’li Öklid</strong> (M.Ö. 300 civarında) <em>geometrinin babası</em> olarak bilinen Yunan bir matematikçiydi. Öklid geometrisini tanıtan ve geometri ile sayı teorisinde birçok önemli ispat içeren _Elementler _ adında bir kitap yazdı. Bu kitap, 19. yüzyıla kadar ana matematik ders kitabı olarak kullanıldı. İskenderiye'de matematik dersleri verdi, fakat hayatı hakkında çok az şey biliniyor.</p>","links":[{"title":"Öklid Geometrisinin Temel Aksiyomları","url":"/course/euclidean-geometry/euclids-axioms"},{"title":"Asal Sayıların Sonsuzluğu","url":"/course/divisibility/primes#primes3"}]},"newton":{"name":"Newton","born":1642,"died":1726,"bio":"<p><strong>Sir Isaac Newton</strong> (1642 – 1726) İngiliz bir fizikçi, matematikçi ve astronomdur. Bütün zamanların en etkin bilim insanlarındandır. Cambridge Üniversitesinde profesördü ve Londra Kraliyet Akademisi’nin başkanıydı.</p><p><em>Principia Mathematica</em> isimli kitabında hareket ve yer çekimi yasalarını tasvir etmiştir. Bu eser, klasik fiziğin temellerini oluşturup yazıldıktan sonraki üçyüzyıl boyunca evren hakkındaki görüşümüzü domine etmiştir.</p><p>Newton kalkülüsü icat etmek, ilk yansıtmalı teleskobu yapmak, sesin hızını hesaplamak, akışkanların hareketini incelemek ve prizmaların güneş ışığını gökkuşağı spektrumuna çevirmesinden tola çıkarak renklere dair teoriler geliştirmek gibi pek çok çalışma yapmıştır.</p>","links":[{"title":"Yerçekimi","url":"/course/circles/conic-sections#newton"},{"title":"Pi'nin basamakları","url":"/course/circles/introduction#pi-record"}]},"jefferson":{"name":"Jefferson","bio":"<p><strong>Thomas Jefferson</strong> (1743 – 1826), Amerika Birleşik Devletleri’nin kurucu babalarındandı, üçüncü başkanlarıydı ve Bağımsızlık Bildirgesinin ana yazarıydı.</p><p>Siyasi çalışmalarına ek olarak matematik, mekanik, bitki yetiştiriciliği alanlarında çalışmalar yapmış, mimar olarak çalışmıştır. Resmi görevinden emekli olduktan sonra Virginia Üniversitesi’ni kurmuştur.</p>"},"archimedes":{"name":"Archimedes","born":-287,"died":-212,"bio":"<p><strong>Arşimed</strong> (M.Ö. 287 – 212 ) eski bir Yunan bilim insanı ve mühendisiydi. Tüm zamanların en büyük matematikçilerinden biriydi. Birçok matematik kavramını keşfetti. Geometri, analiz ve mekanik alanlarında çalıştı.</p><p>Arşimed, banyo yaparken, cisimlerin suya batırılımasıyla meydana gelen suyun yer değiştirme miktarını kullanarak düzensiz cisimlerin hacmini belirlemenin bir yolunu buldu. Bu keşif sayesinde öylesine heyecanlandı ki, sokakta, hala soyunmuş halde iken <em>“Eureka!”</em> diye bağırdı (Yunanca’da <em>“Onu buldum!”</em>).</p><p>Sicilya'daki memleketi Syracuse'nin kuşatması sırasında, bir mühendis olarak, ustalıkla savunma makineleri yaptı. İki yıl sonra, Romalıların sonunda girmeyi başardığı Syracuse’ta Arşimed öldürüldü. Son sözleri, o sırada üzerinde çalıştığı <em>“Çemberlerime dokunma”</em> idi.</p>","links":[{"title":"Arşimed Cisimleri","url":"/course/polyhedra/platonic"}]}}