{"thales":{"name":"Thales","born":-624,"died":-546,"bio":"<p><strong>Фалес Милетский</strong> (ок. 624 - 546 до н.э.) был греческим математиком и философом.</p><p>Фалеса часто признают первым ученым в западной цивилизации: вместо того, чтобы использовать религию или мифологию, он пытался объяснить явления природы, используя научный подход. Он также является первым человеком в истории, у которого есть математическое открытие, названное его именем: теорема Фалеса.</p>","links":[{"title":"Теорема Фалеса","url":"/course/euclidean-geometry/introduction"}]},"euclid":{"name":"Euclid","born":-330,"died":-270,"bio":"<p><strong>Александрийский Эвклид</strong> (около 300 г. до н.э.) был греческим математиком и его часто называют <em>отцом геометрии</em>. Он опубликовал книгу <em>Elements</em>, которая впервые представила евклидову геометрию и содержала много важных доказательств в геометрии и теории чисел. Это был основной учебник по математике до 19 века. Он преподавал математику в Александрии, но очень мало что известно о его жизни.</p>","links":[{"title":"Аксиомы Эвклида","url":"/course/euclidean-geometry/euclids-axioms"},{"title":"Большие простые числа","url":"/course/divisibility/primes#primes3"}]},"newton":{"name":"Newton","born":1642,"died":1726,"bio":"<p><strong>Сэр Исаак Ньютон</strong> (1642 - 1726) был английским физиком, математиком и астрономом, и одним из самых влиятельных ученых всех времен. Он был профессором в Кембриджском университете и президентом Лондонского королевского общества.</p><p>В своей книге <em>Математические основы натуральной философии</em> Ньютон сформулировал законы движения и гравитации, которые заложили основы классической физики и доминировали в нашем взгляде на Вселенную в течение следующих трех столетий.</p><p>Помимо всего прочего, Ньютон был одним из изобретателей исчисления, построил первый отражающий телескоп, рассчитал скорость звука, изучил движение жидкостей и разработал теорию цвета, основанную на том, как призмы разделяют солнечный свет на спектральные цвета.</p>","links":[{"title":"Гравитация","url":"/course/circles/conic-sections#newton"},{"title":"Число Пи","url":"/course/circles/introduction#pi-record"}]},"jefferson":{"name":"Jefferson","bio":"<p><strong>Томас Джефферсон</strong> (1743 - 1826) был одним из отцов-основателей Соединенных Штатов, их третьим президентом и основным автором Декларации независимости.</p><p>Помимо работы в политике, он изучал математику, садоводство, механику и работал архитектором. После ухода с государственной должности Джефферсон основал Университет Вирджинии.</p>"},"archimedes":{"name":"Archimedes","born":-287,"died":-212,"bio":"<p><strong>Архимед</strong> (ок. 287 - 212 до н.э.) был древнегреческим ученым и инженером и одним из величайших математиков всех времен. Он открыл много концепций исчисления и работал в области геометрии, анализа и механики.</p><p>Принимая ванну, Архимед нашел способ определить объем нерегулярных объектов, используя количество воды, которое они вытеснили при погружении в воду. Он был так взволнован этим открытием, что выбежал на улицу, все еще раздетый, крича <em>«Эврика!»</em> (по-гречески <em>«Я нашел это!»</em>).</p><p>Как инженер, он построил гениальные защитные машины во время осады его родного города Сиракузы на Сицилии. Через два года римлянам наконец удалось войти, и Архимед был убит. Его последними словами были <em>«Не мешай моим кругам»</em> - которые он изучал в то время.</p>","links":[{"title":"Архимедово тело","url":"/course/polyhedra/platonic#archimedean"}]}}