{"thales":{"name":"Thales","full":"Thales of Miletus","born":-624,"died":-546,"location":"asia","bio":"<p><strong>Thales of Miletus</strong> (c. 624 – 546 BCE) was a Greek mathematician and philosopher.</p><p>Thales is often recognised as the first scientist in Western civilisation: rather than using religion or mythology, he tried to explain natural phenomena using a scientific approach. He is also the first individual in history that has a mathematical discovery named after him: Thales’ theorem.</p>","links":[{"title":"Thales’ Theorem","url":"/course/euclidean-geometry/introduction"}]},"euclid":{"name":"Euclid","full":"Euclid of Alexandria","born":-330,"died":-270,"location":"africa","bio":"<p><strong>Euclid of Alexandria</strong> (around 300 BCE) was a Greek mathematician and is often called the <em>father of geometry</em>. He published a book <em>Elements</em> that first introduced Euclidean geometry and contained many important proofs in geometry and number theory. It was the main mathematics textbook until the 19th century. He taught mathematics in Alexandria, but very little else is known about his life.</p>","links":[{"title":"Euclid’s Axioms","url":"/course/euclidean-geometry/euclids-axioms"},{"title":"Infinitely many Primes","url":"/course/divisibility/primes#primes3"}]},"newton":{"name":"Newton","full":"Isaac Newton","born":1642,"died":1726,"bio":"<p><strong>Sir Isaac Newton</strong> (1642 – 1726) was an English physicist, mathematician, and astronomer, and one of the most influential scientists of all time. He was a professor at Cambridge University, and president of the Royal Society in London.</p><p>In his book <em>Principia Mathematica</em>, Newton formulated the laws of motion and gravity, which laid the foundations for classical physics and dominated our view of the universe for the next three centuries.</p><p>Among many other things, Newton was one of the inventors of calculus, built the first reflecting telescope, calculated the speed of sound, studied the motion of fluids, and developed a theory of colour based on how prisms split sunlight into a rainbow-coloured spectrum.</p>","links":[{"title":"Gravity","url":"/course/circles/conic-sections#newton"},{"title":"Digits of Pi","url":"/course/circles/introduction#pi-record"}]},"jefferson":{"name":"Jefferson","full":"Thomas Jefferson","bio":"<p><strong>Thomas Jefferson</strong> (1743 – 1826), was one of the Founding fathers of the United States, their third president, and the principal author of the Declaration of Independence.</p><p>In addition to his work in politics, he studied mathematics, horticulture, mechanics, and worked as an architect. After retiring from public office, Jefferson founded the University of Virginia.</p>"},"archimedes":{"name":"Archimedes","born":-287,"died":-212,"bio":"<p><strong>Archimedes</strong> (c. 287 – 212 BCE) was an ancient Greek scientist and engineer, and one of the greatest mathematicians of all time. He discovered many concepts of calculus and worked in geometry, analysis and mechanics.</p><p>While taking a bath, Archimedes discovered a way to determine the volume of irregular objects using the amount of water they displaced when submerged. He was so excited by this discovery that he ran out on the street, still undressed, yelling <em>“Eureka!”</em> (Greek for <em>“I have found it!”</em>).</p><p>As an engineer, he built ingenious defence machines during the siege of his home city Syracuse in Sicily. After two years, the Romans finally managed to enter, and Archimedes was killed. His last words were <em>“Do not disturb my circles”</em> – which he was studying at the time.</p>","links":[{"title":"Archimedean Solids","url":"/course/polyhedra/platonic#archimedean"}]}}