{"thales":{"name":"Thales","born":-624,"died":-546,"bio":"<p><strong>Thales von Milet</strong> (ca. 624 – 546 v. Chr.) war ein griechischer Mathematiker und Philosoph.</p><p>Thales wird oft als der erste Wissenschaftler in der westlichen Zivilisation anerkannt: Anstatt Religion oder Mythologie zu verwenden, versuchte er, Naturphänomene mit einem wissenschaftlichen Ansatz zu erklären. Er ist auch das erste Individuum in der Geschichte, dessen mathematische Entdeckung nach ihm benannt wurde: Thales 'Theorem.</p>","links":[{"title":"Satz des Thales","url":"/course/euclidean-geometry/introduction"}]},"euclid":{"name":"Euclid","born":-330,"died":-270,"bio":"<p><strong>Euklid von Alexandria</strong> (um 300 v. Chr.) war ein griechischer Mathematiker und wird oft als <em>Vater der Geometrie</em> bezeichnet. Er veröffentlichte ein Buch namens <em>Elemente</em>, indem die euklidische Geometrie erstmals eingeführt wurde und das viele wichtige Beweise auf den Gebieten der Geometrie und Zahlentheorie enthielt. Es war bis ins 19. Jahrhundert das wichtigste mathematische Lehrbuch. Er lehrte Mathematik in Alexandria, aber über sein Leben ist nur sehr wenig bekannt.</p>","links":[{"title":"Satz des Euklid","url":"/course/euclidean-geometry/euclids-axioms"},{"title":"Unendlich viele Primzahlen","url":"/course/divisibility/primes#primes3"}]},"newton":{"name":"Newton","born":1642,"died":1726,"bio":"<p><strong>Sir Isaac Newton</strong> (1642 – 1726) war ein englischer Physiker, Mathematiker und Astronom und einer der einflussreichsten Wissenschaftler aller Zeiten. Er war Professor an der Cambridge University und Präsident der Royal Society in London.</p><p>In seinem Buch <em>Principia Mathematica</em> formulierte Newton die Gesetze von Bewegung und Schwerkraft, die den Grundstein für die klassische Physik legten und unsere Sicht auf das Universum für die nächsten drei Jahrhunderte dominierten.</p><p>Newton war unter anderem einer der Erfinder der Infinitesimalrechnung, baute das erste Spiegelteleskop, berechnete die Schallgeschwindigkeit, studierte die Bewegung von Flüssigkeiten und entwickelte eine Farbtheorie, die darauf basiert, wie Prismen das Sonnenlicht in ein regenbogenfarbenes Spektrum aufteilen.</p>","links":[{"title":"Schwerkraft","url":"/course/circles/conic-sections#newton"},{"title":"Ziffern von Pi","url":"/course/circles/introduction#pi-record"}]},"jefferson":{"name":"Jefferson","bio":"<p><strong>Thomas Jefferson</strong> (1743 – 1826), war einer der Gründerväter der Vereinigten Staaten, ihr dritter Präsident und Hauptautor der Unabhängigkeitserklärung.</p><p>Neben seiner Tätigkeit in der Politik studierte er Mathematik, Gartenbau, Mechanik und arbeitete als Architekt. Nach seinem Rückzug aus dem öffentlichen Dienst gründete Jefferson die University of Virginia.</p>"},"archimedes":{"name":"Archimedes","born":-287,"died":-212,"bio":"<p><strong>Archimedes</strong> (ca. 287 – ca. 212 v. Chr.) war ein altgriechischer Wissenschaftler und Ingenieur sowie einer der größten Mathematiker aller Zeiten. Er entdeckte viele Rechenmethoden und beschäftigte sich mit Geometrie, Analysis und Mechanik.</p><p>Beim Baden entdeckte Archimedes eine Möglichkeit, das Volumen unregelmäßiger Objekte anhand der Wassermenge zu bestimmen, die sie beim Eintauchen verdrängen. Er war so begeistert von dieser Entdeckung, dass er, noch immer nackt, auf die Straße rannte und laut <em>“Heureka!”</em> (griechisch für <em>“Ich hab’s gefunden!”</em>) schrie.</p><p>Als Ingenieur baute er während der Belagerung seiner Heimatstadt Syrakus auf Sizilien geniale Verteidigungsmaschinen. Nach zwei Jahren gelang es den Römern endlich sie zu erobern und Archimedes wurde getötet. Seine letzten Worte waren: <em>“Stört meine Kreise nicht”</em> – da er diese damals studierte.</p>","links":[{"title":"Archimedische Körper","url":"/course/polyhedra/platonic"}]}}