{"proof":{"title":"Demonstrație","text":"<p>O <strong>demonstrație</strong> este un raționament care arată fără nicio urmă de îndoială că o anume afirmație este adevărată.</p>"},"point":{"title":"Punct","text":"<p>Un <strong>punct</strong> este o locație anume în spațiu. Punctele descriu o poziție, dar nu au dimensiune sau formă.</p>","link":"/course/euclidean-geometry/definitions#points"},"line":{"title":"Dreaptă","text":"<p>O <strong>dreaptă</strong> este un set infinit de puncte ce se prelungește la nesfârșit în ambele direcții. Dreptele sunt întotdeauna drepte și nu au <em>lățime</em>.</p>","link":"/course/euclidean-geometry/definitions#lines"},"line-segment":{"title":"Segment de dreaptă","text":"<p>Un <strong>segment de dreaptă</strong> este o bucata a unei drepte ce se află între două puncte, fără a se prelungi la nesfârșit. Segmentele de dreaptă de la punctul <em>A</em> la punctul <em>B</em> se notează <span class=\"nowrap\"><span class=\"math\" data-voice=\"bar of AB\"><mover><mi>AB</mi><mo value=\"‾\">‾</mo></mover></span>.</span></p>","link":"/course/euclidean-geometry/definitions#segments"},"ray":{"title":"Semidreaptă","text":"<p>O <strong>semidreaptă</strong> este o porțiune dintr-o dreaptă care începe dintr-un punct și se prelungește la infinit într-o singură direcție. Semidreapta care începe din <span class=\"math\" data-voice=\"A\"><mi>A</mi></span> se notează <span class=\"nowrap\"><span class=\"math\" data-voice=\"vec of AB\"><mover><mi>AB</mi><mo value=\"→\">→</mo></mover></span>.</span></p>","link":"/course/euclidean-geometry/definitions#rays"},"circle":{"title":"Cerc","text":"<p>Un <strong>cerc</strong> este mulțimea tuturor punctelor din plan aflate la o distanță fixă (<em>rază</em>) față de un punct dat (<em>centru</em>).</p>","image":"circle.svg","link":"/course/circles/introduction#radius"},"circle-radius":{"title":"Rază","text":"<p><strong>Raza</strong> unui cerc este distanța (sau segmentul de dreaptă) dintre centru și orice punct aflat pe circumferința sa.</p>","link":"/course/circles/introduction#radius"},"congruent":{"title":"Congruența","text":"<p>În geometrie, două figuri geometrice sunt <strong>congruente</strong> dacă sunt identice ca dimensiune, formă și mărime. Asta înseamnă că le putem muta, răsturna sau roti astfel încât să se potrivească exact una peste alta.</p>","link":"/course/euclidean-geometry/definitions#congruence"},"parallel":{"title":"Drepte paralele","text":"<p>Două sau mai multe drepte sunt <strong>paralele</strong> dacă nu se intersectează niciodată. Ele au aceeași pantă, iar distanța dintre ele este întotdeauna constantă.</p>","image":"parallel.svg","link":"/course/euclidean-geometry/definitions#parallel"},"perpendicular":{"title":"Drepte perpendiculare","text":"<p>Două drepte sunt <strong>perpendiculare</strong> (uneori numite <em>ortogonale</em>) dacă intersectia lor formează un unghi drept.</p>","image":"perpendicular.svg","link":"/course/euclidean-geometry/definitions#perpendicular"},"axiom":{"title":"Axiomă","text":"<p>O <strong>axiomă</strong>, numită uneori și <strong>postulat</strong>, este un enunț matematic considerat evident și care nu mai trebuie dovedit. Ar trebui să fie atât de simplă, încât este adevărată în mod evident și incontestabil.</p><p>Axiomele formeaza fundația matematicii și pot fi folosite pentru a demonstra alte rezultate mai complexe.</p>"},"equilateral-triangle":{"title":"Triunghi echilateral","text":"<p>Un <strong>triunghi echilateral</strong> este un triunghi care are toate laturile egale.</p>"},"euclidean-geometry":{"title":"Geometria euclidiană","text":"<p><strong>Geometria euclidiană</strong> este tipul de geometrie concepută de matematicianul <em>Euclid</em>. Ea studiază punctele, dreptele, poligoanele, cercurile, precum și formele geometrice tridimensionale. Depinde de doar cinci <em>axiome</em>, legile de bază ale geometriei, ce descriu toate operațiunile și construcțiile permise.</p>","link":"/course/euclidean-geometry/euclids-axioms#euclid"},"dodecahedron":{"title":"Dodecaedru","text":"<p><strong>Dodecaedrul</strong> este un poliedru cu douăsprezece fețe care sunt pentagoane regulate. El are 20 de vârfuri și 30 de muchii.</p>","link":"/course/polyhedra/platonic#platonic-overview"},"dna":{"title":"ADN","text":"<p><strong>ADN</strong>-ul (acidul dezoxiribonucleic) este o moleculă care conține codul genetic al fiecărui organism viu. Majoritatea ADN-urilor constau din două lanțuri organice ce formează un <em>dublu helix</em>. Informația genetică este codificată în ordinea a patru acizi nucleici (A, G, C și T). <em>Secvențierea ADN-ului</em> este metoda de extragere a acestei informații - o procedura esențială în biologie, medicină, genetică și biotehnologie.</p>"},"molecule":{"title":"Moleculă","text":"<p>O <strong>moleculă</strong> este formată din doi sau mai mulți atomi ce sunt legați prin legături chimice. Spre deosebire de <em>_ioni</em>, molecula nu are sarcină electrică.</p><p>Exemplele de molecule includ <span class=\"nowrap\"><span class=\"math\" data-voice=\"O 2\"><msub><mi>O</mi><mn>2</mn></msub></span>,</span> ce este formată din doi atomi de oxigen legați și <span class=\"nowrap\"><span class=\"math\" data-voice=\"H 2 O\"><msub><mi>H</mi><mn>2</mn></msub><mi>O</mi></span>,</span> ce este formată din doi atomi de hidrogen și unul de oxigen.</p>"},"protein":{"title":"Proteină","text":"<p>O <strong>proteină</strong> este o <em>macromoleculă</em> mare ce poate efectua multe funcții diferite în interiorul organismelor vii: de la digestie pâna la comunicarea intercelulară sau replicarea ADN-ului. Proteinele sunt formate din unul sau mai multe lanțuri de aminoacizi.</p>"}}