{"proof":{"title":"Beweis","text":"<p>Ein <strong>Beweis</strong> ist ein logisches Argument, das ohne Zweifel zeigt, dass eine bestimmte Aussage wahr ist.</p>"},"point":{"title":"Punkt","text":"<p>Ein <strong>Punkt</strong> ist eine bestimmte Position im Raum. Punkte beschreiben eine Position, haben aber selbst keine Größe oder Form.</p>","link":"/course/euclidean-geometry/definitions#points"},"line":{"title":"Gerade","text":"<p>Eine <strong>Gerade</strong> besteht aus unendlich vielen Punkten, die sich ohne Anfang und Ende in beide Richtungen erstrecken. Geraden sind nicht gekrümmt und haben keine <em>Breite</em>.</p>","link":"/course/euclidean-geometry/definitions#lines"},"line-segment":{"title":"Strecke","text":"<p>Eine <strong>Strecke</strong> ist der Teil einer Geraden, der zwischen zwei Punkten liegt, ohne sich bis zur Unendlichkeit zu erstrecken. Wir können Strecken von Punkt <em>A</em> nach Punkt <em>B</em> als <span class=\"math\" data-voice=\"bar of AB\"><mover><mi>AB</mi><mo value=\"‾\">‾</mo></mover></span> bezeichnen.</p>","link":"/course/euclidean-geometry/definitions#segments"},"ray":{"title":"Strahl (Halbgerade)","text":"<p>Ein <strong>Strahl</strong> ist der Teil einer Geraden, der sich ausgehend von einem Startpunkt nur in eine Richtung bis zur Unendlichkeit erstreckt. Wir schreiben für einen Strahl der von <span class=\"math\" data-voice=\"A\"><mi>A</mi></span> ausgeht <span class=\"nowrap\"><span class=\"math\" data-voice=\"vec of AB\"><mover><mi>AB</mi><mo value=\"→\">→</mo></mover></span>.</span></p>","link":"/course/euclidean-geometry/definitions#rays"},"circle":{"title":"Kreis","text":"<p>Ein <strong>Kreis</strong> ist die Menge aller Punkte in einer Ebene (zweidimensional), die sich in einem bestimmten Abstand (dem <em>Radius</em>) von einem gegebenen Punkt (dem <em>Mittelpunkt</em>) befinden.</p>","image":"circle.svg","link":"/course/circles/introduction#radius"},"circle-radius":{"title":"Radius","text":"<p>Der <strong>Radius</strong> eines Kreises ist der Abstand (oder eine Strecke) zwischen seinem Mittelpunkt und einem beliebigen Punkt auf seinem Umfang.</p>","link":"/course/circles/introduction#radius"},"congruent":{"title":"Kongruenz","text":"<p>In der Geometrie sind zwei Figuren <strong>kongruent</strong> (deckungsgleich), wenn sie in Größe, Form und Maß identisch sind. Das bedeutet, dass wir sie so bewegen, drehen oder wenden können, dass sie exakt übereinander zu liegen kommen.</p>","link":"/course/euclidean-geometry/axioms#congruence"},"parallel":{"title":"Parallele Geraden","text":"<p>Zwei oder mehr Geraden sind <strong>parallel</strong>, wenn sie sich nie schneiden. Sie haben die gleiche Steigung und der Abstand zwischen ihnen ist immer konstant.</p>","image":"parallel.svg","link":"/course/euclidean-geometry/definitions#parallel"},"perpendicular":{"title":"Senkrechte Geraden (Normale)","text":"<p>Zwei Geraden sind <strong>senkrecht</strong> (manchmal auch <em>normal</em> oder <em>orthogonal</em> genannt), wenn sie sich im rechten Winkel schneiden.</p>","image":"perpendicular.svg","link":"/course/euclidean-geometry/definitions#perpendicular"},"axiom":{"title":"Axiom |","text":"<p>Ein <strong>Axiom</strong>, manchmal auch <strong>Postulat</strong> genannt, ist eine mathematische Aussage , die als \"selbstverständlich\" angesehen und ohne Beweis akzeptiert wird. Es sollte also so einfach sein, dass es offensichtlich und zweifellos wahr ist.</p><p>Axiome bilden die Grundlage der Mathematik und können verwendet werden, um andere, komplexere Ergebnisse zu beweisen.</p>"},"equilateral-triangle":{"title":"Gleichseitiges Dreieck","text":"<p>Ein <strong>gleichseitiges Dreieck</strong> ist ein Dreieck, bei dem alle drei Seiten die gleiche Länge haben.</p>"},"euclidean-geometry":{"title":"Euklidische Geometrie","text":"<p>Die <strong>euklidische Geometrie</strong> ist die Art von Geometrie, wie sie sich der Mathematiker <em>Euklid</em> vorgestellt hat. Dabei werden Punkte, Geraden, Vielecke, Kreise und dreidimensionale Körper behandelt. Sie basiert auf nur fünf <em>Axiomen</em>, den Grundgesetzen der Geometrie, die alle zulässigen Operationen und Konstruktionen beschreiben.</p>","link":"/course/euclidean-geometry/euclids-axioms#euclid"},"dodecahedron":{"title":"Dodekaeder","text":"<p>Das <strong>Dodekaeder</strong> ist ein platonischer Körper und aus besteht 12 Flächen, die alle regelmäßige Fünfecke sind. Er hat 20 Eckpunkte und 30 Kanten.</p>","link":"/course/polyhedra/platonic#platonic-overview"},"dna":{"title":"DNA","text":"<p><strong>DNA</strong> (Desoxyribonukleinsäure) ist ein Molekül, das den genetischen Bauplan aller lebenden Organismen enthält. Die meisten DNAs bestehen aus zwei Strängen, die eine <em>Doppelhelix</em> bilden. Die genetische Information wird in der Größenordnung von vier Nukleinsäuren (A, G, C und T) kodiert, aus denen sich die DNA zusammensetzt. <em>DNA-Sequenzierung</em> ist der Prozess der Extraktion dieser Information - eine wesentliche Technik in Biologie, Medizin, Genetik und Biotechnologie.</p>"},"molecule":{"title":"Molekül","text":"<p>Ein <strong>Molekül</strong> besteht aus zwei oder mehreren Atomen, die durchchemische Bindungen zusammengehalten werden. Es hat keine elektrische Ladung, im Gegensatz zu <strong>Ionen</strong>.</p><p>Beispiele für Moleküle sind <span class=\"nowrap\"><span class=\"math\" data-voice=\"O 2\"><msub><mi>O</mi><mn>2</mn></msub></span>,</span> das aus zwei verbundenen Sauerstoffatomen besteht, und <span class=\"nowrap\"><span class=\"math\" data-voice=\"H 2 O\"><msub><mi>H</mi><mn>2</mn></msub><mi>O</mi></span>,</span> das aus zwei Wasserstoffatomen und einem Sauerstoffatom besteht.</p>"},"protein":{"title":"protein","text":"<p>Ein <strong>Protein</strong> ist ein großes <em>Makromolekül</em>, das in lebenden Organismen viele verschiedene Funktionen erfüllen kann: von der Verdauung über die Kommunikation zwischen Zellen bis hin zur DNA-Replikation. Proteine bestehen aus einer oder mehreren Ketten von <em>Aminosäuren</em>.</p>"}}