{"proof":{"title":"доказательство","text":"<p><strong>доказательство</strong> - это логический аргумент, который, вне всякого сомнения, показывает, что определенное утверждение верно.</p>"},"point":{"title":"точка","text":"<p>Точка- это определенное место в пространстве. Точки описывают позицию, но не имеют размера или формы сами по себе.</p>","link":"/course/euclidean-geometry/definitions#points"},"line":{"title":"Линия","text":"<p>Линия- это множество бесконечного числа точек, которые простираются навсегда в обоих направлениях. Линии всегда прямые и не имеют <em>ширины</em>.</p>","link":"/course/euclidean-geometry/definitions#lines"},"line-segment":{"title":"Отрезок","text":"<p>Сегмент <strong>линии</strong> является частью линии, которая лежит между двумя точками, не доходя до бесконечности. Мы можем пометить отрезки линии от точки <em>A</em> до точки <em>B</em> как <span class=\"nowrap\"><span class=\"math\" data-voice=\"bar of AB\"><mover><mi>AB</mi><mo value=\"‾\">‾</mo></mover></span>.</span></p>","link":"/course/euclidean-geometry/definitions#segments"},"ray":{"title":"луч","text":"<p>Луч- это часть линии, которая начинается в точке и продолжается бесконечно в одном направлении. Мы можем пометить лучи, начиная с <span class=\"nowrap\"><span class=\"math\" data-voice=\"A\"><mi>A</mi></span>,</span> как <span class=\"nowrap\"><span class=\"math\" data-voice=\"vec of AB\"><mover><mi>AB</mi><mo value=\"→\">→</mo></mover></span>.</span></p>","link":"/course/euclidean-geometry/definitions#rays"},"circle":{"title":"Круг","text":"<p>Круг- это совокупность всех точек в двух измерениях на фиксированном расстоянии (радиус __) от заданной точки (центр __).</p>","image":"circle.svg","link":"/course/circles/introduction#radius"},"circle-radius":{"title":"Радиус","text":"<p>Радиусокружности - это расстояние (или отрезок) между его центром и любой точкой на его окружности.</p>","link":"/course/circles/introduction#radius"},"congruent":{"title":"конгруэнтность","text":"<p>В геометрии две фигуры являются <strong>конгруэнтными</strong>, если они идентичны по размеру, форме и размеру. Это означает, что мы можем перемещать, переворачивать или вращать их так, чтобы они точно подходили друг другу.</p>","link":"/course/euclidean-geometry/definitions#congruence"},"parallel":{"title":"Параллельные линии","text":"<p>Две или более линии параллельны ____, если они никогда не пересекаются. У них одинаковый наклон и расстояние между ними всегда постоянное.</p>","image":"parallel.svg","link":"/course/euclidean-geometry/definitions#parallel"},"perpendicular":{"title":"Перпендикулярные линии","text":"<p>Две линии перпендикулярны(иногда называемые <em>нормальными</em> или <em>ортогональными</em>), если они пересекаются под прямым углом.</p>","image":"perpendicular.svg","link":"/course/euclidean-geometry/definitions#perpendicular"},"axiom":{"title":"аксиома","text":"<p>Аксиома <strong>__, иногда называемая __постулатом</strong>, является математическим утверждением, которое считается «самоочевидным» и принимается без доказательства. Это должно быть так просто, что это, несомненно, верно.</p><p>Аксиомы составляют основу математики и могут быть использованы для доказательства других, более сложных результатов.</p>"},"equilateral-triangle":{"title":"Равносторонний треугольник","text":"<p><strong>равносторонний треугольник</strong> является треугольником, в котором все три стороны имеют одинаковую длину.</p>"},"euclidean-geometry":{"title":"Евклидова геометрия","text":"<p><strong>Евклидова геометрия</strong> является видом геометрии, предусмотренной математиком <em>Евклидом</em>, и включает в себя изучение точек, линий, многоугольников, окружностей, а также трехмерных тел. Это зависит только от пяти <em>аксиом</em>, основных законов геометрии, которые описывают все разрешенные операции и конструкции.</p>","link":"/course/euclidean-geometry/euclids-axioms#euclid"},"dodecahedron":{"title":"Додекаэдр","text":"<p><strong>Додекаэдр</strong> является платоновым телом и состоит из 12 граней, которые являются правильными пятиугольниками. Он имеет 20 вершин и 30 ребер.</p>","link":"/course/polyhedra/platonic#platonic-overview"},"dna":{"title":"GOUT","text":"<p><strong>ДНК</strong> (дезоксирибонуклеиновая кислота) - это молекула, которая содержит генетическую схему всех живых организмов. Большинство ДНК состоит из двух нитей, образующих <em>двойную спираль</em>. Генетическая информация кодируется в порядке четырех нуклеиновых кислот (A, G, C и T), которые составляют ДНК. <em>ДНК-секвенирование</em> - это процесс извлечения этой информации - важнейший метод в биологии, медицине, генетике и биотехнологии.</p>"},"molecule":{"title":"молекула","text":"<p>Молекуласостоит из двух или более атомов, которые удерживаются вместе химическими связями. Он не имеет электрического заряда, в отличие от <strong>ионов</strong>.</p><p>Примеры молекул включают <span class=\"nowrap\"><span class=\"math\" data-voice=\"O 2\"><msub><mi>O</mi><mn>2</mn></msub></span>,</span> который состоит из двух связанных атомов кислорода, и <span class=\"nowrap\"><span class=\"math\" data-voice=\"H 2 O\"><msub><mi>H</mi><mn>2</mn></msub><mi>O</mi></span>,</span> который состоит из двух атомов водорода и одного атома кислорода.</p>"},"protein":{"title":"белка","text":"<p>Белокпредставляет собой большую <em>макромолекулу</em>, которая может выполнять множество различных функций в живых организмах: от пищеварения до обмена данными между клетками или репликации ДНК. Белки состоят из одной или нескольких цепей из <em>аминокислотных остатков</em>.</p>"}}