{"proof":{"title":"Proof","text":"<p>A <strong>proof</strong> is a logical argument that shows beyond any doubt that a certain statement is true.</p>"},"point":{"title":"Point","text":"<p>A <strong>point</strong> is a specific location in space. Points describe a position, but have no size or shape themselves.</p>","link":"/course/euclidean-geometry/axioms#points"},"line":{"title":"Line","text":"<p>A <strong>line</strong> is a set of infinitely many points that extend forever in both directions. Lines are always straight and have no <em>width</em>.</p>","link":"/course/euclidean-geometry/axioms#lines"},"line-segment":{"title":"Line segment","text":"<p>A <strong>line segment</strong> is the part of a line that lies between two points, without extending to infinity. We can label line segments from point <em>A</em> to point <em>B</em> as <span class=\"nowrap\"><span class=\"math\" data-voice=\"bar of AB\"><mover><mi>AB</mi><mo value=\"‾\">‾</mo></mover></span>.</span></p>","link":"/course/euclidean-geometry/axioms#segments"},"ray":{"title":"Ray","text":"<p>A <strong>ray</strong> is the part of a line that starts at a point and extends infinitely in one direction. We can label rays starting at <span class=\"math\" data-voice=\"A\"><mi>A</mi></span> as <span class=\"nowrap\"><span class=\"math\" data-voice=\"vec of AB\"><mover><mi>AB</mi><mo value=\"→\">→</mo></mover></span>.</span></p>","link":"/course/euclidean-geometry/axioms#rays"},"circle":{"title":"Circle","text":"<p>A <strong>circle</strong> is the set of all points in two dimensions, at a fixed distance (the <em>radius</em>) from a given point (the <em>center</em>).</p>","image":"circle.svg","link":"/course/circles/introduction#radius"},"circle-radius":{"title":"Radius","text":"<p>The <strong>radius</strong> of a circle is the distance (or a line segment) between its center and any point on its circumference.</p>","link":"/course/circles/introduction#radius"},"congruent":{"title":"Congruence","text":"<p>In geometry, two figures are <strong>congruent</strong> if are identical in size, shape and measure. This means we could move, flip or rotate them to exactly fit on top of each other.</p>","link":"/course/euclidean-geometry/axioms#congruence"},"parallel":{"title":"Parallel lines","text":"<p>Two or more lines are <strong>parallel</strong> if they never intersect. They have the same slope and the distance between them is always constant.</p>","image":"parallel.svg","link":"/course/euclidean-geometry/axioms#parallel"},"perpendicular":{"title":"Perpendicular lines","text":"<p>Two lines are <strong>perpendicular</strong> (sometimes called <em>normal</em> or <em>orthogonal</em>) if they intersect at a right angle.</p>","image":"perpendicular.svg","link":"/course/euclidean-geometry/axioms#perpendicular"},"axiom":{"title":"Axiom","text":"<p>An <strong>axiom</strong>, sometimes called <strong>postulate</strong>, is a mathematical statement that is regarded as “self-evident” and accepted without proof. It should be so simple that it is obviously and unquestionably true.</p><p>Axioms form the foundation of mathematics and can be used to prove other, more complex results.</p>"},"equilateral-triangle":{"title":"Equilateral triangle","text":"<p>An <strong>equilateral triangle</strong> is a triangle in which all three sides have the same length.</p>"},"euclidean-geometry":{"title":"Euclidean geometry","text":"<p><strong>Euclidean geometry</strong> is the kind of geometry envisioned by the mathematician <em>Euclid</em>, and includes the study of points, lines, polygons, circles as well as three-dimensional solids. It depends on just five <em>axiom</em>, the basic laws of geometry, which describe all the permitted operations and constructions.</p>","link":"/course/euclidean-geometry/euclids-axioms#euclid"},"dodecahedron":{"title":"Dodecahedron","text":"<p>The <strong>dodecahedron</strong> is a Platonic solid and consists of 12 faces that are regular pentagons. It has 20 vertices and 30 edges.</p>","link":"/course/polyhedra/platonic#platonic-overview"},"dna":{"title":"DNA","text":"<p><strong>DNA</strong> (deoxyribonucleic acid) is a molecule that contains the genetic blueprint of all living organisms. Most DNAs consist of two strands forming a <em>double helix</em>. Genetic information is encoded in the order of four nucleic acids (A, G, C and T) which make up the DNA. <em>DNA sequencing</em> is the process of extracting this information – an essential technique in biology, medicine, genetics and biotechnology.</p>"},"molecule":{"title":"Molecule","text":"<p>A <strong>molecule</strong> consists of two or more atoms which are held together by chemical bonds. It has no electric charge, unlike <strong>Ions</strong>.</p><p>Examples of molecules include <span class=\"nowrap\"><span class=\"math\" data-voice=\"O 2\"><msub><mi>O</mi><mn>2</mn></msub></span>,</span> which consists of two connected Oxygen atoms, and <span class=\"nowrap\"><span class=\"math\" data-voice=\"H 2 O\"><msub><mi>H</mi><mn>2</mn></msub><mi>O</mi></span>,</span> which consists of two Hydrogen atoms and one Oxygen atom.</p>"},"protein":{"title":"Protein","text":"<p>A <strong>protein</strong> is a large <em>macromolecule</em> that can perform many different functions within living organisms: from digestion to communicating between cells or replicating DNA. Proteins consist of one or more chains of <em>amino acid residues</em>.</p>"}}