{"newton":{"name":"Newton","born":1642,"died":1726,"bio":"<p><strong>Sir Isaac Newton</strong> (1642. - 1726.) bio je engleski fizičar, matematičar i astronom i jedan od najutjecajnijih znanstvenika svih vremena. Bio je profesor na Sveučilištu Cambridge i predsjednik Kraljevskog društva u Londonu.</p><p>U svojoj knjizi <em>Principia Mathematica</em>, Newton je formulirao zakone kretanja i gravitacije, koji su postavili temelje klasičnoj fizici i dominirali u našem pogledu na svemir u naredna tri stoljeća.</p><p>Između ostalog, Newton je bio jedan od izumitelja proračuna, izgradio je prvi reflektirajući teleskop, izračunao brzinu zvuka, proučavao gibanje fluida i razvio teoriju boja na temelju toga kako se prizme dijele sunčevom svjetlošću u spektar boje duge. ,</p>","links":[{"title":"Gravity","url":"/course/circles/conic-sections#newton"},{"title":"Digits of Pi","url":"/course/circles/introduction#pi-record"}]},"leibniz":{"name":"Leibniz","born":1646,"died":1716,"bio":"<p><strong>Gottfried Wilhelm Leibniz</strong> (1646. - 1716.) bio je njemački matematičar i filozof. Među mnogim drugim dostignućima, bio je jedan od izumitelja proračuna, i stvorio je neke od prvih mehaničkih kalkulatora.</p><p>Leibniz je vjerovao da je naš svemir „najbolji mogući svemir“ koji je Bog mogao stvoriti, dopuštajući nam da imamo slobodnu volju. Bio je veliki zagovornik <em>racionalizma</em>, a također je dao doprinose za fiziku, medicinu, lingvistiku, pravo, povijest i mnoge druge predmete.</p>"},"eratosthenes":{"name":"Eratosthenes","born":-276,"died":-195,"bio":"<p><strong>Eratosten iz Cirene</strong> (oko 276. - 195. godine prije Krista) bio je grčki matematičar, geograf, astronom, povjesničar i pjesnik. Veliki dio života proveo je u Egiptu, kao voditelj Aleksandrijske knjižnice. Između mnogih drugih dostignuća, Eratosten je izračunao opseg Zemlje, izmjerio nagib Zemljine osi rotacije, procijenio udaljenost do sunca i stvorio neke od prvih karata svijeta. Izumio je i \"sito Eratostena\", učinkovit način izračunavanja <em>osnovnih brojeva</em>.</p>","links":[{"title":"Radius of the Earth","url":"/course/circles/tangets-chords-arcs#eratosthenes"},{"title":"Sieve of Eratosthenes","url":"/course/divisibility/primes#eratosthenes"}]},"cavalieri":{"name":"Cavalieri","born":1598,"died":1647,"bio":"<p><strong>Bonaventura Cavalieri</strong> (1598. - 1647.) bio je talijanski matematičar i redovnik. Razvio je prekursor za infinitezimalno računanje, a pamti ga i po Cavalierijevom principu da pronalazi volumen krutih čestica u geometriji.</p><p>Cavalieri je također radio u optici i mehanici, uveo logaritme u Italiju i razmijenio mnoga pisma s Galileom Galileijem.</p>","links":[{"title":"Cavalieri’s Principle","url":"/course/circles/spheres-cones-cylinders#cavalieri"}]},"hilbert":{"name":"Hilbert","born":1862,"died":1943,"bio":"<p><strong>David Hilbert</strong> (1862. - 1943.) bio je jedan od najutjecajnijih matematičara 20. stoljeća. Radio je na gotovo svim područjima matematike, a posebno ga je zanimalo stvaranje formalnog, logičnog temelja za matematiku.</p><p>Hilbert je radio u Göttingenu (Njemačka), gdje je učio brojne studente koji su kasnije postali poznati matematičari. Tijekom Međunarodnog kongresa matematičara 1900. predstavio je popis 23 neriješena problema. Oni su postavili smjer za buduća istraživanja - a četiri su i danas neriješena!</p>","links":[{"title":"Hilbert’s Hotel","url":"/world/Infinity"}]},"apollonius":{"name":"Apollonius","born":-262,"died":-190,"bio":"<p><strong>Apolonij iz Perge</strong> (oko 200. godine prije Krista) bio je grčki matematičar i astronom najpoznatiji po svom radu na četiri <em>konične sekcije</em>.</p>","links":[{"title":"Conic Sections","url":"/course/circles/conic-sections"}]},"kepler":{"name":"Kepler","born":1571,"died":1630,"bio":"<p><strong>Johannes Kepler</strong> (1571. - 1630.) bio je njemački astronom i matematičar. Bio je <em>carski matematičar</em> u Pragu, a najpoznatiji je po svoja tri <em>zakona kretanja planeta</em>. Kepler je također radio u optici, te je izumio poboljšani teleskop za svoja promatranja.</p>","links":[{"title":"Elliptical Orbits","url":"/course/circles/conic-sections#kepler"}]}}