{"newton":{"name":"Newton","born":1642,"died":1726,"bio":"<p><strong>Sir Isaac Newton</strong> (1642 – 1726) İngiliz bir fizikçi, matematikçi ve astronomdur. Bütün zamanların en etkin bilim insanlarındandır. Cambridge Üniversitesinde profesördü ve Londra Kraliyet Akademisi’nin başkanıydı.</p><p><em>Principia Mathematica</em> isimli kitabında hareket ve yer çekimi yasalarını tasvir etmiştir. Bu eser, klasik fiziğin temellerini oluşturup yazıldıktan sonraki üçyüzyıl boyunca evren hakkındaki görüşümüzü domine etmiştir.</p><p>Newton kalkülüsü icat etmek, ilk yansıtmalı teleskobu yapmak, sesin hızını hesaplamak, akışkanların hareketini incelemek ve prizmaların güneş ışığını gökkuşağı spektrumuna çevirmesinden tola çıkarak renklere dair teoriler geliştirmek gibi pek çok çalışma yapmıştır.</p>","links":[{"title":"Yerçekimi","url":"/course/circles/conic-sections#newton"},{"title":"Pi'nin basamakları","url":"/course/circles/introduction#pi-record"}]},"leibniz":{"name":"Leibniz","born":1646,"died":1716,"bio":"<p><strong>Gottfried Wilhelm Leibniz</strong> (1646 – 1716) Alman bir matematikçi ve filozoftu. Bir çok başarısının yanında, kalkülüsün kaşiflerindendir ve ilk mekanik hesap makinalarını icat etmiştir.</p><p>Leibniz yaşadığımız evrenin, özgür iradeye sahip olmamız koşuluyla, tanrının yaratabileceği “en iyi evren” olduğu inancındaydı. <em>Akılcılık</em> akımının büyük bir taraftarıydı. Fiziğe, tıbba, dilbilime, hukuka, tarihe ve pek çok alana katkıları olmuştur.</p>"},"eratosthenes":{"name":"Eratosthenes","born":-276,"died":-195,"bio":"<p><strong>Eratosthenes</strong> (M.Ö. 276 – 195 ) Cyrene’de doğmuş Yunan matematikçi, coğrafyacı, astronom, tarihçi ve şairdi. Yaşamının uzun bir süresinde Mısır’da bulunan İskenderiye kütüphanesinin yönetimi ile meşgul olmuştur.</p><p>Diğer birçok başarısının yanı sıra, Dünya’nın çevresini hesaplamış, eksen eğikliğini ölçmüş, dünya ile güneş arasındaki mesafeyi tahmin etmiş ve ilk dünya haritasını çizmiştir.</p><p>Ayrıca asal sayıları bulmak için “Eratosthenes Kalburu” isminde bir yöntem geliştirmiştir.</p>","links":[{"title":"Dünya’nın yarıçapı","url":"/course/circles/tangets-chords-arcs#eratosthenes"},{"title":"Eratosthenes Kalburu","url":"/course/divisibility/primes#eratosthenes"}]},"cavalieri":{"name":"Cavalieri","born":1598,"died":1647,"bio":"<p><strong>Bonaventura Cavalieri</strong> (1598 – 1647) İtalyan bir matematikçi ve rahipti. Sonsuzlar hesabının öncüsü olan bir matematik geliştirmiştir ve geometride üç boyutlu şekillerin hacimlerini bulmaya yarayan Cavalieri ilkesi ile hatırlanır.</p><p>Cavalieri aynı zamanda optik ve hareket üzerine, logaritmanın İtalya’ya tanıtılmasına çalışmıştır. Galileo Galilei ile sık sık mektuplaşmışlardır.</p>","links":[{"title":"Cavalieri İlkesi","url":"/course/circles/spheres-cones-cylinders#cavalieri"}]},"hilbert":{"name":"Hilbert","born":1862,"died":1943,"bio":"<p><strong>David Hilbert</strong> (1862 – 1943) 20. yüzyılın en önemli matematikçilerindendi. Matematiğin neredeyse her alanında çalışmalar yapmıştır. Özellikle de matematiğe biçimsel, mantıksal bir temel bulmak ile ilgilenmiştir.</p><p>Hilbert Almanya’da Göttingen’de çalışmış, burada sonradan ünlü olacak pek çok matematikçi yetiştirmiştir. 1900 yılındaki Uluslararası Matematik Kongersi’nde henüz çözülmemiş 23 sorudan bahsetmiştir. Bu sorular, matematik araştırmalarının yönünü tayin etmiştir ve dört tanesi günümüzde hala çözülememiştir!</p>","links":[{"title":"Hilbert Oteli","url":"/world/Infinity"}]},"apollonius":{"name":"Apollonius","born":-262,"died":-190,"bio":"<p>__Perge’li Apollonius __ (M.Ö. 200 ) bir koninin düzlemle kesilmesiyle oluşan şekillerin _ “dört koni kesiti” _ analizi üzerine yaptığı çalışmalarıyla ünlü Yunan matematikçi ve astronomdur.</p>","links":[{"title":"Konik kesitler","url":"/course/circles/conic-sections"}]},"kepler":{"name":"Kepler","born":1571,"died":1630,"bio":"<p><strong>Johannes Kepler</strong> (1571 – 1630) Alman bir astronom ve matematikçiydi. Prag’daki <em>imparatorluk matematikçisi_ydi. _Gezegenlerin hareketleri yasaları</em> olarak bilinen üç yasası elde ettiği en önemli sonuçtur. Kepler aynı zamanda optik üzerine çalışmış ve gözlemleri için daha gelişmiş bir teleskop icat etmiştir.</p>","links":[{"title":"Eliptik Yörüngeler","url":"/course/circles/conic-sections#kepler"}]}}