{"newton":{"name":"Newton","born":1642,"died":1726,"bio":"<p><strong>Sir Isaac Newton</strong> (1642 - 1726) là nhà vật lý, nhà toán học và nhà thiên văn học người Anh, và là một trong những nhà khoa học có ảnh hưởng nhất mọi thời đại. Ông là giáo sư tại Đại học Cambridge và là chủ tịch của Hiệp hội Hoàng gia ở London.</p><p>Trong cuốn sách <em>Princia Mathematica</em>, Newton đã xây dựng các định luật về chuyển động và trọng lực, đặt nền móng cho vật lý cổ điển và chi phối quan điểm của chúng ta về vũ trụ trong ba thế kỷ tiếp theo.</p><p>Trong số nhiều thứ khác, Newton là một trong những người phát minh ra phép tính, chế tạo kính viễn vọng phản xạ đầu tiên, tính tốc độ âm thanh, nghiên cứu chuyển động của chất lỏng và phát triển một lý thuyết về màu sắc dựa trên cách lăng kính phân tách ánh sáng mặt trời thành quang phổ màu cầu vồng .</p>","links":[{"title":"Gravity","url":"/course/circles/conic-sections#newton"},{"title":"Digits of Pi","url":"/course/circles/introduction#pi-record"}]},"leibniz":{"name":"Leibniz","born":1646,"died":1716,"bio":"<p><strong>Gottfried Wilhelm Leibniz</strong> (1646 - 1716) là một nhà toán học và triết học người Đức. Trong số nhiều thành tựu khác, ông là một trong những người phát minh ra máy tính và tạo ra một số máy tính cơ học đầu tiên.</p><p>Leibniz tin rằng vũ trụ của chúng ta là vũ trụ tốt nhất có thể, mà Chúa có thể tạo ra, đồng thời cho phép chúng ta có một ý chí tự do. Ông là một người ủng hộ lớn cho <em>chủ nghĩa duy lý</em>, và cũng có những đóng góp cho vật lý, y học, ngôn ngữ học, luật, lịch sử và nhiều môn học khác.</p>"},"eratosthenes":{"name":"Eratosthenes","born":-276,"died":-195,"bio":"<p><strong>Eratosthenes của Cyrene</strong> (c. 276 - 195 BCE) là nhà toán học, nhà địa lý học, nhà thiên văn học, nhà sử học và nhà thơ người Hy Lạp. Ông dành phần lớn cuộc đời của mình ở Ai Cập, với tư cách là người đứng đầu thư viện Alexandria. Trong số nhiều thành tựu khác, Eratosthenes đã tính chu vi của Trái đất, đo độ nghiêng của trục quay Trái đất, ước tính khoảng cách với mặt trời và tạo ra một số bản đồ đầu tiên của thế giới. Ông cũng đã phát minh ra Sàng của Eratosthenes, một cách hiệu quả để tính <em>số nguyên tố</em>.</p>","links":[{"title":"Radius of the Earth","url":"/course/circles/tangets-chords-arcs#eratosthenes"},{"title":"Sieve of Eratosthenes","url":"/course/divisibility/primes#eratosthenes"}]},"cavalieri":{"name":"Cavalieri","born":1598,"died":1647,"bio":"<p><strong>Bonaventura Cavalieri</strong> (1598 - 1647) là một nhà toán học và nhà sư người Ý. Ông đã phát triển một tiền thân cho phép tính vô hạn, và được nhớ theo nguyên tắc Cavalieri Lượng để tìm khối lượng chất rắn trong hình học.</p><p>Cavalieri cũng làm việc trong ngành quang học và cơ học, giới thiệu logarit cho Ý và trao đổi nhiều thư với Galileo Galilei.</p>","links":[{"title":"Cavalieri’s Principle","url":"/course/circles/spheres-cones-cylinders#cavalieri"}]},"hilbert":{"name":"Hilbert","born":1862,"died":1943,"bio":"<p><strong>David Hilbert</strong> (1862 - 1943) là một trong những nhà toán học có ảnh hưởng nhất trong thế kỷ</p><ol start=\"20\"> <li>Ông đã làm việc trên hầu hết các lĩnh vực toán học, và đặc biệt quan tâm đến việc xây dựng một nền tảng logic, chính thức cho toán học.</li></ol> <p>Hilbert làm việc tại Göttingen (Đức), nơi ông dạy kèm cho nhiều sinh viên sau này trở thành nhà toán học nổi tiếng. Trong Đại hội các nhà toán học quốc tế năm 1900, ông đã trình bày một danh sách 23 vấn đề chưa được giải quyết. Những điều này đặt ra khóa học cho nghiên cứu trong tương lai - và bốn trong số chúng vẫn chưa được giải quyết cho đến ngày hôm nay!</p>","links":[{"title":"Hilbert’s Hotel","url":"/world/Infinity"}]},"apollonius":{"name":"Apollonius","born":-262,"died":-190,"bio":"<p><strong>Apollonius của Perga</strong> (khoảng 200 BCE) là một nhà toán học và nhà thiên văn học người Hy Lạp nổi tiếng với công trình nghiên cứu về bốn phần hình nón __.</p>","links":[{"title":"Conic Sections","url":"/course/circles/conic-sections"}]},"kepler":{"name":"Kepler","born":1571,"died":1630,"bio":"<p><strong>Johannes Kepler</strong> (1571 - 1630) là nhà thiên văn học và toán học người Đức. Ông là nhà toán học đế quốc <em>ở Prague và ông nổi tiếng với ba định luật về chuyển động hành tinh _</em>. Kepler cũng làm việc trong ngành quang học, và đã phát minh ra một kính thiên văn cải tiến để quan sát.</p>","links":[{"title":"Elliptical Orbits","url":"/course/circles/conic-sections#kepler"}]}}