{"newton":{"name":"Newton","born":1642,"died":1726,"bio":"<p>सर आइजैक न्यूटन (१६४२ - १ was२६) एक अंग्रेज भौतिकशास्त्री, गणितज्ञ और खगोलशास्त्री और सभी समय के सबसे प्रभावशाली वैज्ञानिकों में से एक थे। वह कैम्ब्रिज विश्वविद्यालय में प्रोफेसर थे, और लंदन में रॉयल सोसाइटी के अध्यक्ष थे।</p><p>अपनी पुस्तक <em>प्रिंसिपिया मैथेमेटिका</em> में, न्यूटन ने गति और गुरुत्वाकर्षण के नियमों को तैयार किया, जिसने शास्त्रीय भौतिकी के लिए नींव रखी और अगले तीन शताब्दियों के लिए ब्रह्मांड के हमारे दृष्टिकोण पर हावी रहा।</p><p>कई अन्य चीजों के बीच, न्यूटन पथरी के आविष्कारकों में से एक थे, पहली परावर्तक दूरबीन का निर्माण किया, ध्वनि की गति की गणना की, तरल पदार्थों की गति का अध्ययन किया, और रंगों के एक सिद्धांत को विकसित किया कि कैसे प्रिज्म एक इंद्रधनुषी रंग के स्पेक्ट्रम में सूरज की रोशनी को विभाजित करते हैं। ।</p>","links":[{"title":"Gravity","url":"/course/circles/conic-sections#newton"},{"title":"Digits of Pi","url":"/course/circles/introduction#pi-record"}]},"leibniz":{"name":"Leibniz","born":1646,"died":1716,"bio":"<p><strong>गॉटफ्रेड विल्हेम लीबनिज</strong> (1646 - 1716) एक जर्मन गणितज्ञ और दार्शनिक थे। कई अन्य उपलब्धियों के बीच, वह कैलकुलस के अन्वेषकों में से एक थे, और पहले मैकेनिकल कैलकुलेटरों में से कुछ बनाए।</p><p>लीबनिज का मानना था कि हमारा ब्रह्मांड \"सबसे अच्छा संभव ब्रह्मांड\" है जिसे भगवान ने बनाया है, जबकि हमें एक स्वतंत्र इच्छा रखने की अनुमति देता है। वे <em>तर्कवाद</em> के एक महान वकील थे, और उन्होंने भौतिकी, चिकित्सा, भाषा विज्ञान, कानून, इतिहास और कई अन्य विषयों में भी योगदान दिया।</p>"},"eratosthenes":{"name":"Eratosthenes","born":-276,"died":-195,"bio":"<p>साइरिन की एराटोस्थेनस (सी। २ B६ - १ ९ ५ ई.पू.) एक ग्रीक गणितज्ञ, भूगोलवेत्ता, खगोलशास्त्री, इतिहासकार और कवि थे। उन्होंने अपना अधिकांश जीवन मिस्र में, अलेक्जेंड्रिया के पुस्तकालय के प्रमुख के रूप में बिताया। कई अन्य उपलब्धियों के बीच, एराटोस्थनीज ने पृथ्वी की परिधि की गणना की, पृथ्वी के घूर्णन के अक्ष के झुकाव को मापा, सूर्य की दूरी का अनुमान लगाया और दुनिया के पहले मानचित्रों में से कुछ का निर्माण किया। उन्होंने <em>प्राइम नंबरों</em> की गणना करने के लिए एक कुशल तरीका “एसाव ऑफ इरैटोस्थनीज” का आविष्कार किया।</p>","links":[{"title":"Radius of the Earth","url":"/course/circles/tangets-chords-arcs#eratosthenes"},{"title":"Sieve of Eratosthenes","url":"/course/divisibility/primes#eratosthenes"}]},"cavalieri":{"name":"Cavalieri","born":1598,"died":1647,"bio":"<p><strong>बोनावेंटुरा कैवलियरी</strong> (1598 - 1647) एक इतालवी गणितज्ञ और भिक्षु थे। उन्होंने अनंत पथरी के लिए एक अग्रदूत विकसित किया, और उन्हें ज्यामिति में ठोस पदार्थों की मात्रा का पता लगाने के लिए कैवलियरी के सिद्धांत के लिए याद किया जाता है।</p><p>कैवलियरी ने प्रकाशिकी और यांत्रिकी में भी काम किया, इटली में लघुगणक की शुरुआत की, और गैलीलियो गैली के साथ कई पत्रों का आदान-प्रदान किया।</p>","links":[{"title":"Cavalieri’s Principle","url":"/course/circles/spheres-cones-cylinders#cavalieri"}]},"hilbert":{"name":"Hilbert","born":1862,"died":1943,"bio":"<p><strong>डेविड हिल्बर्ट</strong> (१ }६२ - १ ९ ४३) २० वीं सदी के सबसे प्रभावशाली गणितज्ञों में से एक थे। उन्होंने गणित के लगभग हर क्षेत्र पर काम किया, और विशेष रूप से गणित के लिए एक औपचारिक, तार्किक नींव बनाने में रुचि रखते थे।</p><p>हिल्बर्ट ने गौटिंगेन (जर्मनी) में काम किया, जहां उन्होंने कई छात्रों को पढ़ाया जो बाद में प्रसिद्ध गणितज्ञ बन गए। 1900 में अंतर्राष्ट्रीय कांग्रेस के गणितज्ञों के दौरान, उन्होंने 23 अनसुलझी समस्याओं की एक सूची प्रस्तुत की। ये भविष्य के अनुसंधान के लिए पाठ्यक्रम निर्धारित करते हैं - और उनमें से चार आज भी अनसुलझी हैं!</p>","links":[{"title":"Hilbert’s Hotel","url":"/world/Infinity"}]},"apollonius":{"name":"Apollonius","born":-262,"died":-190,"bio":"<p><strong>पेरगा का अपोलोनियस</strong> (सी। 200 बीसीई) एक ग्रीक गणितज्ञ और खगोलशास्त्री थे, जिन्हें चार <em>शंकुधारी खंड</em> पर उनके काम के लिए जाना जाता था।</p>","links":[{"title":"Conic Sections","url":"/course/circles/conic-sections"}]},"kepler":{"name":"Kepler","born":1571,"died":1630,"bio":"<p><strong>जोहान्स केप्लर</strong> (1571 - 1630) एक जर्मन खगोलशास्त्री और गणितज्ञ थे। वह प्राग में <em>शाही गणितज्ञ</em> था, और वह अपने तीन <em>ग्रहों की गति</em> के कानूनों के लिए जाना जाता है। केपलर ने प्रकाशिकी में भी काम किया, और अपनी टिप्पणियों के लिए एक बेहतर टेलीस्कोप का आविष्कार किया।</p>","links":[{"title":"Elliptical Orbits","url":"/course/circles/conic-sections#kepler"}]}}