{"newton":{"name":"Newton","born":1642,"died":1726,"bio":"<p><strong>Sir Isaac Newton</strong> (1642 - 1726) var en engelsk fysiker, matematiker och astronom och en av de mest inflytelserika forskarna genom tiderna. Han var professor vid Cambridge University och ordförande för Royal Society i London.</p><p>I sin bok <em>Principia Mathematica</em> formulerade Newton lagarna om rörelse och tyngdkraft, som låg till grund för klassisk fysik och dominerade vår syn på universumet under de kommande tre århundradena.</p><p>Bland många andra saker var Newton en av uppfinnarna av kalkylen, byggde det första reflekterande teleskopet, beräknade ljudets hastighet, studerade rörelserna hos vätskor och utvecklade en teori om färg baserad på hur prismor delade solljus i ett regnbågefärgat spektrum .</p>","links":[{"title":"Gravity","url":"/course/circles/conic-sections#newton"},{"title":"Digits of Pi","url":"/course/circles/introduction#pi-record"}]},"leibniz":{"name":"Leibniz","born":1646,"died":1716,"bio":"<p><strong>Gottfried Wilhelm Leibniz</strong> (1646 - 1716) var en tysk matematiker och filosof. Bland många andra framsteg var han en av uppfinnarna av kalkylen och skapade några av de första mekaniska kalkylatorerna.</p><p>Leibniz trodde att vårt universum är det \"bästa möjliga universum\" som Gud kunde ha skapat, samtidigt som vi tillät oss att ha en fri vilja. Han var en stor förespråkare för <em>rationalism</em> och gav också bidrag till fysik, medicin, lingvistik, lag, historia och många andra ämnen.</p>"},"eratosthenes":{"name":"Eratosthenes","born":-276,"died":-195,"bio":"<p><strong>Eratosthenes of Cyrene</strong> (c. 276 - 195 f.Kr.) var en grekisk matematiker, geograf, astronom, historiker och poet. Han tillbringade mycket av sitt liv i Egypten som chef för Alexandrias bibliotek. Bland många andra framsteg beräknade Eratosthenes jordens omkrets, mätt lutningen av jordens rotationsaxel, uppskattade avståndet till solen och skapade några av de första kartorna över världen. Han uppfann också ”Sieve of Eratosthenes”, ett effektivt sätt att beräkna <em>primtal</em>.</p>","links":[{"title":"Radius of the Earth","url":"/course/circles/tangets-chords-arcs#eratosthenes"},{"title":"Sieve of Eratosthenes","url":"/course/divisibility/primes#eratosthenes"}]},"cavalieri":{"name":"Cavalieri","born":1598,"died":1647,"bio":"<p><strong>Bonaventura Cavalieri</strong> (1598 - 1647) var en italiensk matematiker och munk. Han utvecklade en föregångare till den infinitesimala beräkningen och kommer ihåg för Cavalieris princip att hitta volymen av fasta ämnen i geometri.</p><p>Cavalieri arbetade också inom optik och mekanik, introducerade logaritmer till Italien och utbytte många brev med Galileo Galilei.</p>","links":[{"title":"Cavalieri’s Principle","url":"/course/circles/spheres-cones-cylinders#cavalieri"}]},"hilbert":{"name":"Hilbert","born":1862,"died":1943,"bio":"<p><strong>David Hilbert</strong> (1862 - 1943) var en av de mest inflytelserika matematikerna under 1900-talet. Han arbetade på nästan alla områden inom matematik och var särskilt intresserad av att bygga en formell, logisk grund för matematik.</p><p>Hilbert arbetade i Göttingen (Tyskland), där han handledde flera studenter som senare blev berömda matematiker. Under den internationella matematikarkongressen 1900 presenterade han en lista med 23 olösta problem. Dessa satte kursen för framtida forskning - och fyra av dem är fortfarande olösta i dag!</p>","links":[{"title":"Hilbert’s Hotel","url":"/world/Infinity"}]},"apollonius":{"name":"Apollonius","born":-262,"died":-190,"bio":"<p><strong>Apollonius av Perga</strong> (ca 200 fvt) var en grekisk matematiker och astronom som mest känd för sitt arbete på de fyra <em>koniska avsnitten</em>.</p>","links":[{"title":"Conic Sections","url":"/course/circles/conic-sections"}]},"kepler":{"name":"Kepler","born":1571,"died":1630,"bio":"<p><strong>Johannes Kepler</strong> (1571 - 1630) var en tysk astronom och matematiker. Han var den <em>imperialistiska matematikern</em> i Prag, och han är bäst känd för sina tre <em>lagar om planetrörelse</em>. Kepler arbetade också inom optik och uppfann ett förbättrat teleskop för sina observationer.</p>","links":[{"title":"Elliptical Orbits","url":"/course/circles/conic-sections#kepler"}]}}