{"newton":{"name":"Newton","born":1642,"died":1726,"bio":"<p><strong>Sir Isaac Newton</strong> (1642-1726) fue un físico, matemático y astrónomo inglés, y uno de los científicos más influyentes de todos los tiempos. Fue profesor en la Universidad de Cambridge y presidente de la Royal Society en Londres.</p><p>En su libro <em>Principia Mathematica</em>, Newton formuló las leyes del movimiento y la gravedad, que sentaron las bases de la física clásica y dominaron nuestra visión del universo durante los próximos tres siglos.</p><p>Entre muchas otras cosas, Newton fue uno de los inventores del cálculo, construyó el primer telescopio reflector, calculó la velocidad del sonido, estudió el movimiento de los fluidos y desarrolló una teoría del color basada en cómo los prismas dividen la luz solar en un espectro de color arcoíris .</p>","links":[{"title":"Gravity","url":"/course/circles/conic-sections#newton"},{"title":"Digits of Pi","url":"/course/circles/introduction#pi-record"}]},"leibniz":{"name":"Leibniz","born":1646,"died":1716,"bio":"<p><strong>Gottfried Wilhelm Leibniz</strong> (1646-1716) fue un matemático y filósofo alemán. Entre muchos otros logros, fue uno de los inventores del cálculo y creó algunas de las primeras calculadoras mecánicas.</p><p>Leibniz creía que nuestro universo es el \"mejor universo posible\" que Dios podría haber creado, al tiempo que nos permite tener libre albedrío. Fue un gran defensor del <em>racionalismo</em>, y también hizo contribuciones a la física, la medicina, la lingüística, el derecho, la historia y muchas otras materias.</p>"},"eratosthenes":{"name":"Eratosthenes","born":-276,"died":-195,"bio":"<p><strong>Eratóstenes de Cirene</strong> (c. 276 - 195 a. C.) fue un matemático, geógrafo, astrónomo, historiador y poeta griego. Pasó gran parte de su vida en Egipto, como jefe de la biblioteca de Alejandría. Entre muchos otros logros, Eratóstenes calculó la circunferencia de la Tierra, midió la inclinación del eje de rotación de la Tierra, estimó la distancia al sol y creó algunos de los primeros mapas del mundo. También inventó el \"Tamiz de Eratóstenes\", una forma eficiente de calcular <em>números primos</em>.</p>","links":[{"title":"Radius of the Earth","url":"/course/circles/tangets-chords-arcs#eratosthenes"},{"title":"Sieve of Eratosthenes","url":"/course/divisibility/primes#eratosthenes"}]},"cavalieri":{"name":"Cavalieri","born":1598,"died":1647,"bio":"<p><strong>Bonaventura Cavalieri</strong> (1598-1647) fue un matemático y monje italiano. Desarrolló un precursor del cálculo infinitesimal, y es recordado por el principio de Cavalieri de encontrar el volumen de sólidos en la geometría.</p><p>Cavalieri también trabajó en óptica y mecánica, introdujo logaritmos en Italia e intercambió muchas cartas con Galileo Galilei.</p>","links":[{"title":"Cavalieri’s Principle","url":"/course/circles/spheres-cones-cylinders#cavalieri"}]},"hilbert":{"name":"Hilbert","born":1862,"died":1943,"bio":"<p><strong>David Hilbert</strong> (1862 - 1943) fue uno de los matemáticos más influyentes del siglo XX. Trabajó en casi todas las áreas de las matemáticas y estaba particularmente interesado en construir una base formal y lógica para las matemáticas.</p><p>Hilbert trabajó en Gotinga (Alemania), donde enseñó a numerosos estudiantes que luego se convirtieron en matemáticos famosos. Durante el Congreso Internacional de Matemáticos en 1900, presentó una lista de 23 problemas sin resolver. Estos marcan el rumbo para futuras investigaciones, ¡y cuatro de ellos aún no se han resuelto hoy!</p>","links":[{"title":"Hilbert’s Hotel","url":"/world/Infinity"}]},"apollonius":{"name":"Apollonius","born":-262,"died":-190,"bio":"<p><strong>Apolonio de Perga</strong> (c. 200 a. C.) fue un matemático y astrónomo griego mejor conocido por su trabajo en las cuatro <em>secciones cónicas</em>.</p>","links":[{"title":"Conic Sections","url":"/course/circles/conic-sections"}]},"kepler":{"name":"Kepler","born":1571,"died":1630,"bio":"<p><strong>Johannes Kepler</strong> (1571-1630) fue un astrónomo y matemático alemán. Fue el <em>matemático imperial</em> en Praga, y es mejor conocido por sus tres <em>leyes de movimiento planetario</em>. Kepler también trabajó en óptica e inventó un telescopio mejorado para sus observaciones.</p>","links":[{"title":"Elliptical Orbits","url":"/course/circles/conic-sections#kepler"}]}}