{"newton":{"name":"Newton","born":1642,"died":1726,"bio":"<p><strong>Sir Isaac Newton</strong> (1642 - 1726) était un physicien, mathématicien et astronome anglais, et l'un des scientifiques les plus influents de tous les temps. Il était professeur à l'Université de Cambridge et président de la Royal Society de Londres.</p><p>Dans son livre <em>Principia Mathematica</em>, Newton a formulé les lois du mouvement et de la gravité, qui ont jeté les bases de la physique classique et dominé notre vision de l'univers pendant les trois siècles suivants.</p><p>Entre autres choses, Newton a été l'un des inventeurs du calcul, a construit le premier télescope réfléchissant, calculé la vitesse du son, étudié le mouvement des fluides et développé une théorie de la couleur basée sur la façon dont les prismes divisent la lumière du soleil en un spectre de couleur arc-en-ciel .</p>","links":[{"title":"Gravity","url":"/course/circles/conic-sections#newton"},{"title":"Digits of Pi","url":"/course/circles/introduction#pi-record"}]},"leibniz":{"name":"Leibniz","born":1646,"died":1716,"bio":"<p><strong>Gottfried Wilhelm Leibniz</strong> (1646 - 1716) était un mathématicien et philosophe allemand. Parmi de nombreuses autres réalisations, il a été l'un des inventeurs du calcul et a créé certaines des premières calculatrices mécaniques.</p><p>Leibniz croyait que notre univers est le «meilleur univers possible» que Dieu aurait pu créer, tout en nous permettant d'avoir un libre arbitre. Il était un grand défenseur du <em>rationalisme</em>, et a également apporté des contributions à la physique, la médecine, la linguistique, le droit, l'histoire et bien d'autres sujets.</p>"},"eratosthenes":{"name":"Eratosthenes","born":-276,"died":-195,"bio":"<p><strong>Ératosthène de Cyrène</strong> (v. 276 - 195 avant notre ère) était un mathématicien, géographe, astronome, historien et poète grec. Il a passé une grande partie de sa vie en Égypte, à la tête de la bibliothèque d'Alexandrie. Parmi de nombreuses autres réalisations, Ératosthène a calculé la circonférence de la Terre, mesuré l'inclinaison de l'axe de rotation de la Terre, estimé la distance au soleil et créé certaines des premières cartes du monde. Il a également inventé le \"Tamis d'Ératosthène\", un moyen efficace de calculer <em>nombres premiers</em>.</p>","links":[{"title":"Radius of the Earth","url":"/course/circles/tangets-chords-arcs#eratosthenes"},{"title":"Sieve of Eratosthenes","url":"/course/divisibility/primes#eratosthenes"}]},"cavalieri":{"name":"Cavalieri","born":1598,"died":1647,"bio":"<p><strong>Bonaventura Cavalieri</strong> (1598 - 1647) était un mathématicien et moine italien. Il a développé un précurseur du calcul infinitésimal, et on se souvient du principe de Cavalieri pour trouver le volume de solides dans la géométrie.</p><p>Cavalieri a également travaillé dans l'optique et la mécanique, introduit des logarithmes en Italie et échangé de nombreuses lettres avec Galileo Galilei.</p>","links":[{"title":"Cavalieri’s Principle","url":"/course/circles/spheres-cones-cylinders#cavalieri"}]},"hilbert":{"name":"Hilbert","born":1862,"died":1943,"bio":"<p><strong>David Hilbert</strong> (1862 - 1943) était l'un des mathématiciens les plus influents du 20e siècle. Il a travaillé dans presque tous les domaines des mathématiques et était particulièrement intéressé à construire une base formelle et logique pour les mathématiques.</p><p>Hilbert a travaillé à Göttingen (Allemagne), où il a enseigné à de nombreux étudiants qui sont devenus plus tard des mathématiciens célèbres. Lors du Congrès international des mathématiciens en 1900, il a présenté une liste de 23 problèmes non résolus. Celles-ci ouvrent la voie à de futures recherches - et quatre d'entre elles ne sont toujours pas résolues aujourd'hui!</p>","links":[{"title":"Hilbert’s Hotel","url":"/world/Infinity"}]},"apollonius":{"name":"Apollonius","born":-262,"died":-190,"bio":"<p><strong>Apollonius de Perga</strong> (vers 200 avant notre ère) était un mathématicien et astronome grec connu pour ses travaux sur les quatre <em>sections coniques</em>.</p>","links":[{"title":"Conic Sections","url":"/course/circles/conic-sections"}]},"kepler":{"name":"Kepler","born":1571,"died":1630,"bio":"<p><strong>Johannes Kepler</strong> (1571 - 1630) était un astronome et mathématicien allemand. Il était le <em>mathématicien impérial</em> à Prague, et il est surtout connu pour ses trois <em>lois du mouvement planétaire</em>. Kepler a également travaillé dans l'optique et a inventé un télescope amélioré pour ses observations.</p>","links":[{"title":"Elliptical Orbits","url":"/course/circles/conic-sections#kepler"}]}}