{"newton":{"name":"Newton","born":1642,"died":1726,"bio":"<p><strong>Sir Isaac Newton</strong> (1642 - 1726) foi um físico, matemático e astrônomo inglês, e um dos cientistas mais influentes de todos os tempos. Ele foi professor na Universidade de Cambridge e presidente da Royal Society em Londres.</p><p>Em seu livro <em>Principia Mathematica</em>, Newton formulou as leis do movimento e da gravidade, que lançaram as bases da física clássica e dominaram nossa visão do universo pelos próximos três séculos.</p><p>Entre muitas outras coisas, Newton foi um dos inventores do cálculo, construiu o primeiro telescópio refletor, calculou a velocidade do som, estudou o movimento dos fluidos e desenvolveu uma teoria da cor baseada em como os prismas dividem a luz solar em um espectro colorido do arco-íris .</p>","links":[{"title":"Gravity","url":"/course/circles/conic-sections#newton"},{"title":"Digits of Pi","url":"/course/circles/introduction#pi-record"}]},"leibniz":{"name":"Leibniz","born":1646,"died":1716,"bio":"<p>Gottfried Wilhelm Leibniz (1646 - 1716) foi um matemático e filósofo alemão. Entre muitas outras realizações, ele foi um dos inventores do cálculo e criou algumas das primeiras calculadoras mecânicas.</p><p>Leibniz acreditava que nosso universo é o \"melhor universo possível\" que Deus poderia ter criado, enquanto nos permitia ter um livre arbítrio. Ele foi um grande defensor do racionalismo e também fez contribuições à física, medicina, linguística, direito, história e muitos outros assuntos.</p>"},"eratosthenes":{"name":"Eratosthenes","born":-276,"died":-195,"bio":"<p>Eratóstenes de Cirene__ (c. 276 - 195 aC) era um matemático, geógrafo, astrógrafo, historiador e poeta grego. Ele passou grande parte de sua vida no Egito, como chefe da biblioteca de Alexandria. Entre muitas outras conquistas, Eratóstenes calculou a circunferência da Terra, mediu a inclinação do eixo de rotação da Terra, estimou a distância ao sol e criou alguns dos primeiros mapas do mundo. Ele também inventou a \"Peneira de Eratóstenes\", uma maneira eficiente de calcular <em>números primos</em>.</p>","links":[{"title":"Radius of the Earth","url":"/course/circles/tangets-chords-arcs#eratosthenes"},{"title":"Sieve of Eratosthenes","url":"/course/divisibility/primes#eratosthenes"}]},"cavalieri":{"name":"Cavalieri","born":1598,"died":1647,"bio":"<p><strong>Bonaventura Cavalieri</strong> (1598 - 1647) foi um matemático e monge italiano. Ele desenvolveu um precursor do cálculo infinitesimal e é lembrado pelo princípio de Cavalieri para encontrar o volume de sólidos na geometria.</p><p>Cavalieri também trabalhou em óptica e mecânica, introduziu logaritmos na Itália e trocou muitas cartas com Galileu Galilei.</p>","links":[{"title":"Cavalieri’s Principle","url":"/course/circles/spheres-cones-cylinders#cavalieri"}]}}