{"newton":{"name":"Newton","full":"Isaac Newton","born":1642,"died":1726,"bio":"<p><strong>Sir Isaac Newton</strong> (1642 – 1726) was an English physicist, mathematician, and astronomer, and one of the most influential scientists of all time. He was a professor at Cambridge University, and president of the Royal Society in London.</p><p>In his book <em>Principia Mathematica</em>, Newton formulated the laws of motion and gravity, which laid the foundations for classical physics and dominated our view of the universe for the next three centuries.</p><p>Among many other things, Newton was one of the inventors of calculus, built the first reflecting telescope, calculated the speed of sound, studied the motion of fluids, and developed a theory of colour based on how prisms split sunlight into a rainbow-coloured spectrum.</p>","links":[{"title":"Gravity","url":"/course/circles/conic-sections#newton"},{"title":"Digits of Pi","url":"/course/circles/introduction#pi-record"}]},"leibniz":{"name":"Leibniz","full":"Gottfried Wilhelm Leibniz","born":1646,"died":1716,"bio":"<p><strong>Gottfried Wilhelm Leibniz</strong> (1646 – 1716) was a German mathematician and philosopher. Among many other achievements, he was one of the inventors of calculus, and created some of the first mechanical calculators.</p><p>Leibniz believed that our universe is the “best possible universe” that God could have created, while allowing us to have a free will. He was a great advocate of <em>rationalism</em>, and also made contributions to physics, medicine, linguistics, law, history, and many other subjects.</p>"},"eratosthenes":{"name":"Eratosthenes","full":"Eratosthenes of Cyrene","born":-276,"died":-195,"location":"africa","bio":"<p><strong>Eratosthenes of Cyrene</strong> (c. 276 – 195 BCE) was a Greek mathematician, geographer, astronomer, historian, and poet. He spent much of his life in Egypt, as head of the library of Alexandria.</p><p>Among many other achievements, Eratosthenes calculated the circumference of the Earth, measured the tilt of the Earth’s axis of rotation, estimated the distance to the sun, and created some of the first maps of the world.</p><p>He also invented the “Sieve of Eratosthenes”, an efficient way to calculate <em>prime numbers</em>.</p>","links":[{"title":"Radius of the Earth","url":"/course/circles/tangets-chords-arcs#eratosthenes"},{"title":"Sieve of Eratosthenes","url":"/course/divisibility/primes#eratosthenes"}]},"cavalieri":{"name":"Cavalieri","full":"Bonaventura Cavalieri","born":1598,"died":1647,"bio":"<p><strong>Bonaventura Cavalieri</strong> (1598 – 1647) was an Italian mathematician and monk. He developed a precursor to infinitesimal calculus, and is remembered for Cavalieri’s principle to find the volume of solids in geometry.</p><p>Cavalieri also worked in optics and mechanics, introduced logarithms to Italy, and exchanged many letters with Galileo Galilei.</p>","links":[{"title":"Cavalieri’s Principle","url":"/course/circles/spheres-cones-cylinders#cavalieri"}]},"hilbert":{"name":"Hilbert","full":"David Hilbert","born":1862,"died":1943,"small":true,"bio":"<p><strong>David Hilbert</strong> (1862 – 1943) was one of the most influential mathematicians of the 20th century. He worked on almost every area of mathematics, and was particularly interested in building a formal, logical foundation for maths.</p><p>Hilbert worked in Göttingen (Germany), where he tutored numerous students who later became famous mathematicians. During the International Congress of Mathematicians in 1900, he presented a list of 23 unsolved problems. These set the course for future research – and four of them are still unsolved today!</p>","links":[{"title":"Hilbert’s Hotel","url":"/world/Infinity"}]},"apollonius":{"name":"Apollonius","full":"Apollonius of Perga","born":-262,"died":-190,"location":"middle-east","bio":"<p><strong>Apollonius of Perga</strong> (c. 200 BCE) was a Greek mathematician and astronomer best known for his work on the four <em>conic sections</em>.</p>","links":[{"title":"Conic Sections","url":"/course/circles/conic-sections"}]},"kepler":{"name":"Kepler","full":"Johannes Kepler","born":1571,"died":1630,"bio":"<p><strong>Johannes Kepler</strong> (1571 – 1630) was a German astronomer and mathematician. He was the <em>imperial mathematician</em> in Prague, and he is best known for his three <em>laws of planetary motion</em>. Kepler also worked in optics, and invented an improved telescope for his observations.</p>","links":[{"title":"Elliptical Orbits","url":"/course/circles/conic-sections#kepler"}]}}