{"newton":{"name":"Newton","born":1642,"died":1726,"bio":"<p><strong>Sir Isaac Newton</strong> (1642 – 1726) war ein englischer Physiker, Mathematiker und Astronom und einer der einflussreichsten Wissenschaftler aller Zeiten. Er war Professor an der Cambridge University und Präsident der Royal Society in London.</p><p>In seinem Buch <em>Principia Mathematica</em> formulierte Newton die Gesetze von Bewegung und Schwerkraft, die den Grundstein für die klassische Physik legten und unsere Sicht auf das Universum für die nächsten drei Jahrhunderte dominierten.</p><p>Newton war unter anderem einer der Erfinder der Infinitesimalrechnung, baute das erste Spiegelteleskop, berechnete die Schallgeschwindigkeit, studierte die Bewegung von Flüssigkeiten und entwickelte eine Farbtheorie, die darauf basiert, wie Prismen das Sonnenlicht in ein regenbogenfarbenes Spektrum aufteilen.</p>","links":[{"title":"Schwerkraft","url":"/course/circles/conic-sections#newton"},{"title":"Ziffern von Pi","url":"/course/circles/introduction#pi-record"}]},"leibniz":{"name":"Leibniz","born":1646,"died":1716,"bio":"<p><strong>Gottfried Wilhelm Leibniz</strong> (1646 – 1716) war ein deutscher Mathematiker und Philosoph. Neben vielen anderen Errungenschaften war er einer der Erfinder der Infinitesimalrechnung und schuf einige der ersten mechanischen Rechenmaschinen.</p><p>Leibniz glaubte, dass unser Universum das \"bestmögliche Universum\" ist, das Gott hätte erschaffen können, indem er uns gleichzeitig erlaubte, einen freien Willen zu haben. Er war ein großer Verfechter des <em>Rationalismus</em> und leistete auch Beiträge zu Physik, Medizin, Sprachwissenschaft, Recht, Geschichte und vielen anderen Fächern.</p>"},"eratosthenes":{"name":"Eratosthenes","born":-276,"died":-195,"bio":"<p><strong>Eratosthene von Kyrene</strong> (ca. 276 v. Chr. – 195 v. Chr.) war ein griechischer Mathematiker, Geograph, Astronom, Historiker und Dichter. Er verbrachte einen Großteil seines Lebens in Ägypten, als Leiter der Bibliothek von Alexandria.</p><p>Neben vielen anderen Errungenschaften berechnete Eratosthenes den Umfang der Erde, maß die Neigung der Drehachse der Erde, schätzte den Abstand zur Sonne und schuf einige der ersten Weltkarten.</p><p>Er erfand auch das “Sieb des Eratosthenes”, eine effiziente Methode zur Berechnung <em>von Primzahlen</em>.</p>","links":[{"title":"Radius der Erde","url":"/course/circles/tangets-chords-arcs#eratosthenes"},{"title":"Sieb des Eratosthenes","url":"/course/divisibility/primes#eratosthenes"}]},"cavalieri":{"name":"Cavalieri","born":1598,"died":1647,"bio":"<p><strong>Bonaventura Cavalieri</strong> (1598 – 1647) war ein italienischer Mathematiker und Mönch. Er entwickelte einen Vorläufer der Infinitesimalrechnung und ist bekannt für das Prinzip von Cavalieri, mit dem das Volumen von Körpern in der Geometrie bestimmt werden kann.</p><p>Cavalieri arbeitete auch auf den Gebieten der Optik und Bewegung, führte Logarithmen in Italien ein und tauschte viele Briefe mit Galileo Galilei aus.</p>","links":[{"title":"Das Prinzip von Cavalieri","url":"/course/circles/spheres-cones-cylinders#cavalieri"}]},"hilbert":{"name":"Hilbert","born":1862,"died":1943,"bio":"<p><strong>David Hilbert</strong> (1862 - 1943) war einer der einflussreichsten Mathematiker des 20. Jahrhunderts. Er arbeitete in fast allen Bereichen der Mathematik und war besonders daran interessiert, eine formale, logische Grundlage für Mathematik zu schaffen.</p><p>Hilbert arbeitete in Göttingen (Deutschland), wo er zahlreiche Studenten unterrichtete, die später berühmte Mathematiker wurden. Während des Internationalen Mathematikerkongresses im Jahr 1900 präsentierte er eine Liste von 23 ungelösten Problemen. Diese setzen die Weichen für die zukünftige Forschung - und vier davon sind bis heute ungelöst!</p>","links":[{"title":"Hilbert’s Hotel","url":"/world/Infinity"}]},"apollonius":{"name":"Apollonius","born":-262,"died":-190,"bio":"<p><strong>Apollonius von Perge</strong> (ca. 200 v. Chr.) war ein griechischer Mathematiker und Astronom, der vor allem für seine Arbeit über die vier <em>Kegelschnitte</em> bekannt ist.</p>","links":[{"title":"Kegelschnitte","url":"/course/circles/conic-sections"}]},"kepler":{"name":"Kepler","born":1571,"died":1630,"bio":"<p><strong>Johannes Kepler</strong> (1571 – 1630) war ein deutscher Astronom und Mathematiker. Er war der <em>kaiserliche Mathematiker</em> in Prag, und er ist am bekanntesten für seine drei <em>Gesetze der Planetenbewegung</em>. Kepler arbeitete auch in der Optik und erfand ein verbessertes Teleskop für seine Beobachtungen.</p>","links":[{"title":"Elliptische Umlaufbahnen","url":"/course/circles/conic-sections#kepler"}]}}