{"newton":{"name":"Newton","born":1642,"died":1726,"bio":"<p><strong>Sir Isaac Newton</strong> (1642 – 1726) a fost un fizician, matematician și astronom englez. El a fost unul dintre cei mai influenți oameni de știință din toate timpurile. A fost profesor la Universitatea Cambridge și președinte al Societații Regale din Londra.</p><p>Newton a formulat în cartea sa <em>Principia Mathematica</em> legile mișcării și gravitației, legi care au pus bazele fizicii clasice și au dominat viziunea noastra asupra universului timp de trei secole.</p><p>Printre multe altele, Newton a fost unul din inventatorii analizei matematice, a construit primul telescop reflector, a calculat viteza sunetului, a studiat mișcarea fluidelor și a dezvoltat o teorie a culorilor pe baza modului în care o prismă descompune lumina solară în spectrul ei, conținând culorile curcubeului.</p>","links":[{"title":"Gravity","url":"/course/circles/conic-sections#newton"},{"title":"Digits of Pi","url":"/course/circles/introduction#pi-record"}]},"leibniz":{"name":"Leibniz","born":1646,"died":1716,"bio":"<p><strong>Gottfried Wilhelm Leibniz</strong> (1646 – 1716) a fost un matematician și filosof german. Printre multele sale reușite, el a fost unul din inventatorii analizei matematice și a creat unele din primele calculatoare mecanice.</p><p>Leibniz credea că universul nostru este “cel mai bun univers posibil” pe care Dumnezeu ar fi putut să-l creeze și în care să ne permită sa avem liberul arbitru. El a fost un adept important al <em>raționalismului</em>, și a adus contribuții în fizică, medicină, lingvistică, drept, istorie și multe alte domenii.</p>"},"eratosthenes":{"name":"Eratostene","born":-276,"died":-195,"bio":"<p><strong>Eratostene din Cyrene</strong> (c. 276 î.Hr. – 195 î.Hr.) a fost un matematician, geograf, astronom, istoric și poet grec. El și-a petrecut o mare parte din viața sa în Egipt ca șef al bibliotecii din Alexandria.</p><p>Printre multele sale realizări, Eratostene a calculat circumferința Pământului, a măsurat înclinarea axei de rotație a Pământului, a estimat distanța până la Soare și a creat primele hărți ale lumii.</p><p>De asemenea, el a inventat “Ciurul lui Eratostene”, o metodă eficientă de calculare a <em>numerelor prime</em>.</p>","links":[{"title":"Radius of the Earth","url":"/course/circles/tangets-chords-arcs#eratosthenes"},{"title":"Sieve of Eratosthenes","url":"/course/divisibility/primes#eratosthenes"}]},"cavalieri":{"name":"Cavalieri","born":1598,"died":1647,"bio":"<p><strong>Bonaventura Cavalieri</strong> (1598 – 1647) a fost un matematician și călugăr italian. El a dezvoltat precursorul calculului infinitezimal și a rămas cunoscut pentru principiul lui Cavalieri cu ajutorul căruia se calculează volumul corpurilor geometrice.</p><p>Cavalieri a lucrat și în optică și mecanică, a introdus logaritmii în Italia și a corespondat în scris cu Galileo Galilei.</p>","links":[{"title":"Principiul lui Cavalieri","url":"/course/circles/spheres-cones-cylinders#cavalieri"}]},"hilbert":{"name":"Hilbert","born":1862,"died":1943,"bio":"<p><strong>David Hilbert</strong> (1862 – 1943) a fost unul dintre cei mai influenți matematicieni ai secolului</p><ol start=\"20\"> <li>El a lucrat în aproape fiecre arie a matematicii fiind interesat, în mod special, de construirea unei fundații formale și logice pentru matematică.</li></ol> <p>Hilbert a profesat in Göttingen (Germany), unde a îndrumat numeroși studenți care mai târziu au devenit matematicieni faimoși. Pe parcurul Congresului Internațional de Matematică din 1900, el a prezenta o listă de 23 de probleme nerezolvate. Acestea au stabilit terenul pentru cercetarile viitoare - și patru dintre ele sunt și azi nerezolvate!</p>","links":[{"title":"Hilbert’s Hotel","url":"/world/Infinity"}]},"apollonius":{"name":"Apollonius","born":-262,"died":-190,"bio":"<p><strong>Apollonius din Perga</strong> (c. 200 î.Hr.) a fost un matematician și astronom grec cunoscut pentru lucrările sale asupra celor patru <em>secțiuni conice</em>.</p>","links":[{"title":"Conic Sections","url":"/course/circles/conic-sections"}]},"kepler":{"name":"Kepler","born":1571,"died":1630,"bio":"<p><strong>Johannes Kepler</strong> (1571 – 1630) a fost un astronom și matematician german. El a fost <em>matematicianul imperial</em> în Praga și este cel mai cunoscut pentru cele trei <em>legi ale mișcării planetelor</em>. Kepler a lucrat și în optică și a inventat un telescop îmbunătățit pentru observațiile sale.</p>","links":[{"title":"Elliptical Orbits","url":"/course/circles/conic-sections#kepler"}]}}