{"newton":{"name":"Newton","born":1642,"died":1726,"bio":"<p><strong>Sir Isaac Newton</strong> (1642 - 1726) İngilis fiziki, riyaziyyatçısı və astronomu və bütün dövrlərin ən nüfuzlu elm adamlarından biri idi. Kembric Universitetinin professoru və London Kral Cəmiyyətinin prezidenti idi.</p><p><em>Principia Mathematica</em> adlı kitabında Nyuton klassik fizikanın əsasını qoyan və sonrakı üç əsr ərzində kainata baxışımızda hakim olan hərəkət və cazibə qanunlarını ifadə etmişdir.</p><p>Digər bir çox şey arasında Newton, hesablama ixtiraçılarından biri idi, ilk əks etdirən teleskop qurdu, səs sürətini hesabladı, mayelərin hərəkətini öyrəndi və prizmaların günəş işığını göy qurşağı rəngli spektrə necə bölməsinə əsaslanaraq rəng nəzəriyyəsini inkişaf etdirdi. .</p>","links":[{"title":"Gravity","url":"/course/circles/conic-sections#newton"},{"title":"Digits of Pi","url":"/course/circles/introduction#pi-record"}]},"leibniz":{"name":"Leibniz","born":1646,"died":1716,"bio":"<p><strong>Gottfried Vilhelm Leibniz</strong> (1646 - 1716) Alman riyaziyyatçısı və filosofu idi. Bir çox digər nailiyyətlər arasında, o, hesablama ixtiraçılarından biri idi və ilk mexaniki kalkulyatorlardan birini yaratdı.</p><p>Leybniz, kainatımızın Allahın yaratdığı ən yaxşı kainat olduğuna inanaraq, bizə iradə azadlığına sahib olmasına inanırdı. O, <em>rasionalizmin</em> böyük təbliğçisi idi, eyni zamanda fizika, tibb, dilçilik, hüquq, tarix və bir çox digər sahələrə də töhfələr verdi.</p>"},"eratosthenes":{"name":"Eratosthenes","born":-276,"died":-195,"bio":"<p><strong>Kirenanın eratostenləri</strong> (e.ə. 276 - 1956) Yunan riyaziyyatçısı, coğrafiyaşünas, astronom, tarixçi və şair idi. Ömrünün çox hissəsini Misirdə, İsgəndəriyyə kitabxanasının müdiri kimi keçirdi. Bir çox digər nailiyyətlər arasında Eratosthenes, Yerin dairəsini hesablamış, Yerin fırlanma oxunun əyilməsini ölçmüş, Günəşə olan məsafəni təxmin etmiş və dünyanın ilk xəritələrini yaratmışdır. Ayrıca <em>baş sayları</em> hesablamağın səmərəli bir yolu olan \"Eratosthenlərin Ələkəsi\" ni də icad etdi.</p>","links":[{"title":"Radius of the Earth","url":"/course/circles/tangets-chords-arcs#eratosthenes"},{"title":"Sieve of Eratosthenes","url":"/course/divisibility/primes#eratosthenes"}]},"cavalieri":{"name":"Cavalieri","born":1598,"died":1647,"bio":"<p><strong>Bonaventura Cavalieri</strong> (1598 - 1647) italyan riyaziyyatçısı və rahibi idi. Sonsuz hesablamaların aparıcısını hazırladı və həndəsədə qatılıqların həcmini tapmaq Cavalieri prinsipi ilə yadda qaldı.</p><p>Cavalieri, eyni zamanda, optika və mexanika sahələrində çalışdı, İtaliyaya logarifmləri tanıtdı və Galileo Galilei ilə bir çox məktub mübadiləsi etdi.</p>","links":[{"title":"Cavalieri’s Principle","url":"/course/circles/spheres-cones-cylinders#cavalieri"}]},"hilbert":{"name":"Hilbert","born":1862,"died":1943,"bio":"<p><strong>David Hilbert</strong> (1862 - 1943) 20-ci əsrin ən nüfuzlu riyaziyyatçılarından biri idi. Riyaziyyatın demək olar ki, hər bir sahəsi üzərində işləyirdi və xüsusilə riyaziyyat üçün rəsmi, məntiqi bir təməl qurmaqda maraqlı idi.</p><p>Hilbert Göttingendə (Almaniya) çalışdı və burada məşhur riyaziyyatçı olmuş bir çox tələbəyə dərs verdi. 1900-cü ildə Beynəlxalq Riyaziyyatçılar Konqresi zamanı 23 həll olunmamış problemlərin siyahısını təqdim etdi. Bunlar gələcək tədqiqatların gedişatını təyin etdi və onlardan dördü bu gün də həll edilmir!</p>","links":[{"title":"Hilbert’s Hotel","url":"/world/Infinity"}]},"apollonius":{"name":"Apollonius","born":-262,"died":-190,"bio":"<p><strong>Perqanın Apollonius</strong> (e.ə. 200-cü il) dörd <em>konus hissəsində</em> işi ilə ən yaxşı tanınan bir yunan riyaziyyatçısı və astronomu idi.</p>","links":[{"title":"Conic Sections","url":"/course/circles/conic-sections"}]},"kepler":{"name":"Kepler","born":1571,"died":1630,"bio":"<p><strong>Johannes Kepler</strong> (1571 - 1630) alman astronomu və riyaziyyatçısı idi. O, Praqadakı <em>imperator riyaziyyatçısı idi və planetar hərəkət</em> üçün üç _qanunları ilə yaxşı tanışdır. Kepler optikada da çalışdı və müşahidələri üçün təkmilləşdirilmiş bir teleskop icad etdi.</p>","links":[{"title":"Elliptical Orbits","url":"/course/circles/conic-sections#kepler"}]}}