{"newton":{"name":"Newton","born":1642,"died":1726,"bio":"<p><strong>Сэр Исаак Ньютон</strong> (1642 - 1726) был английским физиком, математиком и астрономом, и одним из самых влиятельных ученых всех времен. Он был профессором в Кембриджском университете и президентом Лондонского королевского общества.</p><p>В своей книге <em>Математические основы натуральной философии</em> Ньютон сформулировал законы движения и гравитации, которые заложили основы классической физики и доминировали в нашем взгляде на Вселенную в течение следующих трех столетий.</p><p>Помимо всего прочего, Ньютон был одним из изобретателей исчисления, построил первый отражающий телескоп, рассчитал скорость звука, изучил движение жидкостей и разработал теорию цвета, основанную на том, как призмы разделяют солнечный свет на спектральные цвета.</p>","links":[{"title":"Гравитация","url":"/course/circles/conic-sections#newton"},{"title":"Число Пи","url":"/course/circles/introduction#pi-record"}]},"leibniz":{"name":"Leibniz","born":1646,"died":1716,"bio":"<p><strong>Готфрид Вильгельм Лейбниц</strong> (1646 - 1716) был немецким математиком и философом. Среди многих других достижений он был одним из изобретателей исчисления и изобрел несколько первых механических калькуляторов.</p><p>Лейбниц верил, что наша вселенная - это «лучшая вселенная», которую мог создать Бог, и в то же время позволяющая нам иметь свободную волю. Он был большим сторонником <em>рационализма</em>, а также внес вклад в физику, медицину, лингвистику, право, историю и многие другие предметы.</p>"},"eratosthenes":{"name":"Eratosthenes","born":-276,"died":-195,"bio":"<p><strong>Эратосфен Киренский</strong> (ок. 276 - 195 до н.э.) был греческим математиком, географом, астрономом, историком и поэтом. Он провел большую часть своей жизни в Египте, в должности главы Александрийской библиотеки. Среди многих других достижений Эратосфен вычислил окружность Земли, измерил наклон оси вращения Земли, оценил расстояние от нашей планеты до Солнца и создал некоторые из первых карт мира. Он также изобрел «Сито Эратосфена», эффективный способ вычисления <em>простых чисел</em>.</p>","links":[{"title":"Радиус Земли","url":"/course/circles/tangets-chords-arcs#eratosthenes"},{"title":"Решето Эратосфена","url":"/course/divisibility/primes#eratosthenes"}]},"cavalieri":{"name":"Cavalieri","born":1598,"died":1647,"bio":"<p><strong>Бонавентура Кавальери</strong> (1598 - 1647) был итальянским математиком и монахом. Он разработал предшественника бесконечно малого исчисления и запомнился принципом Кавальери, чтобы найти объем твердых тел в геометрии.</p><p>Кавальери также работал в области оптики и механики, ввел логарифмы в Италии и обменивался письмами с Галилео Галилеем.</p>","links":[{"title":"Метод неделимых","url":"/course/circles/spheres-cones-cylinders#cavalieri"}]},"hilbert":{"name":"Hilbert","born":1862,"died":1943,"bio":"<p><strong>Давид Гильберт</strong> (1862 - 1943) был одним из самых влиятельных математиков 20-го века. Он работал почти во всех областях математики и был особенно заинтересован в создании формальной, логической основы математики.</p><p>Гильберт работал в Гёттингене (Германия), где он обучал многочисленных студентов, которые впоследствии стали известными математиками. Во время Международного конгресса математиков в 1900 году он представил список из 23 нерешенных проблем. Они заложили основу для будущих исследований</p><ul> <li>и четыре из них до сих пор не решены!</li></ul> ","links":[{"title":"Парадокс \"Гранд-отель\" Гильберта","url":"/world/Infinity"}]},"apollonius":{"name":"Apollonius","born":-262,"died":-190,"bio":"<p><strong>Аполлоний Пергский</strong> (ок. 200 г. до н.э.) был греческим математиком и астрономом, наиболее известным своей работой над четырьмя <em>коническими сечениями</em>.</p>","links":[{"title":"Конические сечение","url":"/course/circles/conic-sections"}]},"kepler":{"name":"Kepler","born":1571,"died":1630,"bio":"<p><strong>Иоганн Кеплер</strong> (1571 - 1630) был немецким астрономом и математиком. Он был <em>придворным математиком</em> в Праге, и он наиболее известен своими тремя <em>Законами движения планет</em>. Кеплер также издал трактат по оптике и изобрел улучшенный телескоп для своих наблюдений.</p>","links":[{"title":"Эллиптические орбиты","url":"/course/circles/conic-sections#kepler"}]}}