{"circle":{"title":"वृत्त","text":"<p>एक <strong>सर्कल</strong> एक निश्चित बिंदु (<em>केंद्र</em>) से एक निश्चित दूरी (<em>त्रिज्या</em>) पर दो आयामों में सभी बिंदुओं का समूह है।</p>","image":"circle.svg","link":"/course/circles/introduction#radius"},"compass":{"title":"दिशा सूचक यंत्र","text":"<p>एक कम्पास एक ड्राइंग टूल है जिसका उपयोग सर्कल या आर्क बनाने के लिए किया जाता है। इसमें दो भुजाएँ होती हैं - एक छोर पर सुई को केंद्र में रखा जाता है, जबकि दूसरे छोर पर पेंसिल से वक्र निकलता है।</p>"},"similar":{"title":"समान","text":"<p>दो ज्यामितीय आकार <strong>समान</strong> हैं यदि उनका आकार समान है लेकिन एक अलग आकार है। हम एक आकृति को दूसरे के साथ मेल खाने के लिए स्थानांतरित कर सकते हैं, घुमा सकते हैं, प्रतिबिंबित कर सकते हैं और आकार बदल सकते हैं। उनके संबंधित कोण समान हैं और उनके संबंधित पक्ष समान अनुपात में हैं।</p>"},"translation":{"title":"अनुवाद","text":"<p>एक <strong>अनुवाद</strong> एक परिवर्तन है जो किसी कोण या आकृति को बदले बिना किसी विशिष्ट दिशा में एक आकृति को स्थानांतरित करता है।</p>","image":"translation.svg","link":"/course/transformations/rigid#translations"},"dilation":{"title":"फैलाव","text":"<p>एक <strong>फैलाव</strong> एक परिवर्तन है जो एक ज्यामितीय आकार का आकार देता है, इसे बड़ा या छोटा करके।</p>","image":"dilation.svg","link":"/course/transformations/dilations"},"circle-circumference":{"title":"एक वृत्त की परिधि","text":"<p>एक वृत्त का <strong>परिधि</strong> इसके बाहरी किनारे की दूरी है। त्रिज्या <em>r</em> वाले वृत्त की परिधि <span class=\"math\" data-voice=\"C equals 2 pi r\"><mi>C</mi><mo value=\"=\">=</mo><mn>2</mn><mi>π</mi><mi>r</mi></span> है।</p>","link":"/course/circles/introduction#radius"},"circle-diameter":{"title":"व्यास (वृत्त)","text":"<p>एक वृत्त का <strong>व्यास</strong> इसकी परिधि पर दो विपरीत बिंदुओं के बीच की दूरी है, और इसके केंद्र से गुजर रही है।</p>","link":"/course/circles/introduction#radius"},"pi":{"title":"अनुकरणीय","text":"<p><strong>पाई</strong>, जिसे अक्सर ग्रीक अक्षर <em>}</em> के रूप में लिखा जाता है, परिधि और एक वृत्त के व्यास का अनुपात है। यह एक पारलौकिक संख्या है, और इसका मूल्य लगभग 3.14159265 है ...</p>","link":"/course/circles/introduction#pi-definition"},"circle-radius":{"title":"त्रिज्या","text":"<p>एक वृत्त का <strong>त्रिज्या</strong> इसके केंद्र और इसके परिधि के किसी बिंदु के बीच की दूरी (या एक रेखा खंड) है।</p>","link":"/course/circles/introduction#radius"},"irrational-numbers":{"title":"अपरिमेय संख्या","text":"<p><strong>अपरिमेय संख्याएँ</strong> वे संख्याएँ होती हैं जिन्हें पूर्णांकों के अंशों के रूप में व्यक्त नहीं किया जा सकता (तर्कसंगत संख्याएँ)। उदाहरण के लिए, 0.333333… = <span class=\"math\" data-voice=\"1 over 3\"><mfrac><mn>1</mn><mn>3</mn></mfrac></span> <em>तर्कसंगत</em> है, लेकिन <span class=\"nowrap\"><span class=\"math\" data-voice=\"pi\"><mi>π</mi></span>,</span> <span class=\"math\" data-voice=\"square root of 2\"><msqrt><mn>2</mn></msqrt></span> और <em>ई</em> सभी <em>तर्कहीन</em> हैं। एक अपरिमेय संख्या का दशमलव रूप रुकता या दोहराता नहीं है।</p>"},"iss":{"title":"अंतरराष्ट्रीय अंतरिक्ष स्टेशन","text":"<p><strong>अंतर्राष्ट्रीय अंतरिक्ष स्टेशन</strong> (ISS) 1998 में लॉन्च किया गया था और लगभग 400 किमी की ऊंचाई पर पृथ्वी की परिक्रमा करता है। यह कम पृथ्वी की कक्षा में सबसे बड़ा मानव निर्मित शरीर है, और लॉन्च के बाद से लगातार बसा हुआ है। इसे पृथ्वी से नग्न आंखों से देखा जा सकता है।</p>"},"degrees":{"title":"डिग्री","text":"<p><strong>डिग्री</strong> कोणों को मापने के लिए एक इकाई है, जिसे प्रतीक ° द्वारा निरूपित किया जाता है। एक पूर्ण क्रांति 360 ° है, एक समकोण 90 ° है, और इसी तरह।</p>"},"base-10":{"title":"आधार १०","text":"<p><strong>दशमलव प्रणाली</strong> (या <strong>आधार 10</strong>) दुनिया भर में सबसे अधिक उपयोग की जाने वाली नंबरिंग प्रणाली है। किसी संख्या के प्रत्येक अंक में 0 से 9 तक दस भिन्न मान हो सकते हैं।</p>"},"unit-circle":{"title":"यूनिट सर्कल","text":"<p>एक <strong>यूनिट सर्कल</strong> त्रिज्या 1 के साथ एक सर्कल है।</p>"},"radians":{"title":"रेडियंस","text":"<p><strong>रेडियंस</strong> कोणों के आकार को मापने के लिए एक इकाई है। एक पूर्ण क्रांति (360 °) <span class=\"math\" data-voice=\"2 pi\"><mn>2</mn><mi>π</mi></span> रेडियन है - एक इकाई वृत्त की परिधि की लंबाई।</p>","link":"/course/circles/radians#radians"},"trigonometry":{"title":"त्रिकोणमिति","text":"<p><strong>त्रिकोणमिति</strong> गणित की एक शाखा है जो त्रिकोण के पक्षों और कोणों के बीच संबंधों का अध्ययन करती है। यह मुख्य रूप से त्रिकोणमितीय कार्यों <strong>साइन</strong>, <strong>कोसाइन</strong>, <strong>स्पर्शरेखा</strong> और उनके पारस्परिक से संबंधित है।</p>","link":"/course/triangles/trigonometry"},"calculus":{"title":"गणना","text":"<p><strong>कैलकुलस</strong> गणित की वह शाखा है जो सीमा, व्युत्पत्ति, अभिन्न और शक्ति श्रृंखला से संबंधित है। सामान्य समस्याओं में एक वक्र का ढलान खोजना, एक्स्ट्रेमा का पता लगाना, किसी कार्य के परिवर्तन की दर का पता लगाना, और एक वक्र के नीचे का क्षेत्र खोजना शामिल है।</p>"},"sin":{"title":"आईटी इस","text":"<p><strong>साइन</strong> एक त्रिकोणमितीय फ़ंक्शन है जिसे लिखा जाता है। एक समकोण त्रिभुज में, यह विपरीत पक्ष और कर्ण का अनुपात है।</p>","link":"/course/triangles/trigonometry#trig-functions"},"cos":{"title":"कोसाइन","text":"<p><strong>कोसाइन</strong> एक त्रिकोणमितीय फ़ंक्शन है जिसे <span class=\"math\" data-voice=\"cos θ\"><mi mathvariant=\"normal\">cos</mi><mfenced><mi>θ</mi></mfenced></span> लिखा जाता है। समकोण त्रिभुज में, यह आसन्न भुजा और कर्ण का अनुपात है।</p>","link":"/course/triangles/trigonometry#trig-functions"},"cylinder":{"title":"सिलेंडर","text":"<p>एक <strong>सिलेंडर</strong> एक तीन आयामी ठोस होता है जिसमें एक घुमावदार सतह से जुड़ने वाले दो सर्वांगसम, समानांतर, वृत्ताकार पक्ष (<em>आधार</em>) होते हैं। आप एक सिलेंडर को \"परिपत्र प्रिज्म\" के रूप में भी सोच सकते हैं।</p>","link":"/course/circles/spheres-cones-cylinders#cylinder-prism","image":"cylinder.svg"},"cone":{"title":"शंकु","text":"<p>एक <strong>शंकु</strong> एक तीन-आयामी ठोस है जिसमें एक गोलाकार <em>आधार</em> है जो एक घुमावदार बिंदु से एक बिंदु (जिसे <em>वर्टेक्स</em> कहा जाता है) में शामिल हो गया है। आप एक शंकु को \"गोलाकार पिरामिड\" के रूप में भी सोच सकते हैं।</p><p>एक <strong>सही शंकु</strong> एक शंकु है जिसके शीर्ष के साथ सीधे इसके आधार के केंद्र के ऊपर है।</p>","link":"/course/circles/spheres-cones-cylinders#cone","image":"cone.svg"},"sphere":{"title":"क्षेत्र","text":"<p>एक <strong>गोले</strong> एक तीन आयामी ठोस है जिसमें सभी बिंदु होते हैं जो एक दिए गए <em>केंद्र</em> से समान दूरी रखते हैं। इस दूरी को गोले का <em>त्रिज्या</em> कहा जाता है।</p>","link":"/course/circles/spheres-cones-cylinders#sphere"},"prism":{"title":"प्रिज्म","text":"<p>एक <strong>प्रिज्म</strong> एक त्रि-आयामी ठोस होता है जिसमें दो सर्वांगसम चेहरे होते हैं जो बहुभुज होते हैं (जिन्हें <em>आधार</em> कहा जाता है), जिनके संगत शीर्ष समानांतर खंडों से जुड़ते हैं। एक प्रिज्म के शेष चेहरे सभी आयताकार या समांतर चतुर्भुज हैं।</p>","image":"prism.svg"},"cavalieri":{"title":"कैवलियरी का सिद्धांत","text":"<p><strong>कैवलियरी के सिद्धांत</strong> में कहा गया है कि यदि दो ठोसों की ऊंचाई समान है और हर स्तर पर समान पार-अनुभागीय क्षेत्र है, तो उन दोनों का आयतन समान है।</p><p>हम इस तथ्य का उपयोग कर सकते हैं कि प्रिज्म और सिलेंडरों का आयतन उनके क्रॉस-सेक्शन का क्षेत्रफल उनकी ऊंचाई से गुणा है।</p>"},"net":{"title":"पॉलीहेड्रा के जाल","text":"<p>एक पॉलीहेड्रॉन का <strong>शुद्ध</strong> जब आप प्राप्त करते हैं तो एक सपाट सतह पर इसके बहुभुज चेहरे को \"प्रकट\" करते हैं।</p>"},"pyramid":{"title":"पिरामिड","text":"<p>एक <strong>पिरामिड</strong> एक पॉलीहेड्रॉन है जिसमें आधार के रूप में एक बहुभुज होता है, और बाहर के चारों ओर त्रिकोणीय चेहरे होते हैं, जो एक शीर्ष पर स्थित होता है।</p><p>एक <strong>सही नियमित पिरामिड</strong> में, आधार <em>नियमित बहुभुज</em> है और शीर्ष सीधे आधार के केंद्र से ऊपर है।</p>","image":"pyramid.svg"},"pythagoras-theorem":{"title":"पाइथागोरस प्रमेय","text":"<p><strong>पाइथागोरस की प्रमेय</strong> में कहा गया है कि हर समकोण त्रिभुज में, <span class=\"nowrap\"><span class=\"math\" data-voice=\"a to the power of 2 plus b to the power of 2 equals c to the power of 2\"><msup><mi>a</mi><mn>2</mn></msup><mo value=\"+\">+</mo><msup><mi>b</mi><mn>2</mn></msup><mo value=\"=\">=</mo><msup><mi>c</mi><mn>2</mn></msup></span>,</span> जहां <em>c</em> कर्ण की लंबाई है और <em>एक</em> और <em>b</em> अन्य दो पक्षों की लंबाई हैं।</p>","link":"/course/triangles/pythagoras"},"circle-sector":{"title":"वृत्त क्षेत्र","text":"<p>एक वृत्त का एक <strong>सेक्टर</strong> इसके आंतरिक का एक हिस्सा है, जो दो राडिए और __चाप / # 2 से घिरा है। इसका क्षेत्र आंतरिक कोण के साथ-साथ चाप की लंबाई के लिए आनुपातिक है। इस का मतलब है कि</p>","link":"/course/circles/tangets-chords-arcs#sectors","image":"circle-sector.svg"},"cylinder-volume":{"title":"एक सिलेंडर की मात्रा","text":"<p>एक सिलेंडर की मात्रा समीकरण द्वारा दी गई है जहां <em>r</em> गोलाकार आधार की त्रिज्या है, और <em>h</em> सिलेंडर की ऊंचाई (दो आधारों के बीच लंबवत दूरी) है।</p>"},"cone-volume":{"title":"एक शंकु का आयतन","text":"<p>एक शंकु का आयतन समीकरण द्वारा दिया गया है जहाँ <em>r</em> गोलाकार आधार की त्रिज्या है, और <em>h</em> शंकु की ऊँचाई (आधार से शिखर की लंबवत दूरी) है।</p>"},"ellipse":{"title":"अंडाकार","text":"<p>एक <strong>दीर्घवृत्त</strong> एक घुमावदार मार्ग है जो दो फोकल बिंदुओं को घेरता है। दीर्घवृत्त की परिधि के किसी भी बिंदु पर दो foci के समान <em>दूरी</em> है।</p><p>यदि foci बहुत करीब है, तो दीर्घवृत्त लगभग एक चक्र की तरह दिखता है। जैसे ही वे आगे बढ़ते हैं, दीर्घवृत्त अधिक लम्बा हो जाता है।</p><p>एलिप्स एक प्रकार के <em>शंकु खंड</em> हैं: एक विमान के साथ शंकु का एक चौराहा।</p>","image":"ellipse.svg","link":"/course/circles/conic-sections#ellipses"},"parabola":{"title":"उपग्रह डिश","text":"<p>A <strong>parabola</strong> एक द्विघात फ़ंक्शन के ग्राफ़ की आकृति है जैसे <span class=\"math\" data-voice=\"y equals x to the power of 2\"><mi>y</mi><mo value=\"=\">=</mo><msup><mi>x</mi><mn>2</mn></msup></span>। यह सममित है, यू-आकार का है और ऊपर या नीचे की ओर इशारा कर सकता है। यह एक <em>शंकु अनुभाग</em> भी है।</p>","image":"parabola.svg"},"hyperbola":{"title":"अतिशयोक्ति","text":"<p>एक <strong>हाइपरबोला</strong> फ़ंक्शन के ग्राफ का आकार <span class=\"math\" data-voice=\"y equals 1 over x\"><mi>y</mi><mo value=\"=\">=</mo><mfrac><mn>1</mn><mi>x</mi></mfrac></span> है। इसमें दो अलग-अलग भाग होते हैं, जिनमें से दोनों <em>asymptotes</em> तक पहुंचते हैं। यह एक <em>शंकुधारी खंड</em> भी है।</p>","image":"hyperbola.svg"},"conic-section":{"title":"शंकुधारी खंड","text":"<p>एक <strong>शंकुधारी खंड</strong> एक वक्र है जो एक समतल विमान के साथ शंकु की सतह के चौराहे के रूप में बनाया जाता है। शंकुधारी वर्गों के चार अलग-अलग प्रकार हैं, जो कई गुणों को साझा करते हैं:</p><ul> <li><p>वृत्त</p></li><li><p>दीर्घवृत्त</p></li><li><p>परबोला</p></li><li><p>हाइपरबोला</p></li></ul> ","link":"/course/circles/conic-sections"},"gravity":{"title":"गुरुत्वाकर्षण","text":"<p><strong>गुरुत्वाकर्षण</strong> प्रकृति की चार मूलभूत शक्तियों में से एक है, और यह ब्रह्मांड में किसी भी दो द्रव्यमान को इस ओर खींचती है। आइजैक न्यूटन ने पाया कि दो द्रव्यमान <span class=\"math\" data-voice=\"m 1\"><msub><mi>m</mi><mn>1</mn></msub></span> और <span class=\"math\" data-voice=\"m 2\"><msub><mi>m</mi><mn>2</mn></msub></span> के बीच का बल है</p><p>जहाँ <em>G</em> गुरुत्वाकर्षण स्थिरांक है और <em>r</em> द्रव्यमान के बीच की दूरी है।</p>"}}