{"circle":{"title":"Kreis","text":"<p>Ein <strong>Kreis</strong> ist die Menge aller Punkte in einer Ebene (zweidimensional), die sich in einem bestimmten Abstand (dem <em>Radius</em>) von einem gegebenen Punkt (dem <em>Mittelpunkt</em>) befinden.</p>","image":"circle.svg","link":"/course/circles/introduction#radius"},"compass":{"title":"Zirkel","text":"<p>Ein Zirkel ist ein Zeichenwerkzeug, das zum Erstellen von Kreisen oder Kreisbögen verwendet wird. Er besteht aus zwei Armen - die Spitze an einem Ende wird in der Mitte platziert, während der Stift am anderen Ende die Kreislinie zeichnet.</p>"},"similar":{"title":"Ähnlich","text":"<p>Zwei geometrische Formen sind <strong>ähnlich</strong>, wenn sie die gleiche Form, aber eine andere Größe haben. Wir können eine der Formen bewegen, drehen, spiegeln und in der Größe verändern, um sie exakt an die andere anzupassen. Ihre entsprechenden Winkel sind gleich und ihre entsprechenden Seiten im gleichen Verhältnis.</p>"},"translation":{"title":"Verschiebung","text":"<p>Eine <strong>Verschiebung</strong> ist eine Abbildung, die eine Figur in eine bestimmte Richtung bewegt, ohne ihren Winkel oder ihre Form zu verändern.</p>","image":"translation.svg","link":"/course/transformations/rigid#translations"},"dilation":{"title":"Streckung (Dilatation)","text":"<p>Eine <strong>Dilatation</strong> (Streckung, Dehnung, Stauchung) ist eine Abbildung, die die Maße einer geometrischen Form ändert, indem sie diese größer oder kleiner macht.</p>","image":"dilation.svg","link":"/course/transformations/dilations"},"circle-circumference":{"title":"Umfang eines Kreises","text":"<p>Der <strong>Umfang</strong> eines Kreises ist die Streckenlänge seiner äußeren Umrandung (Kreislinie). Ein Kreis mit Radius <em>r</em> hat den Umfang<span class=\"nowrap\"><span class=\"math\" data-voice=\"u equals 2 r pi\"><mi>u</mi><mo value=\"=\">=</mo><mn>2</mn><mi>r</mi><mi>π</mi></span>.</span></p>","link":"/course/circles/introduction#radius"},"circle-diameter":{"title":"Durchmesser eines Kreises","text":"<p>Der <strong>Durchmesser</strong> eines Kreises ist der Abstand zwischen zwei gegenüberliegenden Punkten auf seinem Umfang, gemessen durch seinen Mittelpunkt.</p>","link":"/course/circles/introduction#radius"},"pi":{"title":"Pi","text":"<p><strong>Pi</strong>, oft als griechischer Buchstabe <em>π</em>geschrieben, ist das Verhältnis von Umfang und Durchmesser eines Kreises. Sie ist eine transzendente Zahl, und ihr Wert ist ungefähr 3,14159265…</p>","link":"/course/circles/introduction#pi-definition"},"circle-radius":{"title":"Radius","text":"<p>Der <strong>Radius</strong> eines Kreises ist der Abstand (oder eine Strecke) zwischen seinem Mittelpunkt und einem beliebigen Punkt auf seinem Umfang.</p>","link":"/course/circles/introduction#radius"},"irrational-numbers":{"title":"Irrationale Zahlen","text":"<p><strong>Irrationale Zahlen</strong> sind Zahlen, die nicht als Bruchzahlen von ganzen Zahlen (<em>rationale Zahlen</em>) ausgedrückt werden können. Zum Beispiel ist 0,33333333.... = <span class=\"math\" data-voice=\"1 over 3\"><mfrac><mn>1</mn><mn>3</mn></mfrac></span> <em>rational</em>, aber <span class=\"nowrap\"><span class=\"math\" data-voice=\"pi\"><mi>π</mi></span>,</span> <span class=\"math\" data-voice=\"square root of 2\"><msqrt><mn>2</mn></msqrt></span> und <em>e</em> sind alle <em>irrational</em>. In Dezimalschreibweise hört eine irrationalen Zahl nie auf und wiederholt sich dabei auch nicht.</p>"},"iss":{"title":"Internationale Raumstation","text":"<p>Die <strong>Internationale Raumstation</strong> (ISS) wurde 1998 gestartet und umkreist die Erde in einer Höhe von etwa 400 km. Es ist das größte von Menschenhand geschaffene Bauwerk in der niedrigen Erdumlaufbahn (LEO) und wurde seit dem Start durchgehend bewohnt. Sie kann mit bloßem Auge von der Erde aus gesehen werden.</p>"},"degrees":{"title":"Grad","text":"<p><strong>Grade</strong> sind eine Einheit zur Winkelmessung, die mit Symbol ° bezeichnet werden. Eine komplette Umdrehung sind 360°, ein rechter Winkel 90°, und so weiter.</p>"},"base-10":{"title":"Basis 10","text":"<p>Das <strong>Dezimalsystem</strong> (oder <strong>Basis 10</strong>) ist das weltweit am häufigsten verwendete Zahlensystem. Jede Ziffer einer Zahl kann einen von zehn verschiedenen Werten haben, von 0 bis 9.</p>"},"unit-circle":{"title":"Einheitskreis","text":"<p>Ein <strong>Einheitskreis</strong> ist ein Kreis mit Radius 1.</p>"},"radians":{"title":"Radiant","text":"<p><strong>Radiant</strong> ist eine Einheit zur Messung der Größe von Winkeln. Eine vollständige Umdrehung (360°) ist <span class=\"math\" data-voice=\"2 pi\"><mn>2</mn><mi>π</mi></span> in Radiant (Bogenmaß) - die Länge des Umfangs eines Einheitskreises.</p>","link":"/course/circles/radians#radians"},"trigonometry":{"title":"Trigonometrie","text":"<p>Die <strong>Trigonometrie</strong> ist ein Zweig der Mathematik, der die Beziehungen zwischen den Seiten und Winkeln von Dreiecken untersucht. Es geht in erster Linie um die trigonometrischen Funktionen <strong>Sinus</strong>, <strong>Kosinus</strong>, <strong>Tangens</strong> und deren Wechselwirkungen.</p>","link":"/course/triangles/trigonometry"},"calculus":{"title":"Analysis","text":"<p>Die <strong>Analysis</strong> ist der Zweig der Mathematik, der sich mit Grenzwerten, Ableitungen, Integralen und Potenzreihen beschäftigt. Häufige Aufgabenstellungen sind die Berechnung der Steigung einer Kurve, von Extremen, der Änderungsrate einer Funktion und der Fläche unter einer Kurve.</p>"},"sin":{"title":"Sinus","text":"<p>Der <strong>Sinus</strong> ist eine trigonometrische Funktion, die <span class=\"math\" data-voice=\"sin θ\"><mi mathvariant=\"normal\">sin</mi><mfenced><mi>θ</mi></mfenced></span> geschrieben wird. In einem rechtwinkligen Dreieck ist der Sinus das Verhältnis der Gegenkathete zur Hypotenuse.</p>","link":"/course/triangles/trigonometry#trig-functions"},"cos":{"title":"Kosinus","text":"<p>Der <strong>Kosinus</strong> ist eine trigonometrische Funktion, die <span class=\"math\" data-voice=\"cos θ\"><mi mathvariant=\"normal\">cos</mi><mfenced><mi>θ</mi></mfenced></span> geschrieben wird. In einem rechtwinkligen Dreieck ist es das Verhältnis der Ankathete zur Hypotenuse.</p>","link":"/course/triangles/trigonometry#trig-functions"},"cylinder":{"title":"Zylinder","text":"<p>Ein <strong>Zylinder</strong> ist ein dreidimensionaler Körper, der aus zwei kongruenten, parallelen, kreisförmigen Flächen (den <em>Grund- und Deckflächen</em>) besteht, die durch eine gekrümmte Oberfläche verbunden sind. Man könnte sich einen Zylinder auch als \"rundes Prisma\" vorstellen.</p>","link":"/course/circles/spheres-cones-cylinders#cylinder-prism","image":"cylinder.svg"},"cone":{"title":"Kegel","text":"<p>Ein <strong>Kegel</strong> ist ein dreidimensionaler Körper, der eine kreisförmige <em>Grundfläche</em> hat, die mit einem einzigen Punkt (dem sogenannten <em>Scheitelpunkt</em>) durch eine gebogene Seite verbunden ist. Man könnte sich einen Kegel auch als \"kreisförmige Pyramide\" vorstellen.</p><p>Ein <strong>gerader Kegel</strong> ist ein Kegel mit seinem Scheitelpunkt direkt über dem Mittelpunkt seiner Grundfläche.</p>","link":"/course/circles/spheres-cones-cylinders#cone","image":"cone.svg"},"sphere":{"title":"Kugel","text":"<p>Eine <strong>Kugel</strong> ist ein dreidimensionaler Körper, der aus allen Punkten besteht, die den gleichen Abstand zu einem bestimmten <em>Mittelpunkt</em> haben. Dieser Abstand wird als <em>Radius</em> der Kugel bezeichnet.</p>","link":"/course/circles/spheres-cones-cylinders#sphere"},"prism":{"title":"Prisma","text":"<p>Ein <strong>Prisma</strong> ist ein dreidimensionaler Körper mit zwei kongruenten vieleckigen Flächen, (_Grund- und Deckfläche_genannt), deren zusammengehörende Eckpunkte durch parallele Kanten verbunden sind. Die verbleibenden Flächen eines Prismas sind alles Rechtecke oder Parallelogramme.</p>","image":"prism.svg"},"cavalieri":{"title":"Das Prinzip von Cavalieri","text":"<p>Das <strong>Prinzip von Cavalieri</strong> besagt, dass, wenn zwei Festkörper auf jeder Ebene die gleiche Höhe und Querschnittsfläche aufweisen, beide das gleiche Volumen haben.</p><p>Aus dieser Tatsache lässt sich ableiten, dass das Volumen der Prismen und Zylinder die Fläche ihres Querschnitts multipliziert mit ihrer Höhe ist.</p>"},"net":{"title":"Netze von Polyedern","text":"<p>Das <strong>Netz</strong> eines Polyeders ist das, was man bekommt, wenn man seine Vieleckflächen auf eine ebene Fläche entfaltet.</p>"},"pyramid":{"title":"Pyramide","text":"<p>Eine <strong>Pyramide</strong> ist ein Polyeder, das ein Vieleck als Grundfläche, und dreieckige Flächen, die sich in einem Scheitelpunkt treffen, als Mantel hat.</p><p>Bei einer <strong>regelmäßigen Pyramide</strong> ist die Grundfläche ein <em>regelmäßiges Vieleck</em> und der Scheitelpunkt liegt direkt über der Mitte dieser Grundfläche.</p>","image":"pyramid.svg"},"pythagoras-theorem":{"title":"Der Satz des Pythagoras","text":"<p><strong>Der Satz des Pythagoras</strong> besagt, dass in jedem rechtwinkligen Dreieck <span class=\"math\" data-voice=\"a to the power of 2 plus b to the power of 2 equals c to the power of 2\"><msup><mi>a</mi><mn>2</mn></msup><mo value=\"+\">+</mo><msup><mi>b</mi><mn>2</mn></msup><mo value=\"=\">=</mo><msup><mi>c</mi><mn>2</mn></msup></span> gilt, wobei <em>c</em> die Länge der Hypotenuse und <em>a</em> und <em>b</em> die Längen der beiden Katheten sind.</p>","link":"/course/triangles/pythagoras"},"circle-sector":{"title":"Kreissektor","text":"<p>Ein <strong>Sektor</strong> eines Kreises ist ein Teil seines Inneren, der von zwei Radien und einem <strong>Kreisbogen</strong>begrenzt wird. Seine Fläche ist proportional zum Innenwinkel sowie zur Länge des Kreisbogens. Damit ergibt sich</p><p class=\"text-center\"> <span class=\"math\" data-voice=\"A Sektor over A Kreis equals Kreisbogen over Umfang equals θ over 2 pi\"><mfrac><mrow><msub><mi>A</mi><mtext>Sektor</mtext></msub></mrow><mrow><msub><mi>A</mi><mtext>Kreis</mtext></msub></mrow></mfrac><mo value=\"=\">=</mo><mfrac><mtext>Kreisbogen</mtext><mtext>Umfang</mtext></mfrac><mo value=\"=\">=</mo><mfrac><mi>θ</mi><mrow><mn>2</mn><mi>π</mi></mrow></mfrac></span></p>","link":"/course/circles/tangets-chords-arcs#sectors","image":"circle-sector.svg"},"cylinder-volume":{"title":"Volumen eines Zylinders","text":"<p>Das <strong>Volumen eines Zylinders</strong> ergibt sich aus der Formel</p><p class=\"text-center\"> <span class=\"nowrap\"><span class=\"math\" data-voice=\"V equals pi r to the power of 2 h\"><mi>V</mi><mo value=\"=\">=</mo><mi>π</mi><msup><mi>r</mi><mn>2</mn></msup><mi>h</mi></span>,</span></p><p>wobei <em>r</em> der Radius der kreisförmigen Grundfläche und <em>h</em> die Höhe des Zylinders (der senkrechte Abstand zwischen Grund- und Deckfläche) ist.</p>"},"cone-volume":{"title":"Volumen eines Kegels","text":"<p>Das Volumen eines Kegels ergibt sich aus der Formel</p><p class=\"text-center\"> <span class=\"nowrap\"><span class=\"math\" data-voice=\"V equals 1 over 3 pi r to the power of 2 h\"><mi>V</mi><mo value=\"=\">=</mo><mfrac><mn>1</mn><mn>3</mn></mfrac><mi>π</mi><msup><mi>r</mi><mn>2</mn></msup><mi>h</mi></span>,</span></p><p>wobei <em>r</em> der Radius der kreisförmigen Grundfläche und <em>h</em> die Höhe des Kegels (der senkrechte Abstand von der Basis zum Scheitelpunkt) ist.</p>"},"ellipse":{"title":"Ellipse |","text":"<p>Eine <strong>Ellipse</strong> ist eine gekrümmte Bahn rund um zwei Brennpunkte. Jeder Punkt am Umfang der Ellipse hat die gleiche <em>Summe der Abstände</em> zu den beiden Brennpunkten.</p><p>Wenn die Brennpunkte sehr nah beieinander liegen, sieht die Ellipse fast wie ein Kreis aus. Wenn sie sich weiter auseinander bewegen, wird die Ellipse länglicher.</p><p>Ellipsen sind eine Art von _Kegelschnitt:_eine Schnittfläche eines Kegels mit einer Ebene.</p>","image":"ellipse.svg","link":"/course/circles/conic-sections#ellipses"},"parabola":{"title":"Parabel","text":"<p>Eine <strong>Parabel</strong> ist die Form des Graphen einer quadratischen Funktion wie <span class=\"nowrap\"><span class=\"math\" data-voice=\"y equals x to the power of 2\"><mi>y</mi><mo value=\"=\">=</mo><msup><mi>x</mi><mn>2</mn></msup></span>.</span> Sie ist symmetrisch, u-förmig und kann entweder nach oben oder nach unten zeigen. Sie gehört auch zu den <em>Kegelschnitten</em>.</p>","image":"parabola.svg"},"hyperbola":{"title":"Hyperbel","text":"<p>Eine <strong>Hyperbel</strong> ist die Form des Graphen der Funktion <span class=\"nowrap\"><span class=\"math\" data-voice=\"y equals 1 over x\"><mi>y</mi><mo value=\"=\">=</mo><mfrac><mn>1</mn><mi>x</mi></mfrac></span>.</span> Sie besteht aus zwei getrennten Teilen, die sich beide <em>Asymptoten annähern.</em> Sie gehört auch zu den <em>Kegelschnitten</em>.</p>","image":"hyperbola.svg"},"conic-section":{"title":"Kegelschnitt","text":"<p>Ein <strong>Kegelschnitt</strong> ist eine Kurve, die aus den Schnittpunkten der Oberfläche eines Kegels mit einer ebenen Fläche erzeugt wird. Es gibt vier verschiedene Arten von Kegelschnitten, die alle viele gemeinsame Eigenschaften haben:</p><ul> <li>Kreis</li><li>Ellipse</li><li>Parabel</li><li>Hyperbel</li></ul> ","link":"/course/circles/conic-sections"},"gravity":{"title":"Gravitation","text":"<p><strong>Gravitation</strong> ist eine der vier fundamentalen Kräfte der Natur, und sie zieht zwei beliebige Massen im Universum zur jeweils anderen. Isaac Newton entdeckte, dass die Kraft zwischen zwei Massen <span class=\"math\" data-voice=\"m 1\"><msub><mi>m</mi><mn>1</mn></msub></span> und <span class=\"math\" data-voice=\"m 2\"><msub><mi>m</mi><mn>2</mn></msub></span></p><p class=\"text-center\"> <span class=\"math\" data-voice=\"F equals G m 1 m 2 over r to the power of 2\"><mi>F</mi><mo value=\"=\">=</mo><mfrac><mrow><mi>G</mi><msub><mi>m</mi><mn>1</mn></msub><msub><mi>m</mi><mn>2</mn></msub></mrow><mrow><msup><mi>r</mi><mn>2</mn></msup></mrow></mfrac></span> ist,</p><p>wobei <em>G</em> die Gravitationskonstante und <em>r</em> der Abstand zwischen den Massen ist.</p>"}}