{"pascal":{"name":"Pascal","full":"Blaise Pascal","born":1623,"died":1662,"bio":"<p><strong>Blaise Pascal</strong> (1623 – 1662) was a French mathematician, physicist and philosopher. He invented some of the first mechanical calculators, as well as working on projective geometry, probability and the physics of the vacuum.</p><p>Most famously, Pascal is remembered for naming <em>Pascal’s Triangle</em>, an infinite triangle of numbers with some amazing properties.</p>","links":[{"title":"Probability","url":"/course/probability/introduction"},{"title":"Pascal’s Triangle","url":"/course/sequences/pascals-triangle"}]},"fermat":{"name":"Fermat","full":"Pierre de Fermat","born":1607,"died":1665,"bio":"<p><strong>Pierre de Fermat</strong> (1607 – 1665) was a French mathematician and lawyer. He was an early pioneer of calculus, as well as working in number theory, probability, geometry and optics.</p><p>In 1637, he wrote a short note in the margin of one of his textbooks, claiming that the equation <span class=\"math\" data-voice=\"a to the power of n plus b to the power of n equals c to the power of n\"><msup><mi>a</mi><mi>n</mi></msup><mo value=\"+\">+</mo><msup><mi>b</mi><mi>n</mi></msup><mo value=\"=\">=</mo><msup><mi>c</mi><mi>n</mi></msup></span> has no integer solutions for <span class=\"nowrap\"><span class=\"math\" data-voice=\"n is greater than 2\"><mi>n</mi><mo value=\">\">&gt;</mo><mn>2</mn></span>,</span> and that he had a “marvellous proof, which this margin is too narrow to contain”. This became known as <em>Fermat’s Last Theorem</em>, and one of the most famous unsolved problems in mathematics – until it was finally proven in 1994.</p>","links":[{"title":"Probability","url":"/course/probability/introduction"}]},"planck":{"name":"Plank","bio":"<p><strong>Max Plank</strong> (1858 – 1947) was a German physicist and one of the original developers of Quantum Mechanics – for which he received the Nobel Prize in 1918.</p>"},"dirac":{"name":"Dirac","bio":"<p><strong>Paul Dirac</strong> (1898 – 1972) was an English theoretical physicist, who shared the 1933 Nobel Prize with Erwin Schrödinger. Dirac was one of the pioneers of Quantum Mechanics, formulated the famous <em>Dirac equation</em> and first predicted the existence of antimatter.</p><p>He taught at Cambridge University, before moving to America. Dirac was famously shy and, according to Einstein, <em>“balancing on the dizzying path between genius and madness”</em>.</p>"}}