{"pascal":{"name":"Pascal","born":1623,"died":1662,"bio":"<p><strong>Blaise Pascal</strong> (1623 – 1662), Fransız matematikçi, düşünür ve fizikçiydi. Mekanik hesap makinelerinin ilk kaşiflerindendi. Aynı zamanda projektif geometri, olasılık ve vakum fiziği ile ilgili çalışmalar yapmıştır.</p><p>Pascal en çok içinde muhteşem özellikler barındıran ve doğal sayılarla oluşturulan sonsuz üçgenle tanınıyor. Bu üçgeni günümüzde kendi ismiyle anıyor ve üçgene <em>Pascal Üçgeni</em> diyoruz.</p>","links":[{"title":"Olasılık","url":"/course/probability/introduction"},{"title":"Pascal Üçgeni","url":"/course/sequences/pascals-triangle"}]},"fermat":{"name":"Fermat","born":1607,"died":1665,"bio":"<p><strong>Pierre de Fermat</strong> (1607 – 1665) Fransız bir matematikçi ve avukattı. Kalkülüsün öncülerindendi ve sayılar kuramında, olasılıkta, geometri ve optikte çalışmaları vardı.</p><p>1637 yılında bir kitabının kenarına, <span class=\"math\" data-voice=\"a to the power of n plus b to the power of n equals c to the power of n\"><msup><mi>a</mi><mi>n</mi></msup><mo value=\"+\">+</mo><msup><mi>b</mi><mi>n</mi></msup><mo value=\"=\">=</mo><msup><mi>c</mi><mi>n</mi></msup></span> denkleminin <span class=\"math\" data-voice=\"n is greater than 2\"><mi>n</mi><mo value=\">\">&gt;</mo><mn>2</mn></span> durumunda hiç tam sayı çözümü olmadığını, buna “muhteşem bir kanıtı” olduğunu, ancak “sayfada yeterince yer olmadığını” söyleyen kısa bir not yazmıştır. <em>Fermat’nın Son Teoremi</em> adıyla bilinen bu önerme, tüm zamanların en ünlü çözülemeyen problemleri arasındaydı, taa ki 1994’te Andrew Wiles tarafından kanıtlanana kadar.</p>","links":[{"title":"Olasılık","url":"/course/probability/introduction"}]},"planck":{"name":"Plank","bio":"<p><strong>Max Plank</strong> (1858 – 1947) Alman bir fizikçiydi. Kuantum mekaniğini geliştiren ilk isimlerden biri olarak 1918 yılında Nobel Fizik ödülünü almıştır.</p>"},"dirac":{"name":"Dirac","bio":"<p>İngiliz teorik fizikçi <strong>Paul Dirac</strong> (1898 – 1972), 1933 yılında Erwin Schrödinger ile Nobel Ödülü’ne layık görülmüştür. Dirac kuantum mekaniğinin öncülerindendir, meşhur _Dirac denklemi_’ni formüle eden ve antimaddenin varlığını öngören ilk biliminsanıdır.</p><p>Amerika’ya taşınmadan önce Cambridge Üniversitesi’nde çalışıyordu. Herkes Dirac’ın utangaç bir insan olduğunu bilirdi. Hatta Einstein’e göre Dirac <em>”delilik ve dahilik arasındaki baş döndürücü yolda dengeli kalabilmeyi başaran”</em> insandır.</p>"}}