{"pascal":{"name":"Pascal","born":1623,"died":1662,"bio":"<p><strong>Blaise Pascal</strong> (1623 - 1662) war ein französischer Mathematiker, Physiker und Philosoph. Er erfand einige der ersten mechanischen Taschenrechner und beschäftigte sich mit projektiver Geometrie, Wahrscheinlichkeit und Physik des Vakuums.</p><p>Am bekanntesten ist, dass Pascal für die Benennung von <em>Pascals Dreieck</em> bekannt ist, einem unendlichen Dreieck von Zahlen mit einigen erstaunlichen Eigenschaften.</p>","links":[{"title":"Probability","url":"/course/probability/introduction"},{"title":"Pascal’s Triangle","url":"/course/sequences/pascals-triangle"}]},"fermat":{"name":"Fermat","born":1607,"died":1665,"bio":"<p><strong>Pierre de Fermat</strong> (1607 – 1665) war ein französischer Mathematiker und Jurist. Er war ein früher Pionier der Differentialrechnung und arbeitete in den Bereichen Zahlentheorie, Wahrscheinlichkeit, Geometrie und Optik.</p><p>1637 schrieb er eine kurze Notiz am Rand eines seiner Lehrbücher und behauptete, dass die Gleichung <span class=\"math\" data-voice=\"a to the power of n plus b to the power of n equals c to the power of n\"><msup><mi>a</mi><mi>n</mi></msup><mo value=\"+\">+</mo><msup><mi>b</mi><mi>n</mi></msup><mo value=\"=\">=</mo><msup><mi>c</mi><mi>n</mi></msup></span> keine ganzzahligen Lösungen für <span class=\"math\" data-voice=\"n is greater than 2\"><mi>n</mi><mo value=\">\">&gt;</mo><mn>2</mn></span> habe, und dass er einen “wahrhaft wunderbaren Beweis entdeckt habe, der Rand hier aber zu schmal sei, um ihn zu fassen”. Dies wurde bekannt als <em>Fermat's letzter Satz</em>, und war eines der berühmtesten ungelösten Probleme in der Mathematik – bis es schließlich 1994 bewiesen wurde.</p>","links":[{"title":"Wahrscheinlichkeit","url":"/course/probability/introduction"}]},"planck":{"name":"Plank","bio":"<p><strong>Max Plank</strong> (1858 - 1947) war ein deutscher Physiker und einer der ursprünglichen Entwickler der Quantenmechanik - für die er 1918 den Nobelpreis erhielt.</p>"},"dirac":{"name":"Dirac","bio":"<p><strong>Paul Dirac</strong> (1898 – 1972) war ein englischer theoretischer Physiker, der sich 1933 den Nobelpreis mit Erwin Schrödinger teilte. Dirac war einer der Pioniere der Quantenmechanik, formulierte die berühmte <em>Dirac-Gleichung</em> und sagte als Erster die Existenz von Antimaterie voraus.</p><p>Er unterrichtete an der Cambridge University bevor er nach Amerika zog. Dirac war für seine Schüchternheit berühmt und, laut Einstein, <em>\"auf dem schwindelerregenden Weg zwischen Genie und Wahnsinn\"</em>.</p>"}}