{"telegraph":{"title":"التلغراف","text":"<p><strong>التلغراف</strong> هو جهاز للاتصال عن طريق الإشارات الرمز عن بعد عن طريق النقل الكهربائي عبر الأسلاك. تم استخدام رمز مورس في البداية للتواصل باستخدام التلغراف.</p>"},"morse-code":{"title":"شيفرة مورس","text":"<p><strong>شفرة مورس</strong> هي طريقة لتمثيل الحروف والأرقام باستخدام إشارات قصيرة وطويلة (تسمى النقاط والشرطات). سميت باسم <em>Samuel Morse</em> واستخدمت في البداية للتواصل عبر مسافات طويلة باستخدام التلغراف.</p><p>على سبيل المثال ، سيتم تمثيل الحرف \"L\" باستخدام تسلسل <x-morse char=\"L\"></x-morse> للإشارات القصيرة والطويلة.</p>"},"information":{"title":"نظرية المعلومات","text":"<p><strong>نظرية المعلومات</strong> هي دراسة القياس والتخزين ونقل البيانات والمعلومات. يتم استخدامه في المنطق والتشفير وعلوم الكمبيوتر.</p>"},"dna":{"title":"النقرس","text":"<p><strong>DNA</strong> (حمض الديوكسي ريبونوكلييك) هو جزيء يحتوي على المخطط الجيني لجميع الكائنات الحية. تتكون معظم الحمض النووي من خيطين يشكلان <em>حلزون مزدوج</em>. يتم ترميز المعلومات الوراثية بترتيب أربعة أحماض نووية (A ، G ، C و T) التي تشكل الحمض النووي. <em>تسلسل الحمض النووي</em> هو عملية استخراج هذه المعلومات - وهي تقنية أساسية في علم الأحياء والطب وعلم الوراثة والتكنولوجيا الحيوية.</p>"},"molecule":{"title":"مركب","text":"<p>يتكون <strong>الجزيء</strong> من ذرتين أو أكثر مترابطتين ببعضهما بواسطة روابط كيميائية. ليس له شحنة كهربائية ، بخلاف <strong>الأيونات</strong>.</p><p>تتضمن أمثلة الجزيئات <span class=\"math\" data-voice=\"O 2\"><msub><mi>O</mi><mn>2</mn></msub></span> ، والتي تتكون من ذرتي أكسجين متصلتين ، و <span class=\"math\" data-voice=\"H 2 O\"><msub><mi>H</mi><mn>2</mn></msub><mi>O</mi></span> ، والتي تتكون من ذرتي هيدروجين وذرة أكسجين.</p>"},"amino-acid":{"title":"حمض أميني","text":"<p><strong>الأحماض الأمينية</strong> هي مركبات عضوية صغيرة تشكل <strong>البروتينات</strong>. وهي بعض اللبنات الأساسية لجميع الكائنات الحية.</p><p>في أجسامنا ، تُستخدم الأحماض الأمينية لكسر الطعام ، وإصلاح أنسجة الجسم ، وتخزين الطاقة ، والعديد من الوظائف الأخرى.</p>"}}