{"telegraph":{"title":"Telegraph","text":"<p>A <strong>telegraph</strong> is system for transmitting messages across long distances, by sending electric signals along wires.</p>"},"morse-code":{"title":"Morse code","text":"<p><strong>Morse code</strong> is a way to represent letters and numbers using short and long signals (called dots and dashes). It is named after <em>Samuel Morse</em> and was initially used to communicate over long distances using telegraphs.</p><p>For example, the letter “L” would be represented using the sequence <x-morse char=\"L\"></x-morse> of short and long signals.</p>"},"information":{"title":"Information Theory","text":"<p><strong>Information theory</strong> is the study of quantification, storage and communication of data and information. It is used in logic, cryptography and computer science.</p>"},"dna":{"title":"DNA","text":"<p><strong>DNA</strong> (deoxyribonucleic acid) is a molecule that contains the genetic blueprint of all living organisms. Most DNAs consist of two strands forming a <em>double helix</em>. Genetic information is encoded in the order of four nucleic acids (A, G, C and T) which make up the DNA. <em>DNA sequencing</em> is the process of extracting this information – an essential technique in biology, medicine, genetics and biotechnology.</p>"},"molecule":{"title":"Molecule","text":"<p>A <strong>molecule</strong> consists of two or more atoms which are held together by chemical bonds. It has no electric charge, unlike <strong>Ions</strong>.</p><p>Examples of molecules include <span class=\"nowrap\"><span class=\"math\" data-voice=\"O 2\"><msub><mi>O</mi><mn>2</mn></msub></span>,</span> which consists of two connected Oxygen atoms, and <span class=\"nowrap\"><span class=\"math\" data-voice=\"H 2 O\"><msub><mi>H</mi><mn>2</mn></msub><mi>O</mi></span>,</span> which consists of two Hydrogen atoms and one Oxygen atom.</p>"},"amino-acid":{"title":"Amino acid","text":"<p><strong>Amino acids</strong> are tiny organic compounds that make up <strong>proteins</strong>. They are some of the key building blocks of all living organisms.</p><p>In our body, amino acids are used to break down food, repair body tissue, store energy, and for many other functions.</p>"},"base-10":{"title":"Base 10","text":"<p>The <strong>decimal system</strong> (or <strong>base 10</strong>) is the numbering system most commonly used around the world. Every digit in a number can have one of ten different values, from 0 to 9.</p>"}}