{"menger":{"name":"Menger","bio":"<p><strong>कार्ल मेन्जर</strong> (1902 - 1985) एक ऑस्ट्रियाई-अमेरिकी गणितज्ञ थे। उन्होंने बीजगणित, ज्यामिति, आयाम, खेल सिद्धांत और सामाजिक विज्ञान पर शोध किया, लेकिन उन्हें <em>मेन्जर स्पंज</em>, एक प्रसिद्ध त्रि-आयामी <em>भग्न</em> के लिए सबसे अच्छी तरह से याद किया जाता है।</p>"},"richardson":{"name":"Richardson","bio":"<p><strong>लुईस फ्राई रिचर्डसन</strong> (1881 - 1953) एक ब्रिटिश गणितज्ञ और भौतिक विज्ञानी थे। उन्होंने मौसम की भविष्यवाणी की आधुनिक गणितीय तकनीकों का बीड़ा उठाया, हिमशैल का पता लगाने के लिए ध्वनिक मशीनों का आविष्कार किया और रैखिक समीकरणों की प्रणालियों को हल करने के लिए विकसित तरीकों को अपनाया।</p><p>उन्होंने अपनी साझा सीमा की लंबाई को देखते हुए एक दूसरे पर युद्ध की घोषणा करने वाले दो देशों की संभावना की गणना करने का भी प्रयास किया। हालाँकि, वह देशों की सीमाओं की लंबाई के लिए सटीक माप नहीं पा सका था। इससे उन्हें यह एहसास हुआ कि सीमाओं और समुद्र तटों में <em>भग्न</em> के कई गुण हैं।</p>"},"mandelbrot":{"born":1924,"died":2010,"name":"Mandelbrot","bio":"<p>गणितज्ञ <strong>बेनोइट मैंडेलब्रॉट</strong> पोलैंड में पैदा हुए, फ्रांस में बड़े हुए और अंततः संयुक्त राज्य अमेरिका चले गए। वह <em>भग्न ज्यामिति</em> के अग्रदूतों में से एक थे, और विशेष रूप से इस बात में दिलचस्पी रखते थे कि वास्तविक दुनिया में “खुरदरापन” और “अराजकता” कैसे दिखाई देते हैं।</p><p>आईबीएम में काम करते हुए, उन्होंने फ्रैक्टल्स के चित्रमय प्रतिनिधित्व को बनाने के लिए शुरुआती कंप्यूटरों का उपयोग किया और 1980 में उन्होंने प्रसिद्ध <em>मैंडलब्रॉट सेट</em> की खोज की।</p>","links":[{"title":"Fractals","url":"/course/fractals/introduction"},{"title":"Mandelbrot Set","url":"/course/fractals/mandelbrot"}]},"sierpinski":{"name":"Sierpiński","bio":"<p><strong>वाक्लाव फ्रांसिसज़ेक सेरपिस्की</strong> (1882 - 1969) एक पोलिश गणितज्ञ थे। उन्होंने सेट थ्योरी, संख्या सिद्धांत, विश्लेषण और टोपोलॉजी, 700 से अधिक पत्रों और 50 पुस्तकों के प्रकाशन में महत्वपूर्ण खोजें कीं। उन्होंने कई लोकप्रिय <em>भग्न</em> का आविष्कार भी किया, जिसमें <em>सियरपिंस्की त्रिकोण</em>, <em>सियरपिंस्की कालीन</em> और <em>सियरपिंस्की वक्र</em> शामिल हैं।</p><p>सीरपिन्स्की नंबर विषम प्राकृतिक संख्याएँ हैं के ऐसे कि सभी प्राकृतिक संख्याओं के लिए संमिश्र है n। <em>Sierpinski समस्या</em> सबसे छोटी Sierpinski संख्या खोजने की कोशिश कर रही है। सबसे छोटी ज्ञात संख्या 78,557 है - लेकिन यह अभी भी अज्ञात है कि क्या छोटे हैं।</p>"},"wolfram":{"name":"Wolfram","bio":"<p><strong>स्टीफन वोल्फ्राम</strong> (जन्म 1959) एक ब्रिटिश-अमेरिकी कंप्यूटर वैज्ञानिक, भौतिक विज्ञानी, और व्यवसायी हैं। वह <em>वोल्फ्राम रिसर्च</em> के संस्थापक और सीईओ हैं, जहां उन्होंने <em>मैथमेटिका</em> कंप्यूटिंग सिस्टम, <em>वोल्फ्राम | अल्फा</em> उत्तर इंजन, और वोल्फ्राम प्रोग्रामिंग भाषा विकसित की है।</p>"},"julia":{"name":"Julia","bio":"<p>गैस्टन मौरिस जूलिया (१ 1978 ९ ३ - १ ९ was a) एक फ्रांसीसी गणितज्ञ थे, जिन्होंने {२} जूलिया सेट {३} की सह-खोज की, एक भग्न जिसे बाद में बेनोइट मैंडेलब्रोट ने लोकप्रिय बनाया था।</p>"},"fatou":{"name":"Fatou","bio":"<p><strong>पियरे जोसेफ लुई फतौ</strong> (1878 - 1929) एक फ्रांसीसी गणितज्ञ और खगोलशास्त्री थे। उन्होंने <em>जूलिया सेट</em> की सह-खोज की, और इसके उलट, फतौ सेट का नाम उनके नाम पर रखा गया है। उन्होंने विश्लेषण और खगोलीय यांत्रिकी में भी महत्वपूर्ण योगदान दिया।</p>"}}