{"koch":{"name":"von Koch","bio":"<p><strong>Niels Fabian Helge von Koch</strong> (1870 - 1924) là một nhà toán học người Thụy Điển. Đầu tiên, ông mô tả <em>Bông tuyết Koch</em>, một mảnh nhỏ được đặt theo tên ông và đã chứng minh mối quan hệ giữa giả thuyết Riemann và phân phối số nguyên tố.</p>"},"menger":{"name":"Menger","bio":"<p><strong>Karl Menger</strong> (1902 - 1985) là một nhà toán học người Mỹ gốc Áo. Ông đã nghiên cứu đại số, hình học, kích thước, lý thuyết trò chơi và khoa học xã hội, nhưng ông được nhớ đến nhiều nhất với miếng bọt biển <em>Menger</em>, một fractal ba chiều <em>nổi tiếng</em>.</p>"},"richardson":{"name":"Richardson","bio":"<p><strong>Lewis Fry Richardson</strong> (1881 - 1953) là nhà toán học và vật lý học người Anh. Ông tiên phong trong các kỹ thuật toán học hiện đại về dự báo thời tiết, phát minh ra máy âm thanh để phát hiện các tảng băng trôi và phát triển các phương pháp để giải các hệ phương trình tuyến tính.</p><p>Ông cũng cố gắng tính xác suất hai quốc gia tuyên chiến với nhau, với chiều dài đường biên giới chung của họ. Tuy nhiên, anh ta không thể tìm thấy các phép đo chính xác cho chiều dài của các quốc gia biên giới. Điều này khiến anh nhận ra rằng biên giới và đường bờ biển có nhiều đặc tính của <em>fractals</em>.</p>"},"mandelbrot":{"born":1924,"died":2010,"name":"Mandelbrot","bio":"<p>Nhà toán học <strong>Benoit Mandelbrot</strong> sinh ra ở Ba Lan, lớn lên ở Pháp và cuối cùng chuyển đến Hoa Kỳ. Ông là một trong những người tiên phong của <em>hình học fractal</em>, và đặc biệt quan tâm đến cách thức sự thô bạo của Hồi giáo và vụ hỗn loạn xuất hiện trong thế giới thực (ví dụ: mây hoặc bờ biển).</p><p>Khi làm việc tại IBM, ông đã sử dụng các máy tính đầu tiên để tạo ra các biểu diễn đồ họa của fractals và vào năm 1980, ông đã phát hiện ra bộ Mandelbrot <em>nổi tiếng</em>.</p>","links":[{"title":"Fractals","url":"/course/fractals/introduction"},{"title":"Mandelbrot Set","url":"/course/fractals/mandelbrot"}]},"sierpinski":{"name":"Sierpiński","bio":"<p><strong>Wacław Franciszek Sierpiński</strong> (1882 - 1969) là một nhà toán học người Ba Lan. Ông đã có những khám phá quan trọng trong lý thuyết tập hợp, lý thuyết số, phân tích và cấu trúc liên kết, xuất bản hơn 700 bài báo và 50 cuốn sách. Ông cũng đã phát minh ra nhiều fractals <em>phổ biến</em>, bao gồm cả tam giác <em>Sierpinki</em>, thảm Sierpinki __ và đường cong Sierpinki __.</p><p><em>Số Sierpinki</em> là số tự nhiên lẻ <em>k</em> sao cho <span class=\"math\" data-voice=\"k times 2 to the power of n plus 1\"><mi>k</mi><mo value=\"·\">·</mo><msup><mn>2</mn><mi>n</mi></msup><mo value=\"+\">+</mo><mn>1</mn></span> là tổng hợp cho tất cả các số tự nhiên <em>n</em>. Vấn đề <em>Sierpinki</em> đang cố gắng tìm các số Sierpinki nhỏ nhất. Con số nhỏ nhất được biết đến là 78.557 - nhưng vẫn chưa biết liệu có những cái nhỏ hơn không.</p>"},"wolfram":{"name":"Wolfram","bio":"<p><strong>Stephen Wolfram</strong> (sinh năm 1959) là nhà khoa học máy tính, nhà vật lý và doanh nhân người Mỹ gốc Anh. Ông là người sáng lập và Giám đốc điều hành của <em>Wolfram Research</em>, nơi ông đã phát triển hệ thống máy tính <em>Mathicala</em>, công cụ trả lời <em>Wolfram | Alpha</em> và ngôn ngữ lập trình Wolfram.</p>"},"julia":{"name":"Julia","bio":"<p><strong>Gaston Maurice Julia</strong> (1893 - 1978) là một nhà toán học người Pháp, người đã đồng phát hiện ra <em>Julia set</em>, một mảnh nhỏ sau đó được Benoit Mandelbrot phổ biến.</p>"},"fatou":{"name":"Fatou","bio":"<p><strong>Pierre Joseph Louis Fatou</strong> (1878 - 1929) là nhà toán học và thiên văn học người Pháp. Anh ta đồng phát hiện ra <em>Julia set</em>, và nghịch đảo của nó, bộ Fatou, được đặt theo tên anh ta. Ông cũng có những đóng góp quan trọng cho phân tích và cơ học thiên thể.</p>"}}