{"koch":{"name":"von Koch","bio":"<p>Niels Fabian Helge von Koch (1870 - 1924) era um matemático sueco. Ele primeiro descreveu o <em>floco de neve de Koch</em>, um fractal que recebeu seu nome e comprovou as relações entre a hipótese de Riemann e a distribuição de números primos.</p>"},"menger":{"name":"Menger","bio":"<p>Karl Menger__ (1902 - 1985) foi um matemático austro-americano. Ele pesquisou álgebra, geometria, dimensões, teoria dos jogos e ciências sociais, mas é mais lembrado pela <em>esponja de Menger</em>, um famoso tridimensional <em>fractal</em>.</p>"},"richardson":{"name":"Richardson","bio":"<p><strong>Lewis Fry Richardson</strong> (1881 - 1953) foi um matemático e físico britânico. Ele foi pioneiro em modernas técnicas matemáticas de previsão do tempo, inventou máquinas acústicas para detectar icebergs e desenvolveu métodos para resolver sistemas de equações lineares.</p><p>Ele também tentou calcular a probabilidade de dois países declararem guerra um ao outro, dada a extensão de sua fronteira compartilhada. No entanto, ele não conseguiu encontrar medidas precisas para o comprimento das fronteiras dos países. Isso o levou a perceber que as fronteiras e costas têm muitas propriedades de <em>fractais</em>.</p>"},"sierpinski":{"name":"Sierpiński","bio":"<p>Wacław Franciszek Sierpiński__ (1882 - 1969) era um matemático polonês. Ele fez importantes descobertas em teoria dos conjuntos, teoria dos números, análise e topologias, publicando mais de 700 trabalhos e 50 livros. Ele também inventou muitos <em>fractais populares</em>, incluindo o <em>triângulo de Sierpinski</em>, o <em>tapete de Sierpinski</em> e a <em>curva de Sierpinski</em>.</p><p><em>números de Sierpinski</em> são números naturais ímpares <em>k</em>, de modo que <span class=\"math\" data-voice=\"k times 2 to the power of n plus 1\"><mi>k</mi><mo value=\"·\">·</mo><msup><mn>2</mn><mi>n</mi></msup><mo value=\"+\">+</mo><mn>1</mn></span> é composto por todos os números naturais <em>n</em>. O problema do <em>Sierpinski</em> está tentando encontrar os menores números de Sierpinski. O menor número conhecido é 78.557 - mas ainda não se sabe se existem números menores.</p>"},"wolfram":{"name":"Wolfram","bio":"<p><strong>Stephen Wolfram</strong> (nascido em 1959) é um cientista da computação, físico e empresário britânico-americano. Ele é o fundador e CEO da <em>Wolfram Research</em>, onde desenvolveu o sistema de computação <em>Mathematica</em>, o mecanismo de resposta <em>Wolfram | Alpha</em> e a linguagem de programação Wolfram.</p>"},"julia":{"name":"Julia","bio":"<p>Gaston Maurice Julia__ (1893 - 1978) foi um matemático francês que co-descobriu o conjunto de <em>Julia</em>, um fractal que mais tarde foi popularizado por Benoit Mandelbrot.</p>"},"fatou":{"name":"Fatou","bio":"<p>Pierre Joseph Louis Fatou (1878 - 1929) foi um matemático e astrônomo francês. Ele descobriu o conjunto <em>Julia</em>, e seu inverso, o conjunto Fatou, recebeu o nome dele. Ele também fez importantes contribuições à análise e mecânica celeste.</p>"},"mandelbrot":{"born":1924,"died":2010,"name":"Mandelbrot","bio":"<p>O matemático <strong>Benoit Mandelbrot</strong> nasceu na Polônia, cresceu na França e acabou se mudando para os Estados Unidos. Ele foi um dos pioneiros da <em>geometria fractal</em>, e particularmente interessado em como \"rugosidade\" e \"caos\" aparecem no mundo real (por exemplo, nuvens ou costas).</p><p>Enquanto trabalhava na IBM, ele usou computadores antigos para criar representações gráficas de fractais e, em 1980, descobriu o famoso <em>conjunto Mandelbrot</em>.</p>","links":[{"title":"Fractals","url":"/course/fractals/introduction"},{"title":"Mandelbrot Set","url":"/course/fractals/mandelbrot"}]}}