{"koch":{"name":"von Koch","bio":"<p><strong>Niels Fabian Helge von Koch</strong> (1870 – 1924) was a Swedish mathematician. He first described the <em>Koch snowflake</em>, a fractal which is named after him, and proved relationships between the Riemann hypothesis and the distribution of prime numbers.</p>"},"menger":{"name":"Menger","bio":"<p><strong>Karl Menger</strong> (1902 – 1985) was an Austrian-American mathematician. He researched algebra, geometry, dimensions, game theory and social science, but he is best remembered for the <em>Menger sponge</em>, a famous three-dimensional <em>fractal</em>.</p>"},"richardson":{"name":"Richardson","bio":"<p><strong>Lewis Fry Richardson</strong> (1881 – 1953) was a British mathematician and physicist. He pioneered modern mathematical techniques of weather forecasting, invented acoustic machines to detect icebergs, and developed methods for solving systems of linear equations.</p><p>He also tried to calculate the probability of two countries declaring war on each other, given the length of their shared border. However, he was unable to find accurate measurements for the length of countries’ borders. This led him to realise that borders and coastlines have many properties of <em>fractals</em>.</p>"},"mandelbrot":{"born":1924,"died":2010,"name":"Mandelbrot","full":"Benoit Mandelbrot","bio":"<p>The mathematician <strong>Benoit Mandelbrot</strong> was born in Poland, grew up in France, and eventually moved to the United States. He was one of the pioneers of <em>fractal geometry</em>, and particularly interested in how “roughness” and “chaos” appear in the real world (e.g. clouds or coastlines).</p><p>While working at IBM, he used early computers to create graphical representations of fractals, and in 1980 he discovered the famous <em>Mandelbrot set</em>.</p>","links":[{"title":"Fractals","url":"/course/fractals/introduction"},{"title":"Mandelbrot Set","url":"/course/fractals/mandelbrot"}]},"sierpinski":{"name":"Sierpiński","bio":"<p><strong>Wacław Franciszek Sierpiński</strong> (1882 – 1969) was a Polish mathematician. He made important discoveries in set theory, number theory, analysis and topologies, publishing over 700 papers and 50 books. He also invented many popular <em>fractals</em>, including the <em>Sierpinski triangle</em>, the <em>Sierpinski carpet</em> and the <em>Sierpinski curve</em>.</p><p><em>Sierpinski numbers</em> are odd natural numbers <em>k</em> such that <span class=\"math\" data-voice=\"k times 2 to the power of n plus 1\"><mi>k</mi><mo value=\"·\">·</mo><msup><mn>2</mn><mi>n</mi></msup><mo value=\"+\">+</mo><mn>1</mn></span> is composite for all natural numbers <em>n</em>. The <em>Sierpinski problem</em> is trying to find the smallest Sierpinski numbers. The smallest known such number is 78,557 – but it is still unknown whether there are smaller ones.</p>"},"wolfram":{"name":"Wolfram","bio":"<p><strong>Stephen Wolfram</strong> (born 1959) is a British-American computer scientist, physicist, and businessman. He is the founder and CEO of <em>Wolfram Research</em>, where he developed the <em>Mathematica</em> computing system, the <em>Wolfram|Alpha</em> answer engine, and the Wolfram programming language.</p>"},"julia":{"name":"Julia","bio":"<p><strong>Gaston Maurice Julia</strong> (1893 – 1978) was a French mathematician who co-discovered the <em>Julia set</em>, a fractal that was later popularised by Benoit Mandelbrot.</p>"},"fatou":{"name":"Fatou","bio":"<p><strong>Pierre Joseph Louis Fatou</strong> (1878 – 1929) was a French mathematician and astronomer. He co-discovered the <em>Julia set</em>, and its inverse, the Fatou set, is named after him. He also made important contributions to analysis and celestial mechanics.</p>"}}