{"koch":{"name":"von Koch","bio":"<p>Niels Fabian Helge von Koch__ (1870 - 1924) a fost un matematician suedez. El a descris pentru prima dată <em>Koch fulg de zăpadă</em>, un fractal care poartă numele acestuia și a dovedit relații între ipoteza Riemann și distribuția numerelor prime.</p>"},"menger":{"name":"Menger","bio":"<p><strong>Karl Menger</strong> (1902 - 1985) a fost un matematician austro-american. A cercetat algebra, geometria, dimensiunile, teoria jocurilor și științele sociale, dar este cel mai bine amintit pentru <em>burete Menger</em>, un celebru fractal tridimensional __.</p>"},"richardson":{"name":"Richardson","bio":"<p><strong>Lewis Fry Richardson</strong> (1881 - 1953) a fost un matematician și fizician britanic. El a fost pionier în tehnicile matematice moderne de prognoză meteo, a inventat mașini acustice pentru a detecta aisbergurile și a dezvoltat metode pentru rezolvarea sistemelor de ecuații liniare.</p><p>De asemenea, a încercat să calculeze probabilitatea ca două țări să se războiască una pe cealaltă, având în vedere lungimea frontierei lor comune. Cu toate acestea, nu a putut găsi măsurători exacte pentru lungimea granițelor țărilor. Acest lucru l-a determinat să realizeze că granițele și coastele au multe proprietăți de <em>fractali</em>.</p>"},"mandelbrot":{"born":1924,"died":2010,"name":"Mandelbrot","bio":"<p>Matematicianul <strong>Benoit Mandelbrot</strong> s-a născut în Polonia, a crescut în Franța și, în cele din urmă, s-a mutat în Statele Unite. El a fost unul dintre pionierii <em>geometriei fractale</em> și s-a interesat în special de modul în care „rugozitatea” și „haosul” apar în lumea reală (de ex. Nori sau linii de coastă).</p><p>În timp ce lucra la IBM, a folosit calculatoare timpurii pentru a crea reprezentări grafice ale fractalilor, iar în 1980 a descoperit celebrul <em>set Mandelbrot</em>.</p>","links":[{"title":"Fractals","url":"/course/fractals/introduction"},{"title":"Mandelbrot Set","url":"/course/fractals/mandelbrot"}]},"sierpinski":{"name":"Sierpiński","bio":"<p><strong>Wacław Franciszek Sierpiński</strong> (1882 - 1969) a fost un matematician polonez. A făcut descoperiri importante în teoria seturilor, teoria numerelor, analiza și topologiile, publicând peste 700 de lucrări și 50 de cărți. De asemenea, el a inventat numeroase <em>fractale populare</em>, inclusiv <em>triunghiul Sierpinski</em>, <em>covorul Sierpinski</em> și <em>curba Sierpinski</em>.</p><p><em>Numerele Sierpinski</em> sunt numere naturale ciudate <em>k</em> astfel încât <span class=\"math\" data-voice=\"k times 2 to the power of n plus 1\"><mi>k</mi><mo value=\"·\">·</mo><msup><mn>2</mn><mi>n</mi></msup><mo value=\"+\">+</mo><mn>1</mn></span> este compus pentru toate numerele naturale <em>n</em>. Problema <em>Sierpinski</em> încearcă să găsească cele mai mici numere Sierpinski. Cel mai mic număr cunoscut este 78.557 - dar nu se știe încă dacă există altele mai mici.</p>"},"wolfram":{"name":"Wolfram","bio":"<p><strong>Stephen Wolfram</strong> (n. 1959) este un informatician, fizician și om de afaceri britanic-american. Este fondatorul și CEO al <em>Wolfram Research</em>, unde a dezvoltat sistemul de calcul <em>Mathematica</em>, motorul de răspuns <em>Wolfram | Alpha</em> și limbajul de programare Wolfram.</p>"},"julia":{"name":"Julia","bio":"<p><strong>Gaston Maurice Julia</strong> (1893 - 1978) a fost un matematician francez care a descoperit setul <em>Julia</em>, un fractal care a fost popularizat ulterior de Benoit Mandelbrot.</p>"},"fatou":{"name":"Fatou","bio":"<p><strong>Pierre Joseph Louis Fatou</strong> (1878 - 1929) a fost un matematician și astronom francez. El a descoperit setul <em>Julia</em>, iar inversul său, setul Fatou, poartă numele acestuia. El a adus contribuții importante și la analize și mecanici cerești.</p>"}}