{"koch":{"name":"von Koch","bio":"<p><strong>Niels Fabian Helge von Koch</strong> (1870 - 1924) war ein schwedischer Mathematiker. Er beschrieb zuerst die <em>Koch-Schneeflocke</em>, ein nach ihm benanntes Fraktal, und bewies Beziehungen zwischen der Riemann-Hypothese und der Verteilung von Primzahlen.</p>"},"menger":{"name":"Menger","bio":"<p><strong>Karl Menger</strong> (1902 - 1985) war ein österreichisch-amerikanischer Mathematiker. Er erforschte Algebra, Geometrie, Dimensionen, Spieltheorie und Sozialwissenschaften, aber er ist am besten für den <em>Menger-Schwamm</em> bekannt, ein berühmtes dreidimensionales <em>Fraktal</em>.</p>"},"richardson":{"name":"Richardson","bio":"<p><strong>Lewis Fry Richardson</strong> (1881 - 1953) war ein britischer Mathematiker und Physiker. Er war Pionier moderner mathematischer Techniken der Wettervorhersage, erfand akustische Maschinen zur Erkennung von Eisbergen und entwickelte Methoden zur Lösung linearer Gleichungssysteme.</p><p>Er versuchte auch, die Wahrscheinlichkeit zu berechnen, mit der zwei Länder sich gegenseitig den Krieg erklären, angesichts der Länge ihrer gemeinsamen Grenze. Er konnte jedoch keine genauen Messungen für die Länge der Ländergrenzen finden. Dies führte ihn zu der Erkenntnis, dass Grenzen und Küsten viele Eigenschaften von <em>Fraktalen</em> haben.</p>"},"mandelbrot":{"born":1924,"died":2010,"name":"Mandelbrot","bio":"<p>Der Mathematiker <strong>Benoit Mandelbrot</strong> wurde in Polen geboren, wuchs in Frankreich auf und zog schließlich in die USA. Er war einer der Pioniere der <em>fraktalen Geometrie</em> und besonders interessiert daran, wie „Rauheit“ und „Chaos“ in der realen Welt (z. B. Wolken oder Küsten) auftreten.</p><p>Während seiner Arbeit bei IBM verwendete er frühe Computer, um grafische Darstellungen von Fraktalen zu erstellen, und 1980 entdeckte er das berühmte <em>Mandelbrot-Set</em>.</p>","links":[{"title":"Fractals","url":"/course/fractals/introduction"},{"title":"Mandelbrot Set","url":"/course/fractals/mandelbrot"}]},"sierpinski":{"name":"Sierpiński","bio":"<p><strong>Wacław Franciszek Sierpiński</strong> (1882 - 1969) war ein polnischer Mathematiker. Er machte wichtige Entdeckungen in Mengenlehre, Zahlentheorie, Analyse und Topologien und veröffentlichte über 700 Artikel und 50 Bücher. Er erfand auch viele beliebte <em>Fraktale</em>, darunter das <em>Sierpinski-Dreieck</em>, den <em>Sierpinski-Teppich</em> und die <em>Sierpinski-Kurve</em>.</p><p><em>Sierpinski-Zahlen</em> sind ungerade natürliche Zahlen <em>k</em>, so dass <span class=\"math\" data-voice=\"k times 2 to the power of n plus 1\"><mi>k</mi><mo value=\"·\">·</mo><msup><mn>2</mn><mi>n</mi></msup><mo value=\"+\">+</mo><mn>1</mn></span> für alle natürlichen Zahlen <em>n</em> zusammengesetzt ist. Das <em>Sierpinski-Problem</em> versucht, die kleinsten Sierpinski-Zahlen zu finden. Die kleinste bekannte Zahl ist 78.557 - es ist jedoch noch nicht bekannt, ob es kleinere gibt.</p>"},"wolfram":{"name":"Wolfram","bio":"<p><strong>Stephen Wolfram</strong> (geb. 1959) ist ein britisch-amerikanischer Informatiker, Physiker und Geschäftsmann. Er ist der Gründer und CEO von <em>Wolfram Research</em>, wo er das Computersystem <em>Mathematica</em>, die Antwortmaschine <em>Wolfram | Alpha</em> und die Programmiersprache Wolfram entwickelte.</p>"},"julia":{"name":"Julia","bio":"<p><strong>Gaston Maurice Julia</strong> (1893 - 1978) war ein französischer Mathematiker, der das <em>Julia-Set</em> mitentdeckte, ein Fraktal, das später von Benoit Mandelbrot populär gemacht wurde.</p>"},"fatou":{"name":"Fatou","bio":"<p><strong>Pierre Joseph Louis Fatou</strong> (1878 - 1929) war ein französischer Mathematiker und Astronom. Er hat das <em>Julia-Set</em> mitentdeckt, und seine Umkehrung, das Fatou-Set, ist nach ihm benannt. Er leistete auch wichtige Beiträge zur Analyse und Himmelsmechanik.</p>"}}