{"koch":{"name":"von Koch","bio":"<p><strong>Niels Fabian Helge von Koch</strong> (1870 - 1924) était un mathématicien suédois. Il a d'abord décrit le <em>flocon de neige de Koch</em>, une fractale qui porte son nom, et a prouvé les relations entre l'hypothèse de Riemann et la distribution des nombres premiers.</p>"},"menger":{"name":"Menger","bio":"<p><strong>Karl Menger</strong> (1902 - 1985) était un mathématicien austro-américain. Il a étudié l'algèbre, la géométrie, les dimensions, la théorie des jeux et les sciences sociales, mais il est surtout connu pour la <em>éponge de Menger</em>, une célèbre fractale tridimensionnelle __.</p>"},"richardson":{"name":"Richardson","bio":"<p><strong>Lewis Fry Richardson</strong> (1881 - 1953) était un mathématicien et physicien britannique. Il a lancé des techniques mathématiques modernes de prévision météorologique, inventé des machines acoustiques pour détecter les icebergs et développé des méthodes pour résoudre des systèmes d'équations linéaires.</p><p>Il a également tenté de calculer la probabilité que deux pays se déclarent la guerre, compte tenu de la longueur de leur frontière commune. Cependant, il n'a pas été en mesure de trouver des mesures précises de la longueur des frontières des pays. Cela l'a amené à réaliser que les frontières et les côtes ont de nombreuses propriétés des <em>fractales</em>.</p>"},"mandelbrot":{"born":1924,"died":2010,"name":"Mandelbrot","bio":"<p>Le mathématicien <strong>Benoit Mandelbrot</strong> est né en Pologne, a grandi en France et a finalement déménagé aux États-Unis. Il a été l'un des pionniers de la <em>géométrie fractale</em> et s'est particulièrement intéressé à la façon dont la \"rugosité\" et le \"chaos\" apparaissent dans le monde réel (par exemple, les nuages ou les côtes).</p><p>Tout en travaillant chez IBM, il a utilisé les premiers ordinateurs pour créer des représentations graphiques des fractales et en 1980, il a découvert le célèbre <em>ensemble de Mandelbrot</em>.</p>","links":[{"title":"Fractals","url":"/course/fractals/introduction"},{"title":"Mandelbrot Set","url":"/course/fractals/mandelbrot"}]},"sierpinski":{"name":"Sierpiński","bio":"<p><strong>Wacław Franciszek Sierpiński</strong> (1882 - 1969) était un mathématicien polonais. Il a fait d'importantes découvertes dans la théorie des ensembles, la théorie des nombres, l'analyse et les topologies, publiant plus de 700 articles et 50 livres. Il a également inventé de nombreuses <em>fractales</em> populaires, dont le <em>triangle de Sierpinski</em>, le <em>tapis de Sierpinski</em> et la <em>courbe de Sierpinski</em>.</p><p><em>Les nombres de Sierpinski</em> sont des nombres naturels impairs <em>k</em> tels que <span class=\"math\" data-voice=\"k times 2 to the power of n plus 1\"><mi>k</mi><mo value=\"·\">·</mo><msup><mn>2</mn><mi>n</mi></msup><mo value=\"+\">+</mo><mn>1</mn></span> est composite pour tous les nombres naturels <em>n</em>. Le <em>problème Sierpinski</em> tente de trouver les plus petits nombres Sierpinski. Le plus petit nombre connu est 78 557 - mais on ne sait pas encore s'il y en a de plus petits.</p>"},"wolfram":{"name":"Wolfram","bio":"<p><strong>Stephen Wolfram</strong> (né en 1959) est un informaticien, physicien et homme d'affaires anglo-américain. Il est le fondateur et PDG de <em>Wolfram Research</em>, où il a développé le système informatique <em>Mathematica</em>, le moteur de réponse <em>Wolfram | Alpha</em> et le langage de programmation Wolfram.</p>"},"julia":{"name":"Julia","bio":"<p><strong>Gaston Maurice Julia</strong> (1893 - 1978) était un mathématicien français qui a co-découvert le <em>ensemble Julia</em>, une fractale qui a ensuite été popularisée par Benoit Mandelbrot.</p>"},"fatou":{"name":"Fatou","bio":"<p><strong>Pierre Joseph Louis Fatou</strong> (1878 - 1929) était un mathématicien et astronome français. Il a co-découvert le <em>set Julia</em>, et son inverse, le set Fatou, porte son nom. Il a également apporté d'importantes contributions à l'analyse et à la mécanique céleste.</p>"}}