{"koch":{"name":"von Koch","bio":"<p><strong>Niels Fabian Helge von Koch</strong> (1870. - 1924.) bio je švedski matematičar. Prvo je opisao <em>Kochovu pahuljicu</em>, fraktal koji je po njemu nazvan, te dokazao odnose između Riemannove hipoteze i raspodjele pravih brojeva.</p>"},"menger":{"name":"Menger","bio":"<p><strong>Karl Menger</strong> (1902. - 1985.) bio je austrijsko-američki matematičar. Istražio je algebru, geometriju, dimenzije, teoriju igara i društvene znanosti, ali najbolje je pamti po <em>Menger spužvi</em>, čuvenoj trodimenzionalnoj <em>fraktalnoj</em>.</p>"},"richardson":{"name":"Richardson","bio":"<p><strong>Lewis Fry Richardson</strong> (1881. - 1953.) bio je britanski matematičar i fizičar. Uvodio je moderne matematičke tehnike prognoziranja vremena, izumio akustičke strojeve za otkrivanje ledenih brijega i razvio metode za rješavanje sustava linearnih jednadžbi.</p><p>Također je pokušao izračunati vjerojatnost da će dvije zemlje objaviti rat jedna drugoj, s obzirom na duljinu njihove zajedničke granice. Međutim, nije mogao pronaći točna mjerenja za duljinu granica zemalja. To ga je navelo da shvati da granice i obale imaju mnoga svojstva <em>fraktala</em>.</p>"},"mandelbrot":{"born":1924,"died":2010,"name":"Mandelbrot","bio":"<p>Matematičar <strong>Benoit Mandelbrot</strong> rođen je u Poljskoj, odrastao je u Francuskoj i na kraju se preselio u Sjedinjene Države. Bio je jedan od pionira <em>fraktalne geometrije</em>, a posebno ga je zanimalo kako \"grubost\" i \"kaos\" izgledaju u stvarnom svijetu (npr. Oblaci ili obale).</p><p>Za vrijeme rada u IBM-u koristio je rana računala za izradu grafičkih prikaza fraktala, a 1980. otkrio je poznati <em>Mandelbrot set</em>.</p>","links":[{"title":"Fractals","url":"/course/fractals/introduction"},{"title":"Mandelbrot Set","url":"/course/fractals/mandelbrot"}]},"sierpinski":{"name":"Sierpiński","bio":"<p><strong>Wacław Franciszek Sierpiński</strong> (1882. - 1969.) bio je poljski matematičar. Ostvario je važna otkrića u teoriji skupa, teoriji brojeva, analizi i topologijama, objavio preko 700 radova i 50 knjiga. Također je izumio mnoge popularne <em>fraktale</em>, uključujući <em>Sierpinski trokut</em>, <em>Sierpinski tepih</em> i <em>Sierpinski krivulju</em>.</p><p><em>Sierpinski brojevi</em> su neparni prirodni brojevi <em>k</em> takvi da je <span class=\"math\" data-voice=\"k times 2 to the power of n plus 1\"><mi>k</mi><mo value=\"·\">·</mo><msup><mn>2</mn><mi>n</mi></msup><mo value=\"+\">+</mo><mn>1</mn></span> složen za sve prirodne brojeve <em>n</em>. <em>Sierpinski problem</em> pokušava pronaći najmanje Sierpinskih brojeva. Najmanji poznati takav broj je 78.557 - ali još uvijek nije poznato postoje li manji.</p>"},"wolfram":{"name":"Wolfram","bio":"<p><strong>Stephen Wolfram</strong> (rođen 1959.) je britansko-američki računalni znanstvenik, fizičar i poslovni čovjek. Osnivač je i izvršni direktor <em>Wolfram Research</em>, gdje je razvio računalni sustav <em>Mathematica</em>, <em>Wolfram | Alpha</em> odgovorni mehanizam i programski jezik Wolfram.</p>"},"julia":{"name":"Julia","bio":"<p><strong>Gaston Maurice Julia</strong> (1893. - 1978.) bio je francuski matematičar koji je zajedno otkrio <em>Julia set</em>, fraktal koji je kasnije popularizirao Benoit Mandelbrot.</p>"},"fatou":{"name":"Fatou","bio":"<p><strong>Pierre Joseph Louis Fatou</strong> (1878. - 1929.) bio je francuski matematičar i astronom. Otkrio je <em>set Julia</em>, a njegov obrnuto, skup Fatou, dobio je ime po njemu. Dao je važan doprinos analizi i nebeskoj mehanici.</p>"}}