{"koch":{"name":"von Koch","bio":"<p><strong>Нильс Фабиан Хельге фон Кох</strong> (1870 - 1924) был шведским математиком. Сначала он описал <em>снежинку Коха</em>, фрактал, названный в его честь, и доказал связь между гипотезой Римана и распределением простых чисел.</p>"},"menger":{"name":"Menger","bio":"<p><strong>Карл Менгер</strong> (1902 - 1985) был австрийским математиком. Он исследовал алгебру, геометрию, измерения, теорию игр и социальные науки, но его лучше всего помнят по <em>губке Менгера</em>, знаменитому трехмерному <em>фракталу</em>.</p>"},"richardson":{"name":"Richardson","bio":"<p><strong>Льюис Фрай Ричардсон</strong> (1881 - 1953) был британским математиком и физиком. Он был пионером современных математических методов прогнозирования погоды, изобрел акустические машины для обнаружения айсбергов и разработал методы решения систем линейных уравнений.</p><p>Он также попытался рассчитать вероятность того, что две страны объявят войну друг другу, учитывая протяженность их общей границы. Однако он не смог найти точных измерений для длины границ стран. Это привело его к пониманию того, что границы и береговые линии обладают многими свойствами <em>фракталов</em>.</p>"},"mandelbrot":{"born":1924,"died":2010,"name":"Mandelbrot","bio":"<p>Математик <strong>Бенуа Мандельброт</strong> родился в Польше, вырос во Франции и в конце концов переехал в Соединенные Штаты. Он был одним из пионеров <em>фрактальной геометрии</em> и особенно интересовался тем, как «шероховатость» и «хаос» проявляются в реальном мире (например, облака или береговые линии).</p><p>Работая в IBM, он использовал ранние компьютеры для создания графических представлений о фракталах, а в 1980 году он открыл знаменитое <em>множество Мандельброта</em>.</p>","links":[{"title":"Фракталы","url":"/course/fractals/introduction"},{"title":"Множество Мандельброта","url":"/course/fractals/mandelbrot"}]},"sierpinski":{"name":"Sierpiński","bio":"<p><strong>Вацлав Франциск Серпинский</strong> (1882 - 1969) был польским математиком. Он сделал важные открытия в области теории множеств, теории чисел, анализа и топологии, опубликовал более 700 статей и 50 книг. Он также изобрел множество популярных <em>фракталов</em>, в том числе <em>треугольник Серпинского</em>, <em>ковёр Серпинского</em> и <em>кривую Серпинского</em>.</p><p><em>Числа Серпинского</em> являются нечетными натуральными числами <em>k</em>, так что <span class=\"math\" data-voice=\"k times 2 to the power of n plus 1\"><mi>k</mi><mo value=\"·\">·</mo><msup><mn>2</mn><mi>n</mi></msup><mo value=\"+\">+</mo><mn>1</mn></span> является составным для всех натуральных чисел <em>n</em>. <em>Проблема Серпинского</em> пытается найти минимальное число Серпинского. Наименьшее известное такое число составляет 78 557 - но пока неизвестно существуют ли меньшие.</p>"},"wolfram":{"name":"Wolfram","bio":"<p><strong>Стивен Вольфрам</strong> (род. 1959) - британский ученый-компьютерщик, физик и бизнесмен. Он является основателем и генеральным директором компании <em>Wolfram Research</em>, где он разработал <em>вычислительную систему Mathematica</em>, механизм ответов <em>WolframAlpha</em> и язык программирования Wolfram.</p>"},"julia":{"name":"Julia","bio":"<p><strong>Гастон Морис Жюлия</strong> (1893 - 1978) был французским математиком, который совместно открыл <em>множество Жюлия</em>, фрактал, который позже популяризировал Бенуа Мандельброт.</p>"},"fatou":{"name":"Fatou","bio":"<p><strong>Пьер Жозе Луи Фату</strong> (1878 - 1929) был французским математиком и астрономом. Он совместно обнаружил <em>множество Джулии</em>, и его обратное имя, множество Фату, названо в его честь. Он также внес важный вклад в анализ и небесную механику.</p>"}}