{"koch":{"name":"von Koch","bio":"<p><strong>Niels Fabian Helge von Koch</strong> (1870-1924) İsveçli bir matematikçiydi. İlk önce onun adını taşıyan bir fraktal olan <em>Koch kar tanesi</em> 'i tanımladı ve Riemann hipotezi ile asal sayıların dağılımı arasındaki ilişkileri kanıtladı.</p>"},"menger":{"name":"Menger","bio":"<p><strong>Karl Menger</strong> (1902-1985) Avusturyalı bir Amerikan matematikçisiydi. Cebir, geometri, boyutlar, oyun teorisi ve sosyal bilimleri araştırdı, ancak en iyi ünlü üç boyutlu <em>fraktal</em> olan <em>Menger süngeri</em> için hatırlandı.</p>"},"richardson":{"name":"Richardson","bio":"<p><strong>Lewis Fry Richardson</strong> (1881 - 1953) İngiliz bir matematikçi ve fizikçiydi. Hava tahmini için modern matematiksel tekniklere öncülük etti, buzdağlarını tespit etmek için akustik makineleri icat etti ve doğrusal denklem sistemlerini çözmek için yöntemler geliştirdi.</p><p>Ayrıca ortak sınırlarının uzunluğu göz önüne alındığında, iki ülkenin birbirine savaş ilan etme olasılığını hesaplamaya çalıştı. Ancak, ülke sınırlarının uzunluğu için doğru ölçümler bulamadı. Bu, sınırların ve sahil şeridinin <em>fraktalların</em> birçok özelliğine sahip olduğunu fark etmesine yol açtı.</p>"},"mandelbrot":{"born":1924,"died":2010,"name":"Mandelbrot","bio":"<p>Matematikçi <strong>Benoît Mandelbrot</strong> Polonya’da doğmuş, Fransa’da büyümüş ve sonunda Amerika Birleşik Devletleri’ne taşınmıştır. _Fraktal geometri_nin öncülerindendir ve özellikle “kaos”un gerçek dünyada nasıl oluştuğuyla ilgilenmiştir(örneğin bulutlar ya da deniz kıyıları).</p><p>IBM’de çalışırken, fraktalların görsellerini yaratmak için ilk bilgisayarları kullanmıştır ve 1980 yılında ünlü _Mandelbrot kümesi_ni keşfetmiştir.</p>","links":[{"title":"Fractals","url":"/course/fractals/introduction"},{"title":"Mandelbrot Set","url":"/course/fractals/mandelbrot"}]},"sierpinski":{"name":"Sierpiński","bio":"<p><strong>Wacław Franciszek Sierpiński</strong> (1882 - 1969), Polonyalı bir matematikçiydi. Küme teorisi, sayı teorisi, analiz ve topolojilerde önemli keşifler yaptı, 700'den fazla makale ve 50 kitap yayınladı. Ayrıca <em>Sierpinski üçgeni</em>, <em>Sierpinski halısı</em> ve <em>Sierpinski eğrisi</em> dahil olmak üzere birçok popüler <em>fraktal</em> icat etti.</p><p><em>Sierpinski sayıları</em>, <span class=\"math\" data-voice=\"k times 2 to the power of n plus 1\"><mi>k</mi><mo value=\"·\">·</mo><msup><mn>2</mn><mi>n</mi></msup><mo value=\"+\">+</mo><mn>1</mn></span> tüm <em>n</em> tüm doğal sayılar için bileşik olacak şekilde tek doğal sayılardır <em>k</em>. <em>Sierpinski sorunu</em> en küçük Sierpinski sayılarını bulmaya çalışıyor. Bilinen en küçük sayı 78.557'dir - ancak daha küçük olanların olup olmadığı hala bilinmemektedir.</p>"},"wolfram":{"name":"Wolfram","bio":"<p><strong>Stephen Wolfram</strong> (d. 1959) İngiliz-Amerikalı bir bilgisayar bilimcisi, fizikçi ve iş adamı. <em>Mathematica</em> bilgi işlem sistemini, <em>Wolfram | Alpha</em> yanıtlama motorunu ve Wolfram programlama dilini geliştirdiği <em>Wolfram Research</em> 'in kurucusu ve CEO'sudur.</p>"},"julia":{"name":"Julia","bio":"<p><strong>Gaston Maurice Julia</strong> (1893 - 1978), daha sonra Benoit Mandelbrot tarafından popüler hale getirilen bir fraktal olan <em>Julia setini</em> birlikte keşfeden bir Fransız matematikçiydi.</p>"},"fatou":{"name":"Fatou","bio":"<p><strong>Pierre Joseph Louis Fatou</strong> (1878 - 1929) Fransız bir matematikçi ve astronomdu. <em>Julia setini</em> birlikte keşfetti ve tersi Fatou setinin adını onun aldı. Analiz ve gök mekaniğine de önemli katkılarda bulundu.</p>"}}