{"koch":{"name":"von Koch","bio":"<p><strong>Niels Fabian Helge von Koch</strong> (1870 - 1924) İsveç riyaziyyatçısı idi. Əvvəlcə onun adını daşıyan bir fraktal olan <em>Koç qar uçqunu</em> təsvir etdi və Riemann hipotezi və baş ədədlərin paylanması arasındakı əlaqələri sübut etdi.</p>"},"menger":{"name":"Menger","bio":"<p><strong>Karl Menger</strong> (1902 - 1985) Avstriya-Amerika riyaziyyatçısı idi. Cəbr, həndəsə, ölçülər, oyun nəzəriyyəsi və sosial elmləri araşdırdı, ancaq <em>Menger süngəri</em>, məşhur üç ölçülü <em>fraktal</em> üçün ən yaxşı xatırlanır.</p>"},"richardson":{"name":"Richardson","bio":"<p><strong>Lewis Fry Richardson</strong> (1881 - 1953) İngilis riyaziyyatçısı və fiziki idi. O, hava proqnozunun müasir riyazi texnikalarını kəşf etdi, aysberqləri aşkar etmək üçün akustik maşınlar icad etdi və xətti tənliklər sisteminin həlli üsullarını inkişaf etdirdi.</p><p>Ayrıca, iki ölkənin ortaq sərhədlərinin uzunluğunu nəzərə alaraq bir-birlərinə müharibə elan etmə ehtimalını da hesablamağa çalışdı. Ancaq ölkələrin sərhədlərinin uzunluğu üçün dəqiq ölçü tapa bilmədi. Bu, sərhədlərin və sahil xətlərinin <em>fraktallarının</em> çoxlu xüsusiyyətlərinə sahib olduğunu başa düşməyə səbəb oldu.</p>"},"mandelbrot":{"born":1924,"died":2010,"name":"Mandelbrot","bio":"<p>Riyaziyyatçı <strong>Benoit Mandelbrot</strong> Polşada anadan olub, Fransada böyüyüb və nəticədə ABŞ-a köçüb. O, <em>fraktal həndəsə</em> -nin öncüllərindən biri idi və xüsusilə \"kobudluq\" və \"xaos\" un həqiqi aləmdə necə görünməsi ilə maraqlanırdı (məs. Buludlar və ya sahil zolaqları).</p><p>IBM-də işləyərkən fraktalların qrafik təsvirlərini yaratmaq üçün erkən kompüterlərdən istifadə etdi və 1980-ci ildə məşhur <em>Mandelbrot</em> dəstini kəşf etdi.</p>","links":[{"title":"Fractals","url":"/course/fractals/introduction"},{"title":"Mandelbrot Set","url":"/course/fractals/mandelbrot"}]},"sierpinski":{"name":"Sierpiński","bio":"<p><strong>Wacław Franciszek Sierpiński</strong> (1882 - 1969) Polşa riyaziyyatçısı idi. Müəyyən edilmiş nəzəriyyə, say nəzəriyyəsi, təhlil və topologiyalarda mühüm kəşflər etdi, 700-dən çox sənəd və 50 kitab nəşr etdi. Ayrıca <em>Sierpinski üçbucağı</em>, <em>Sierpinski xalçası</em> və <em>Sierpinski əyri</em> daxil olmaqla bir çox məşhur _fraktalları icad etdi.</p><p><em>Sierpinski nömrələri</em>, tək ədədlərdir <em>k</em>, belə ki, <span class=\"math\" data-voice=\"k times 2 to the power of n plus 1\"><mi>k</mi><mo value=\"·\">·</mo><msup><mn>2</mn><mi>n</mi></msup><mo value=\"+\">+</mo><mn>1</mn></span> bütün_ {_ bütün natural ədədlər üçün kompozitdir. <em>Sierpinski problemi</em> ən kiçik Sierpinski nömrələrini tapmağa çalışır. Ən kiçik məlum olan sayı 78,557-dir, lakin daha kiçik olanların olub-olmadığı hələ bilinmir.</p>"},"wolfram":{"name":"Wolfram","bio":"<p><strong>Stiven Wolfram</strong> (1959-cu il təvəllüdlü) - İngilis-Amerika kompüter alimi, fizik və iş adamı. <em>Riyaziyyat</em> hesablama sistemini, <em>Wolfram | Alpha</em> cavab mühərrikini və Wolfram proqramlaşdırma dilini hazırladığı <em>Wolfram Araşdırma</em> -nin yaradıcısı və baş direktorudur.</p>"},"julia":{"name":"Julia","bio":"<p><strong>Gaston Maurice Julia</strong> (1893 - 1978) sonradan Benoit Mandelbrot tərəfindən populyarlaşan fraktal <em>Julia</em> dəstini birlikdə kəşf edən Fransız riyaziyyatçısı idi.</p>"},"fatou":{"name":"Fatou","bio":"<p><strong>Pierre Joseph Louis Fatou</strong> (1878 - 1929) fransız riyaziyyatçısı və astronomu idi. O, <em>Culiya</em> dəstini birlikdə kəşf etdi və onun tərsinə, Fatou dəsti onun adını daşıyır. Təhlil və göy mexanikasına da mühüm töhfələr verdi.</p>"}}