{"koch":{"name":"von Koch","bio":"<p><strong>Niels Fabian Helge von Koch</strong> (1870 - 1924) var en svensk matematiker. Han beskrev först <em>Koch snöflinga</em>, en fraktal som är uppkallad efter honom och bevisade förhållanden mellan Riemann-hypotesen och fördelningen av primtal.</p>"},"menger":{"name":"Menger","bio":"<p><strong>Karl Menger</strong> (1902 - 1985) var en österrikisk-amerikansk matematiker. Han forskade på algebra, geometri, dimensioner, spelteori och samhällsvetenskap, men han minns bäst för <em>Menger-svampen</em>, en berömd tredimensionell <em>fraktal</em>.</p>"},"richardson":{"name":"Richardson","bio":"<p><strong>Lewis Fry Richardson</strong> (1881 - 1953) var en brittisk matematiker och fysiker. Han var banbrytande på moderna matematiska tekniker för väderprognoser, uppfann akustiska maskiner för att upptäcka isberg och utvecklade metoder för att lösa system med linjära ekvationer.</p><p>Han försökte också beräkna sannolikheten för att två länder förklarar krig mot varandra, med tanke på deras delade gräns. Men han kunde inte hitta exakta mätningar för landets gränser. Detta fick honom att inse att gränser och kustlinjer har många egenskaper hos <em>fraktaler</em>.</p>"},"mandelbrot":{"born":1924,"died":2010,"name":"Mandelbrot","bio":"<p>Matematikern <strong>Benoit Mandelbrot</strong> föddes i Polen, växte upp i Frankrike och flyttade så småningom till USA. Han var en av pionjärerna inom <em>fraktal geometri</em>, och särskilt intresserad av hur \"grovhet\" och \"kaos\" framträder i den verkliga världen (t.ex. moln eller kustlinjer).</p><p>När han arbetade hos IBM använde han tidiga datorer för att skapa grafiska framställningar av fraktaler, och 1980 upptäckte han den berömda <em>Mandelbrot-uppsättningen</em>.</p>","links":[{"title":"Fractals","url":"/course/fractals/introduction"},{"title":"Mandelbrot Set","url":"/course/fractals/mandelbrot"}]},"sierpinski":{"name":"Sierpiński","bio":"<p><strong>Wacław Franciszek Sierpiński</strong> (1882 - 1969) var en polsk matematiker. Han gjorde viktiga upptäckter inom setteori, talteori, analys och topologier och publicerade över 700 artiklar och 50 böcker. Han uppfann också många populära <em>fraktaler</em>, inklusive <em>Sierpinski-triangeln</em>, <em>Sierpinski-mattan</em> och <em>Sierpinski-kurvan</em>.</p><p><em>Sierpinski-nummer</em> är udda naturliga siffror <em>k</em> så att <span class=\"math\" data-voice=\"k times 2 to the power of n plus 1\"><mi>k</mi><mo value=\"·\">·</mo><msup><mn>2</mn><mi>n</mi></msup><mo value=\"+\">+</mo><mn>1</mn></span> är sammansatt för alla naturliga siffror <em>n</em>. <em>Sierpinski-problemet</em> försöker hitta de minsta Sierpinski-siffrorna. Det minsta kända sådana antalet är 78.557 - men det är fortfarande okänt om det finns mindre.</p>"},"wolfram":{"name":"Wolfram","bio":"<p><strong>Stephen Wolfram</strong> (född 1959) är en brittisk-amerikansk datavetare, fysiker och affärsman. Han är grundaren och VD för <em>Wolfram Research</em>, där han utvecklade <em>Mathematica</em> datorsystemet, <em>Wolfram | Alpha</em> svarsmotorn och Wolfram-programmeringsspråket.</p>"},"julia":{"name":"Julia","bio":"<p><strong>Gaston Maurice Julia</strong> (1893 - 1978) var en fransk matematiker som tillsammans upptäckte <em>Julia-uppsättningen</em>, en fraktal som senare blev populariserad av Benoit Mandelbrot.</p>"},"fatou":{"name":"Fatou","bio":"<p><strong>Pierre Joseph Louis Fatou</strong> (1878 - 1929) var en fransk matematiker och astronom. Han upptäckte <em>Julia-uppsättningen</em> och dess omvända, Fatou-uppsättningen, är uppkallad efter honom. Han gav också viktiga bidrag till analys och himmelmekanik.</p>"}}