{"koch":{"name":"von Koch","bio":"<p><strong>Niels Fabian Helge von Koch</strong> (1870-1924) fue un matemático sueco. Primero describió el <em>copo de nieve de Koch</em>, un fractal que lleva su nombre, y demostró relaciones entre la hipótesis de Riemann y la distribución de números primos.</p>"},"menger":{"name":"Menger","bio":"<p><strong>Karl Menger</strong> (1902 - 1985) fue un matemático austriaco-estadounidense. Investigó álgebra, geometría, dimensiones, teoría de juegos y ciencias sociales, pero es mejor recordado por la <em>esponja Menger</em>, un famoso fractal tridimensional __.</p>"},"richardson":{"name":"Richardson","bio":"<p><strong>Lewis Fry Richardson</strong> (1881 - 1953) fue un matemático y físico británico. Fue pionero en las técnicas matemáticas modernas de pronóstico del tiempo, inventó máquinas acústicas para detectar icebergs y desarrolló métodos para resolver sistemas de ecuaciones lineales.</p><p>También trató de calcular la probabilidad de que dos países declaren la guerra entre sí, dada la longitud de su frontera compartida. Sin embargo, no pudo encontrar medidas precisas para la longitud de las fronteras de los países. Esto lo llevó a darse cuenta de que las fronteras y las costas tienen muchas propiedades de <em>fractales</em>.</p>"},"mandelbrot":{"born":1924,"died":2010,"name":"Mandelbrot","bio":"<p>El matemático <strong>Benoit Mandelbrot</strong> nació en Polonia, creció en Francia y finalmente se mudó a los Estados Unidos. Fue uno de los pioneros de <em>geometría fractal</em>, y particularmente interesado en cómo aparecen la \"aspereza\" y el \"caos\" en el mundo real (por ejemplo, nubes o costas).</p><p>Mientras trabajaba en IBM, utilizó las primeras computadoras para crear representaciones gráficas de fractales, y en 1980 descubrió el famoso <em>conjunto de Mandelbrot</em>.</p>","links":[{"title":"Fractals","url":"/course/fractals/introduction"},{"title":"Mandelbrot Set","url":"/course/fractals/mandelbrot"}]},"sierpinski":{"name":"Sierpiński","bio":"<p><strong>Wacław Franciszek Sierpiński</strong> (1882 - 1969) fue un matemático polaco. Hizo importantes descubrimientos en teoría de conjuntos, teoría de números, análisis y topologías, publicando más de 700 artículos y 50 libros. También inventó muchos <em>fractales</em> populares, incluidos el <em>triángulo de Sierpinski</em>, la <em>alfombra de Sierpinski</em> y la <em>curva de Sierpinski</em>.</p><p><em>Los números de Sierpinski</em> son números naturales impares <em>k</em> de modo que <span class=\"math\" data-voice=\"k times 2 to the power of n plus 1\"><mi>k</mi><mo value=\"·\">·</mo><msup><mn>2</mn><mi>n</mi></msup><mo value=\"+\">+</mo><mn>1</mn></span> es compuesto para todos los números naturales <em>n</em>. El <em>problema de Sierpinski</em> está tratando de encontrar los números más pequeños de Sierpinski. El número más pequeño conocido es 78,557, pero aún se desconoce si hay otros más pequeños.</p>"},"wolfram":{"name":"Wolfram","bio":"<p><strong>Stephen Wolfram</strong> (nacido en 1959) es un informático, físico y empresario británico-estadounidense. Es el fundador y CEO de <em>Wolfram Research</em>, donde desarrolló el sistema informático <em>Mathematica</em>, el motor de respuesta <em>Wolfram | Alpha</em> y el lenguaje de programación Wolfram.</p>"},"julia":{"name":"Julia","bio":"<p><strong>Gaston Maurice Julia</strong> (1893 - 1978) fue un matemático francés que descubrió conjuntamente el <em>conjunto de Julia</em>, un fractal que luego fue popularizado por Benoit Mandelbrot.</p>"},"fatou":{"name":"Fatou","bio":"<p><strong>Pierre Joseph Louis Fatou</strong> (1878 - 1929) fue un matemático y astrónomo francés. Él co-descubrió el <em>conjunto de Julia</em>, y su inverso, el conjunto de Fatou, lleva su nombre. También hizo importantes contribuciones al análisis y la mecánica celeste.</p>"}}