{"sections":[{"id":"prisoners","title":"The Prisoners’ Dilemma","status":"dev","preview":"/world/Game_Theory#prisoners-dilemma","background":"","goals":33,"duration":60,"steps":["step-0","step-1","step-2","step-3","step-4","step-5","step-6","step-7","step-8","step-9"]},{"id":"cards-coins-dice","title":"Cards, Coins and Dice","status":"dev","background":"","goals":0,"duration":5,"steps":["step-10"]},{"id":"nim","title":"The Winning Move","status":"dev","preview":"/world/Game_Theory","background":"","goals":2,"duration":35,"steps":["step-11","step-12","step-13","step-14","step-15","step-16","step-17","step-18","step-19"]},{"id":"random-walks","title":"Random Walks","status":"dev","background":"","goals":0,"duration":5,"steps":["step-20"]}],"steps":[{"section":"prisoners","sectionPreview":"/world/Game_Theory#prisoners-dilemma","sectionStatus":"dev","id":"step-0","goals":[],"html":"<x-step id=\"step-0\" goals=\"\"><p><span class=\"sentence\">In life, we often have to make decisions about what to do - and sometimes, the consequences of those decisions affect other people around us. </span><span class=\"sentence\">For example, if you decide to take the last two biscuits from the plate instead of one, it’ll mean there aren’t any left for others. </span><span class=\"sentence\">But if you leave both biscuits there and go back for one later, other people may have taken them and you’ll miss out!</span></p><p><span class=\"sentence\"><strong>Game Theory</strong> is the area of mathematics where we study how people’s behaviour and decisions interact - it allows you to consider what the best decision might be, given what other people are likely to choose - and consider what other people’s motivations are in their decision-making. </span><span class=\"sentence\">Game theory often involves making assumptions about how people will behave - for example, that they’ll do whatever will result in the best outcome for them personally - and it can be applied to situations from world politics and economics all the way down to how many biscuits to take.</span></p><p><span class=\"sentence\">As a simple example, imagine you live in a country where they don’t have a strict rule about which side of the road you drive on, and you’re allowed to choose, left or right. </span><span class=\"sentence\">If you’re driving along a road with another car coming in the opposite direction, you have a choice to make.</span></p><table> <tbody><tr> <td>You drive on the left</td><td>The other car drives on the left</td><td>[[Everything’s fine!</td><td>It’s very bad!]]</td></tr> <tr> <td>You drive on the left</td><td>The other car drives on the right</td><td>[[Everything’s fine!</td><td>It’s very bad!]]</td></tr> <tr> <td>You drive on the right</td><td>The other car drives on the left</td><td>[[Everything’s fine!</td><td>It’s very bad!]]</td></tr> <tr> <td>You drive on the right</td><td>The other car drives on the right</td><td>[[Everything’s fine!</td><td>It’s very bad!]]</td></tr> </tbody></table> </x-step>"},{"id":"step-1","section":"prisoners","goals":[],"html":"<x-step id=\"step-1\" goals=\"\"><p><span class=\"sentence\">We can represent information about choices like this in a <strong>payoff matrix</strong> – this shows the possible options for each player along the top and left, and the outcome for each combination of choices in the square where that row and column cross.</span></p><table class=\"payoff-matrix\"> <tbody><tr> <td></td><td>Left</td><td>Right</td></tr> <tr> <td>Left</td><td>[[Good</td><td>Bad]]</td></tr> <tr> <td>Right</td><td>[[Good</td><td>Bad]]</td></tr> </tbody></table> </x-step>"},{"id":"step-2","section":"prisoners","goals":["blank-0","blank-1","blank-2","blank-3","blank-4","blank-5","blank-6","blank-7","blank-8"],"html":"<x-step id=\"step-2\" goals=\"blank-0 blank-1 blank-2 blank-3 blank-4 blank-5 blank-6 blank-7 blank-8\"><p><span class=\"sentence\">Let’s complete this payoff matrix for the game ‘rock, paper, scissors’:</span></p><p><span class=\"sentence\">[some kind of pop-out reminder of how the rules of the game work - stone blunts scissors, paper wraps stone, scissors cut paper]</span></p><p><span class=\"sentence\">Player 1 vv Player 2 &gt;&gt; Rock Paper Scissors Rock <x-blank><button class=\"choice\"> Draw </button><button class=\"choice\"> Player 1 wins </button><button class=\"choice\"> Player 2 wins</button></x-blank> <x-blank><button class=\"choice\"> Draw </button><button class=\"choice\"> Player 1 wins </button><button class=\"choice\"> Player 2 wins</button></x-blank> <x-blank><button class=\"choice\"> Draw </button><button class=\"choice\"> Player 1 wins </button><button class=\"choice\"> Player 2 wins</button></x-blank> Paper <x-blank><button class=\"choice\"> Draw </button><button class=\"choice\"> Player 1 wins </button><button class=\"choice\"> Player 2 wins</button></x-blank> <x-blank><button class=\"choice\"> Draw </button><button class=\"choice\"> Player 1 wins </button><button class=\"choice\"> Player 2 wins</button></x-blank> <x-blank><button class=\"choice\"> Draw </button><button class=\"choice\"> Player 1 wins </button><button class=\"choice\"> Player 2 wins</button></x-blank> Scissors <x-blank><button class=\"choice\"> Draw </button><button class=\"choice\"> Player 1 wins </button><button class=\"choice\"> Player 2 wins</button></x-blank> <x-blank><button class=\"choice\"> Draw </button><button class=\"choice\"> Player 1 wins </button><button class=\"choice\"> Player 2 wins</button></x-blank> <x-blank><button class=\"choice\"> Draw </button><button class=\"choice\"> Player 1 wins </button><button class=\"choice\"> Player 2 wins</button></x-blank></span></p><p><span class=\"sentence\">A better way to represent information about how the situations are good and bad for different players is to assign each a score for each player. </span><span class=\"sentence\">For example, the situation ‘Player 1 wins’ could be represented by the pair of numbers (1,-1) - here the first number represents how good the situation is for Player 1, and the second for Player 2. </span><span class=\"sentence\">A draw could be written as (0,0).</span></p><p><span class=\"sentence\">[Some kind of button to convert the information in the table above to pairs of numbers]</span></p><p><span class=\"sentence\">We say that this game is symmetric, since there are equally many positive outcomes for each player. </span><span class=\"sentence\">We also say it is a zero-sum game, because if one player wins, the other loses - and if you add together the numbers in each box, the sum is zero.</span></p><p><span class=\"sentence\">In this game, there’s no strategy which always leads to a win. </span><span class=\"sentence\">This is because there is no one ‘best’ object to choose - whichever one you pick, there’s always one that beats it and one that loses to it, and unless you can know in advance which object your opponent is going to pick, you can’t know which one is best to choose.</span></p><p><span class=\"sentence\">If we were to change the game so that there were other objects with different properties, this payoff matrix might change.</span></p><p><span class=\"sentence\">[the option to add more objects to the game which interact in different ways with the ones there]</span></p></x-step>"},{"id":"step-3","section":"prisoners","goals":[],"html":"<x-step id=\"step-3\" goals=\"\"><p><span class=\"sentence\">In real life, games like this aren’t really this mathematical. </span><span class=\"sentence\">You might play multiple games, and your opponent’s behaviour in previous games might give you a hint as to what they will do in the next one. </span><span class=\"sentence\">For example, repeatedly making the same choice might convince your opponent you’re going to keep doing that, in which case they might choose their next move to beat you - but you can just switch to the third option, beating them.</span></p><p><span class=\"sentence\">[a graphic showing this where the pairs of moves appear sequentially]</span></p><p><span class=\"sentence\">While game theory can tell you what to do when the other players are all playing rationally and there are obvious advantages to certain strategies, it doesn’t help when you need to predict someone’s behaviour, especially when being unpredictable (like in rock-paper-scissors) gives you an advantage.</span></p></x-step>"},{"id":"step-4","section":"prisoners","goals":[],"html":"<x-step id=\"step-4\" goals=\"\"><p><span class=\"sentence\">A payoff matrix like this can also be used to explore strategies in games where it’s not just win or lose, and different outcomes can be better or worse for the players - if the numbers involved aren’t all 0, 1 or -1. </span><span class=\"sentence\">In this situation, players might find they can choose strategies based on the potential benefits of that choice.</span></p><p><span class=\"sentence\">A well-known example in game theory is called the Prisoner’s Paradox, or sometimes the Prisoner’s Dilemma. </span><span class=\"sentence\">In this, two prisoners have been caught in the process of committing a small crime (punishable by a year in prison) and are being held by the police. </span><span class=\"sentence\">The police suspect them both of being involved in a more serious crime (punishable by 3 years in prison), but they don’t have enough evidence to convict either of them of the serious crime.</span></p><p><span class=\"sentence\">If they both remain silent, they’ll both go to prison for a year for the lesser crime. </span><span class=\"sentence\">If one of the prisoners agrees to testify against their partner about the serious crime, the partner can be charged with it, and if this happens, the police will agree to waive the lesser charges and set the testifying prisoner free.</span></p><p><span class=\"sentence\">If both prisoners agree to testify, they will both serve 2 years (a compromise sentence, as they can both be convicted of the serious crime, but have time taken off for having cooperated). </span><span class=\"sentence\">Unfortunately, the prisoners are not allowed to talk to each other, or agree on a strategy - they each need to decide what to do by themselves.</span></p><p><span class=\"sentence\">[Let’s insert an interactive game here, where students can play the prisoners paradox a couple of times, before moving on to the mathematical analysis. </span><span class=\"sentence\">The “computer” chooses randomly between testifying and silence.]</span></p><p><span class=\"sentence\">Let’s complete the payoff matrix for this situation:</span></p><p><span class=\"sentence\">Prisoner 1 vv Prisoner 2 &gt;&gt; Remain silent Agree to testify Remain silent ([-1],[-1]) ([-3],[0]) Agree to testify ([0],[-3]) ([-2],[-2])</span></p></x-step>"},{"id":"step-5","section":"prisoners","goals":["blank-0","blank-1","blank-2"],"html":"<x-step id=\"step-5\" goals=\"blank-0 blank-1 blank-2\"><p><span class=\"sentence\">[For words ‘if they both remain silent’ in the paragraph above (and the one below), and ‘if one of the prisoners agrees to testify’ and ‘if both prisoners agree to testify’ in the paragraph above, when students hover over this part, we can highlight the corresponding row + column in the matrix]</span></p><p><span class=\"sentence\">This places our two prisoners in an interesting situation. </span><span class=\"sentence\">The best thing for both of them would be if they both remain silent - then the total amount of prison time served will only be [2] years. </span></p><p><span class=\"sentence\">Now let’s imagine that we are Prisoner 2. </span><span class=\"sentence\">If we somehow know that Prisoner 1 will remain silent, we would get the best outcome if we <x-blank><button class=\"choice\">agree to testify </button><button class=\"choice\"> stay silent</button></x-blank> (0 years, rather than 1 year). </span><span class=\"sentence\">If we know that Prisoner 1 will agree to testify, we would get a better outcome if we <span class=\"nowrap\"><x-blank><button class=\"choice\">also testify </button><button class=\"choice\"> stay silent</button></x-blank>.</span> </span><span class=\"sentence\">In order words, whatever Prisoner 1 does, Prisoner 2 can get the best outcome for themselves if they testify.</span></p><p><span class=\"sentence\">Of course, exactly the same argument works with the prisoners the other way around - so the likely outcome is that both prisoners testify, and receive <x-blank-input solution=\"2\"></x-blank-input> years each in jail.</span></p><p><span class=\"sentence\">This situation is described as a paradox, because both prisoners could have received a reduced sentence if they had both remained silent - but testifying was still their best option. </span><span class=\"sentence\">Agreeing to testify can be considered as being both better and worse at the same time, in different ways.</span></p><p><span class=\"sentence\">Similar paradoxes can be found in many areas of real life, although they rarely have a precise payoff matrix like the example above. </span><span class=\"sentence\">For example, this can explain why large companies like Apple and Samsung, or McDonalds and Burger King spend so much money on advertising – knowing that their opponents would take advantage if they didn’t. </span><span class=\"sentence\">This is also why many countries have laws against cooperation or “price fixing”.</span></p></x-step>"},{"id":"step-6","section":"prisoners","goals":["blank-0","blank-1","blank-2","blank-3","blank-4","blank-5","blank-6","blank-7"],"html":"<x-step id=\"step-6\" goals=\"blank-0 blank-1 blank-2 blank-3 blank-4 blank-5 blank-6 blank-7\"><p><span class=\"sentence\">One of the four outcomes in the Prisoner’s Paradox has the property that neither player can gain anything by changing their strategy. </span><span class=\"sentence\">This is the one in which Prisoner 1 <x-blank><button class=\"choice\">agrees to testify </button><button class=\"choice\"> remains silent</button></x-blank> and Player 2 <span class=\"nowrap\"><x-blank><button class=\"choice\">agrees to testify </button><button class=\"choice\"> remains silent</button></x-blank>.</span> </span></p><p><span class=\"sentence\">We call this type of situation a Nash Equilibrium - named after the mathematician John Forbes Nash Jr, who was one of the early pioneers of study in game theory. </span><span class=\"sentence\">Nash showed that such an equilibrium state exists in all finite games - but it’s not always the best outcome for all players (as seen in our example).</span></p><p><span class=\"sentence\">[embedded video: </span><span class=\"sentence\">https://www.youtube.com/watch?v=LJS7Igvk6ZM]</span></p><p><span class=\"sentence\">Another nice example of Nash equilibrium is in modelling traffic on roads. </span><span class=\"sentence\">Imagine a city has a road network as shown in the example below, with two possible routes from A to D, one via B and one via C. </span><span class=\"sentence\">In the diagram, the numbers marked on the roads show how long it takes to drive along the road: </span><span class=\"sentence\">for example, the route from A to B takes <x-blank-input solution=\"1 hour\"></x-blank-input> to drive along, and the route from B to D takes <span class=\"nowrap\"><x-blank-input solution=\"2 hours\"></x-blank-input>.</span></span></p><p><span class=\"sentence\">In the road network as shown, travelling via B takes <x-blank><button class=\"choice\">the same amount of time </button><button class=\"choice\"> more time </button><button class=\"choice\"> less time</button></x-blank> than travelling via C, so assuming everyone chooses logically, half the cars will take each route, and the roads will be equally busy - since there’s no advantage of choosing one route over another.</span></p><p><span class=\"sentence\">Now let’s make our model a little more complicated. </span><span class=\"sentence\">Imagine the speed at which cars travel along some of the sections of road depends on how many cars are travelling along it - so the journey time from A to B is now (1 + x/100) hours, where 100 is the maximum number of cars that can travel along it, and x is the number of cars that choose to travel that way.</span></p><p><span class=\"sentence\">[the diagram from above but with the formulae, and with sliders so you can play with the ratio of traffic and see the resulting journey times; B-D and A-C are still 2 hours; for each of the routes ‘number of cars choosing this route’, which have to add up to 100, and ‘travel time for these cars’]]</span></p><p><span class=\"sentence\">So, if one car travels along the section from A to B, it would take 1 + 1/100 hours (a little over an hour), but if 100 cars try to drive that way at once, it will take all of them a full 1 + 100/100 =<x-blank-input solution=\"2\"></x-blank-input> hours.</span></p><p><span class=\"sentence\">Now, if half of 100 cars take each route, their travel time is (1 + <x-blank-input solution=\"50\"></x-blank-input>/100) hours = <x-blank-input solution=\"1.5 hours\"></x-blank-input> for the first section, and then 2 hours for the second half, and vice versa for the bottom route. </span><span class=\"sentence\">This situation is a Nash equilibrium for all the drivers, as if any of them switched from their current route to the other one, they would find their journey takes longer.</span></p></x-step>"},{"id":"step-7","section":"prisoners","goals":["blank-0"],"html":"<x-step id=\"step-7\" goals=\"blank-0\"><p><span class=\"sentence\">Now let’s change the road layout - adding in an extra bypass road between B &amp; C, which takes only 15 minutes to drive along. </span><span class=\"sentence\">This offers drivers another option - driving from A to B, then down to C, then from C to D.</span></p><p><span class=\"sentence\">If only one car is driving this route, the time taken is a little over an hour for each of the traffic-dependent sections, plus 15 minutes for the central cut-through. </span><span class=\"sentence\">This is faster than the 3 ½ hours it took to drive across the top or bottom in the equilibrium scenario, so drivers will choose it favourably. </span><span class=\"sentence\">But once more drivers choose this route, it becomes slower. </span><span class=\"sentence\">We can model this by trying different numbers of drivers choosing each route, and try to find the optimal arrangement.</span></p><p><span class=\"sentence\">[interactive version of the diagram which lets you change all these variables, now across three routes]</span></p><p><span class=\"sentence\">If 25 of the drivers take the original top/bottom routes ABD and ACD, and 50 take the central cut-through route ABCD, everyone’s travel time is the same - <x-blank-input solution=\"3 hours 45 minutes\"></x-blank-input> - and if anyone were to change their route, the travel time would increase. </span><span class=\"sentence\">So this state is a Nash equilibrium, and once reached, nobody will have an incentive to change it.</span></p><p><span class=\"sentence\">But this is longer than it took to drive across ABD and ACD before the extra road was added! </span><span class=\"sentence\">Adding an extra road to the system, which serves as a cut-through, has made the system less efficient. </span><span class=\"sentence\">This is an example of Braess’ Paradox - formulated in 1968 by German mathematician Dietrich Braess, who noticed that adding an extra road to a congested traffic network, under certain conditions, can actually increase overall journey time.</span></p><p><span class=\"sentence\">This paradox can sometimes be seen to apply in real-world situations - in Stuttgart, Germany in 1969, the road network was extensively improved to try and reduce traffic, but the congestion did not get any better until a section of newly built road was closed again. </span><span class=\"sentence\">In 1990 the temporary closing of 42nd Street in New York City for Earth Day reduced the amount of traffic in the area, even though fewer roads were open to drive on.</span></p><p><span class=\"sentence\">[Image caption: </span><span class=\"sentence\">Broadway in New York, closed to traffic for Earth Day in 2018 (photograph courtesy of NYC DOT)]</span></p><p><span class=\"sentence\">There have also been instances of mathematicians recommending specific road closures, having analysed traffic data and travel times, making use of this paradox to successfully reduce traffic. </span><span class=\"sentence\">Like in the prisoner’s paradox, no driver would set out to deliberately make their own journey longer, but since they need to make their decision without knowing what the other drivers will do, the best decision in each particular case is to take the shorter route - making everyone’s journeys longer. </span><span class=\"sentence\">While the system will end up in a Nash equilibrium - where nobody can improve their individual journey time by changing their strategy - a better equilibrium exists, but it will never be reached if everyone is behaving logically. </span><span class=\"sentence\">They might need a little help from a clever mathematician with a ‘Road Closed’ sign!</span></p></x-step>"},{"id":"step-8","section":"prisoners","goals":["blank-0","blank-1","blank-2","blank-3"],"html":"<x-step id=\"step-8\" goals=\"blank-0 blank-1 blank-2 blank-3\"><p><span class=\"sentence\">You can also play the Prisoner’s Paradox as a sort of game - called the Iterated Prisoner’s Paradox, you can play through this situation over and over again, and instead of accruing years of prison time, you score points based on the payoffs in the matrix. </span><span class=\"sentence\">In this circumstance, you can learn about your opponent and what their strategy might be, based on their decisions in previous rounds.</span></p><p><span class=\"sentence\">[System to play the game against a choice of opponents, and if you switch opponents your scores reset; the AI opponents could have different names and each play a different strategy, which the player has to identify. </span><span class=\"sentence\">A good example is at https://ncase.me/trust/]</span></p><p><span class=\"sentence\">Having played against each of the opponents for a little while, we can determine which of them is using which strategy.</span></p><p><span class=\"sentence\">Opponent 1 <x-blank><button class=\"choice\">Always remains silent </button><button class=\"choice\"> Always agrees to testify </button><button class=\"choice\"> Chooses randomly with probability ½ </button><button class=\"choice\"> Chooses whatever you did on the last round (known as a ‘tit-for-tat’ strategy)</button></x-blank> Opponent 2 <x-blank><button class=\"choice\">Always remains silent </button><button class=\"choice\"> Always agrees to testify </button><button class=\"choice\"> Chooses randomly with probability ½ </button><button class=\"choice\"> Chooses whatever you did on the last round (known as a ‘tit-for-tat’ strategy)</button></x-blank> Opponent 3 <x-blank><button class=\"choice\">Always remains silent </button><button class=\"choice\"> Always agrees to testify </button><button class=\"choice\"> Chooses randomly with probability ½ </button><button class=\"choice\"> Chooses whatever you did on the last round (known as a ‘tit-for-tat’ strategy)</button></x-blank> Opponent 4 <x-blank><button class=\"choice\">Always remains silent </button><button class=\"choice\"> Always agrees to testify </button><button class=\"choice\"> Chooses randomly with probability ½ </button><button class=\"choice\"> Chooses whatever you did on the last round (known as a ‘tit-for-tat’ strategy)</button></x-blank></span></p><p><span class=\"sentence\">A famous experiment in the 1980s involved a competition of 62 computer programs, each playing all the others for 200 rounds of Iterated Prisoner’s Paradox.</span></p><p><span class=\"sentence\">The most successful strategies had certain characteristics:</span></p><ul> <li><span class=\"sentence\">they were all nice: </span><span class=\"sentence\">they did not choose to betray their opponent before the opponent did;</span></li><li><span class=\"sentence\">they would always retaliate when an opponent betrayed;</span></li><li><span class=\"sentence\">they were forgiving, returning to cooperation when the opponent stopped betraying</span></li><li><span class=\"sentence\">they were non-envious, seeking to maximise their own benefit rather than to reduce that of their opponents.</span></li></ul> </x-step>"},{"id":"step-9","section":"prisoners","goals":["blank-0","blank-1","blank-2","blank-3","blank-4","blank-5","blank-6","blank-7"],"html":"<x-step id=\"step-9\" goals=\"blank-0 blank-1 blank-2 blank-3 blank-4 blank-5 blank-6 blank-7\"><p><span class=\"sentence\">A similar game can be played by two players each choosing a number between 1 and 3 and putting up that many fingers. </span><span class=\"sentence\">The sum of the two chosen numbers (the total number of fingers shown) is counted, and if it’s odd, Player 1 wins £1 and if it’s even, Player 2 wins £1.</span></p><p><span class=\"sentence\">[Applet to play the game against a random opponent, with a choice of whether you’re player 1 or 2]</span></p><p><span class=\"sentence\">Let’s construct a payoff matrix for this game:</span></p><p><span class=\"sentence\">Player 1 vv Player 2 &gt;&gt; 1 2 3 1 ([0],[1]) ([1],[0]) ([0],[1]) 2 ([1],[0]) ([0],[1]) ([1],[0]) 3 ([0],[1]) ([1],[0]) ([0],[1])</span></p><p><span class=\"sentence\">What can we say about this game? </span><span class=\"sentence\">It’s a <x-blank><button class=\"choice\">symmetric </button><button class=\"choice\"> non-symmetric</button></x-blank> game <x-blank><button class=\"choice\">Player 1 </button><button class=\"choice\"> Player 2</button></x-blank> has more chance of winning. </span><span class=\"sentence\">If you are Player 1 in this game, and the other player is picking at random, you have more chance of winning if you put up an <x-blank><button class=\"choice\">odd </button><button class=\"choice\"> even</button></x-blank> number of fingers, in which case you win <x-blank-input solution=\"2\"></x-blank-input> out of <x-blank-input solution=\"3\"></x-blank-input> times. </span><span class=\"sentence\">If you are Player 2 in this game, and the other player is picking at random, you have more chance of winning if you put up an <x-blank><button class=\"choice\">odd </button><button class=\"choice\"> even</button></x-blank> number of fingers, in which case you win <x-blank-input solution=\"4\"></x-blank-input> out of <x-blank-input solution=\"6\"></x-blank-input> times.</span></p><p><span class=\"sentence\">However, if the players can work out each other’s preferred strategies, this will change what their best option is - which will change the other player’s best strategy! </span><span class=\"sentence\">Optimal play in this game will depend on what kind of player you’re playing against. </span><span class=\"sentence\">Do they retaliate when you beat them? </span><span class=\"sentence\">Do they favour one choice of odd/even over the other? </span><span class=\"sentence\">You might be better equipped to work out a strategy once you’ve played a few rounds - maths can’t help you here as much as knowing your opponent does!</span></p></x-step>"},{"section":"cards-coins-dice","sectionStatus":"dev","id":"step-10","goals":[],"html":"<x-step id=\"step-10\" goals=\"\"><p class=\"todo\"> Coming Soon!</p></x-step>"},{"section":"nim","sectionPreview":"/world/Game_Theory","sectionStatus":"dev","id":"step-11","goals":["next-0"],"html":"<x-step id=\"step-11\" goals=\"next-0\"><p><span class=\"sentence\">In all the games we’ve seen so far, there was an element of <em>uncertainty</em>: </span><span class=\"sentence\">you didn't know what the other player might do (like in the <x-gloss xid=\"prisoners-dilemma\">prisoners’ dilemma</x-gloss>), or you didn't know the result when rolling dice, flipping coins or shuffling cards.</span></p><div class=\"row padded\"><div class=\"grow\"> <p><span class=\"sentence\">In this chapter we will look at a different kind of game, where there is no <em>chance</em> or <em>luck</em>, and where all players know the current state of the game. </span><span class=\"sentence\">Games like this are called <span class=\"nowrap\"><x-gloss xid=\"combinatorial:games\"><strong>combinatorial games</strong></x-gloss>.</span></span></p><p><span class=\"sentence\">One of the most famous combinatorial games is <strong>chess</strong>. </span><span class=\"sentence\">A player doesn’t know what the other one might do in the future, but all players know the current position of every piece on the chess board. </span><span class=\"sentence\"><button class=\"next-step\">Continue</button></span></p></div><div style=\"width: 300px\"> <p><span class=\"sentence\">CHESS IMAGE</span></p></div></div> </x-step>"},{"id":"step-12","section":"nim","goals":[],"html":"<x-step id=\"step-12\" goals=\"\"><p><span class=\"sentence\">Instead, let's look at a much simpler game. </span><span class=\"sentence\">There are three boxes of chocolates and two players. </span><span class=\"sentence\">At every turn, a player has to eat one or more chocolates, but only from <em>one box</em> at a time. </span><span class=\"sentence\">For example, you could eat three chocolates from box A, but not one from box A and one from box B. </span><span class=\"sentence\">Both players alternate, until all boxes are empty. </span><span class=\"sentence\">Whoever gets the last chocolate wins!</span></p><p><span class=\"sentence\">Here you can try playing this game against the computer. </span><span class=\"sentence\">Simply tap all the chocolates you want to \"eat\", and then tap the button to end your turn:</span></p><p class=\"todo\">INTERACTIVE GAME</p><p class=\"text-center\"><span class=\"sentence\"><button class=\"btn\">End your turn</button></span></p></x-step>"},{"id":"step-13","section":"nim","goals":["blank-0"],"html":"<x-step id=\"step-13\" goals=\"blank-0\"><p><span class=\"sentence\">If you play the game a few times, you might notice that you <span class=\"nowrap\"><x-blank><button class=\"choice\">always lose</button><button class=\"choice\">lose if you take more than one chocolate at once</button><button class=\"choice\">lose if you take any chocolates from box 3</button></x-blank>.</span></span></p><p class=\"fixme\"><span class=\"sentence\"> After some time you may notice that you always lose. </span><span class=\"sentence\">In fact, it it clear from the beginning that the computer always wins unless it makes a mistake. </span><span class=\"sentence\">The following sections will explore different methods to analyse combinatorial games, to find <em>winning strategies</em> and to determine whether it is better to go first or to go second.</span></p></x-step>"},{"id":"step-14","section":"nim","goals":[],"html":"<x-step id=\"step-14\" goals=\"\"><h2>Tree Diagrams</h2><p><span class=\"sentence\">One method to think about combinatorial games is to make a list of all possible outcomes. </span><span class=\"sentence\">This is best done in a <em>tree diagram</em>, where every fork shows all possible choices a player could make. </span><span class=\"sentence\">Here is the tree diagram for a slightly simpler version of the game above, with only three chocolates per box.</span></p><x-slideshow> <div slot=\"legend\"> xxx</div><div slot=\"legend\"> Whoever empties the first box loses, because the opponent can empty the other box, thereby taking the last chocolate. Therefore <strong class=\"green\">Player 1</strong> only has two sensible choices: taking one or taking two chocolates from one box.</div><div slot=\"legend\"> Now it’s <span class=\"lblue\"><strong>Player 2</strong></span>’s turn. <span class=\"lblue\"><strong>Player 2</strong></span> also doesn’t want to empty any box. This means there are two possibilities in one case, and three in the other.</div><div slot=\"legend\"> It’s <span class=\"green\"><strong>Player 1</strong></span>’s turn. With fewer chocolates left there are much fewer possibilities that don’t involve emptying the first box, which would lead to certain loss.</div><div slot=\"legend\"> We continue: if there is one chocolate in both boxes, one player has to empty the first box. The opponent can then take the last chocolate from the second box and wins.</div><div slot=\"legend\"> Let us highlight the final positions in which <span class=\"green\"><strong>Player 1</strong></span> and <span class=\"lblue\"><strong>Player 2</strong></span> win.</div><div slot=\"legend\"> So far the game seems quite fair: there are three winning positions for each player. Now let us think about the positions second from last.</div><div slot=\"legend\"> Once we have arrived at any of these positions we already know who is going to win. If you can only go to a winning position for <strong class=\"green\">Player 1</strong>, this also has to be a winning position for <strong class=\"green\">Player 1</strong>. And the same is true for <span class=\"lblue\"><strong>Player 2</strong></span>. We can colour the positions second from last according to which winning position they lead to.</div><div slot=\"legend\"> And we can do the same again: whenever we can only go to winning positions of one kind, we colour the previous position in the same colour.</div><div slot=\"legend\"> Unfortunately we will get stuck at some point…</div><div slot=\"legend\"> When at these two positions there is a choice: we could either go to a winning position for <strong><span class=\"green\">Player 1</span></strong> or to a winning position for <strong><span class=\"lblue\">Player 2</span></strong>. Here we have to make an assumption that both players are intelligent and will play in their best interest. If it is <strong><span class=\"green\">Player 1</span></strong>’s turn he/she will of course go to his/her own winning position and the same for <strong><span class=\"lblue\">Player 2</span></strong>.</div><div slot=\"legend\"> We have coloured the first case <span class=\"lblue\"><strong>blue</strong></span> because <span class=\"lblue\"><strong>Player 2</strong></span> has a choice to go to his/her own winning position. The second case is coloured <span class=\"green\"><strong>green</strong></span> because <span class=\"green\"><strong>Player 1</strong></span> has a choice to go to his/her own winning position. These are the positions where players have to be careful not to make a mistake.</div><div slot=\"legend\"> The same is happens here: <span class=\"lblue\"><strong>Player 2</strong></span> has the option to go to <span class=\"lblue\"><strong>blue</strong></span> and <span class=\"green\"><strong>green</strong></span> winning positions, but – if he plays intelligently – he/she will of course choose <span class=\"lblue\"><strong>blue</strong></span>.</div><div slot=\"legend\"> It seems that whatever <strong class=\"green\">Player 1</strong> does on the first turn, he/she will always end up on a winning position for <span class=\"lblue\"><strong>Player 2</strong></span>.</div></x-slideshow> </x-step>"},{"id":"step-15","section":"nim","goals":[],"html":"<x-step id=\"step-15\" goals=\"\"><p><span class=\"sentence\">It looks like <strong>Player 2</strong> is destined to win from the beginning – unless he makes a mistake.</span></p><p><span class=\"sentence\">This method is useful for simple games, but impractical if we have boxes with many more chocolates. </span><span class=\"sentence\">If there are five chocolates per box, we would have to consider more than 10,000 possibilities!</span></p></x-step>"},{"id":"step-16","section":"nim","goals":[],"html":"<x-step id=\"step-16\" goals=\"\"><h2>P and N-Positions</h2><p><span class=\"sentence\">In the tree diagram above we had many copies of the same state in different branches of the tree. </span><span class=\"sentence\">Instead let us draw a diagram of all the different states, and connect two states with an arrow if a player could move from one to the other. </span><span class=\"sentence\">(Remember that you can’t put chocolates back or take chocolates from more than one box.)</span></p><p><span class=\"sentence\">We will again highlight various states with different colours, but the colours will have a different meaning than above.</span></p><x-slideshow> <div slot=\"legend\"> Here you can see all possible states of the game we were playing.</div><div slot=\"legend\"> These arrows show the possible moving directions. On your turn you can move either down or to the right, however far you want.</div><p></p><div slot=\"legend\"> We know that once we have reached the bottom right corner, the <strong class=\"lblue\">p</strong>revious player will have taken the last chocolate and won. We call it a <strong class=\"lblue\"><em>P</em>-position</strong> and colour it <strong class=\"lblue\">blue</strong>.</div><p></p><div slot=\"legend\"> If we are in any state that <em>leads to</em> the <strong class=\"lblue\"><em>P</em>-position</strong>, the <strong class=\"red\">n</strong>ext player will win. We call these <strong class=\"red\"><em>N</em>-positions</strong> and colour them <span class=\"red\">red</span>.</div><p></p><div slot=\"legend\"> From here you can only move to <strong class=\"red\"><em>N</em>-position</strong>. Once you have done that, you opponent is next and can win. Therefore this has to be a <strong class=\"lblue\"><em>P</em>-position</strong>.</div><p></p><div slot=\"legend\"> Any positions that leads to the new <strong class=\"lblue\"><em>P</em>-position</strong> have to be an <strong class=\"red\"><em>N</em>-position</strong> – The <em>next</em> player will win. Can you see a pattern?</div><p></p><div slot=\"legend\"> Here is another <strong class=\"lblue\"><em>P</em>-position</strong> from where you can only move to <strong class=\"red\"><em>N</em>-positions</strong>.</div><p></p><div slot=\"legend\"> These two are <strong class=\"red\"><em>N</em>-positions</strong> because the <em>next</em> player can move to a <strong class=\"lblue\"><em>P</em>-position</strong>.</div><p></p><div slot=\"legend\"> Finally the starting position is a <strong class=\"lblue\"><em>P</em>-position</strong>. The “previous” player wins, and whoever makes the first move is destined to lose.</div></x-slideshow> </x-step>"},{"id":"step-17","section":"nim","goals":[],"html":"<x-step id=\"step-17\" goals=\"\"><p><span class=\"sentence\">The pattern is quite obvious: </span><span class=\"sentence\">all positions along the diagonal, where there are the same number of chocolates in each box, are <span class=\"lblue\"><em><strong>P</strong></em>-positions</span>. </span><span class=\"sentence\">All the other positions are <span class=\"red\"><em><strong> N</strong></em>-position</span>. </span><span class=\"sentence\">And this extends to bigger box sizes, including nine chocolates per box like in the game at the beginning of this article. </span><span class=\"sentence\">You always made the first move, so you had no chance of winning unless the computer had made a mistake.</span></p><p><span class=\"sentence\">A <span class=\"lblue\"><em><strong>P</strong></em>-position</span> is a position in which the <strong class=\"lblue\">p</strong>revious player will win (who moved to that position) and a <span class=\"red\"><em><strong>N</strong></em>-position</span> is a position where the <span class=\"red\"><strong>n</strong></span>ext player will win (who moves away from that position). </span><span class=\"sentence\">When playing, you want to make sure that you always end your turn on a <span class=\"lblue\"><em><strong>P</strong></em>-position</span>.</span></p><p><span class=\"sentence\">We also observed that from a <span class=\"lblue\"><em><strong>P</strong></em>-position</span> you can only move to <span class=\"red\"><em><strong>N</strong></em>-positions</span>, and from a <span class=\"red\"><em><strong>N</strong></em>-position</span> you can move to at least one <span class=\"lblue\"><em><strong>P</strong></em>-position</span>.</span></p><p><span class=\"sentence\">Starting on a <span class=\"lblue\"><em><strong>P</strong></em>-position</span>, the next player will lose. </span><span class=\"sentence\">Therefore the next player must only be able to move to <span class=\"red\"><em><strong>N</strong></em>-positions</span>. </span><span class=\"sentence\">Starting on an <span class=\"red\"><em><strong>N</strong></em>-position</span>, the next player will win. </span><span class=\"sentence\">Therefore there must be at least one <span class=\"lblue\"><em><strong>P</strong></em>-position</span> where the next player can move to. </span><span class=\"sentence\">(The game will change if you make a mistake.)</span></p><p><span class=\"sentence\">To analyse a game, we have to start from the end when we know who would have won. </span><span class=\"sentence\">Then we can work backwards using the two rules above to classify all positions in the game.</span></p><p><span class=\"sentence\">In any game that can be analysed using this method, the outcome is determined from the beginning. </span><span class=\"sentence\">If you are unlucky and you are the player destined to lose, there is nothing you can do except hope that your opponent makes a mistake…</span></p></x-step>"},{"id":"step-18","section":"nim","goals":[],"html":"<x-step id=\"step-18\" goals=\"\"><h2>The Game of Nim</h2><p><span class=\"sentence\">The game we have been thinking about is a variant of <strong>Nim</strong>. </span><span class=\"sentence\">The winning strategy for only two boxes of chocolates is easy to find, but things get more interesting when we have three or more boxes. </span><span class=\"sentence\">Instead of boxes of chocolates we will simply use piles of counters: </span><span class=\"sentence\">you are allowed to take as many counters as you want, but only from one pile at a time. </span><span class=\"sentence\">We can denote the various states of the game using numbers: </span><span class=\"sentence\">for example, (2,5,4) means there are three piles with 2, 5 and 4 counters respectively.</span></p><p><span class=\"sentence\">INTERACTIVE</span></p><p><span class=\"sentence\">Notice that it doesn’t matter which order the piles are in, or whether there are additional piles with zero counters. </span><span class=\"sentence\">For example, (2,5,4) = (5,0,4,2). </span><span class=\"sentence\">We have already shown that (1,1), (2,2), (3,3), … are all <em><strong>P</strong></em>-positions, and there is a simple method for determining whether positions with three or more piles are <em><strong>P</strong></em> or <em><strong>N</strong></em>. </span><span class=\"sentence\"><span class=\"lgrey\">This method may seem quite unexpected and unrelated to game theory. It arises when you analyse <em><strong>P</strong></em> and <em><strong>N</strong></em>-positions mathematically.</span></span></p><p><span class=\"sentence\">A Nim state (<em>a</em>, <em>b</em>, <em>c</em>, …) is a <strong><em>P</em></strong>-position if the <em>binary digital sum</em> or <em>Nim sum</em> of <em>a</em>, <em>b</em>, <em>c</em>, … is 0. </span><span class=\"sentence\">Otherwise it is a <em><strong>N</strong></em>-position. </span><span class=\"sentence\">The Nim sum is often written as <em>a</em> ⊕ <em>b</em> ⊕<em> c</em> ⊕ … and can be calculates as shown in the following example.</span></p> <p><span class=\"sentence\">To find the Nim sum 3 ⊕ 6 ⊕ 7 we proceed as follows:</span></p><p></p></x-step>"},{"id":"step-19","section":"nim","goals":[],"html":"<x-step id=\"step-19\" goals=\"\"><x-slideshow> <div slot=\"legend\"> Above you can see the three numbers <strong class=\"red\">3</strong>, <strong class=\"red\">6</strong> and <strong class=\"red\">7</strong> in different rows and powers of 2 (<strong class=\"blue\">1</strong>, <strong class=\"blue\">2</strong>, <strong class=\"blue\">4</strong>, 8, …) in different columns. We first need to write 3, 6 and 7 in binary, which means writing them as a sum of powers of 2.</div><div slot=\"legend\"> Note that <strong class=\"green\">3 = 1 + 2</strong>. We need to add the powers 1 and 2, but we don’t need 4. Therefore <strong class=\"green\">3 = 011</strong> in binary.</div><div slot=\"legend\"> Note that <strong class=\"cyan\">6 = 2 + 4</strong>. We need the powers 2 and 4, but we don’t need 1. Therefore <strong class=\"cyan\">6 = 110</strong> in binary.</div><div slot=\"legend\"> Note that <strong class=\"lblue\">7 = 1 + 2 + 4</strong>. Here we need all three powers of two.</div><p></p><div slot=\"legend\"> Now we have to add the columns we just created, but without carrying digits.</div><p></p><div slot=\"legend\"> In this column, we have an even number of 1s so the answer is <strong class=\"orange\">0</strong>.</div><p></p><div slot=\"legend\"> In this column we have an odd number of 1s so the answer is <strong class=\"purple\">1</strong>.</div><p></p><div slot=\"legend\"> In this column we have an even number of 1s so the answer is <strong class=\"pink\">0</strong>.</div><p></p><div slot=\"legend\"> The binary digital sum of 3, 6 and 7 is <strong class=\"red\">010</strong>, and when we convert this from binary we get <strong class=\"red\">2</strong>. Since the Nim sum is not 0, the Nim state (3,6,7) is a <em><strong>N</strong></em>-position. Removing two counters from any pile will make the Nim sum 0, so this would represent moving to a <em><strong>P</strong></em>-position.</div><p></p></x-slideshow> <p><span class=\"sentence\">Nim has several important properties:</span></p><ul> <li><span class=\"sentence\">Exactly two opponents move alternately.</span></li><li><span class=\"sentence\">The moves and all options are clearly specified by rules, and there are no chance moves.</span></li><li><span class=\"sentence\">There are only finitely many different positions and the game will always come to an end when one player is unable to move. </span><span class=\"sentence\">This means that there are no draws and no cycles, which could repeat forever.</span></li><li><span class=\"sentence\">The players have perfect information. </span><span class=\"sentence\">Card games often don’t have perfect information because one player doesn’t know the opponents’ cards.</span></li><li><span class=\"sentence\">From any one position of the game both players have the same choice of moves. </span><span class=\"sentence\">This is not true for chess, because from any particular position, one player can only move white figures and the opponent can only move black ones.</span></li></ul> <p><span class=\"sentence\">Games with all these properties are called <strong>Impartial Games</strong>. </span><span class=\"sentence\">Mathematicians discovered that <em>any</em> impartial game is equivalent to a game of Nim with certain box sizes. </span><span class=\"sentence\">This means that the <em><strong>P</strong></em> and <em><strong>N</strong></em>-positions match up, and that there are always the same number of possible moves. </span><span class=\"sentence\">A winning strategy for any impartial game can be found by converting it into Nim and then using the Nim sum.</span></p><p></p><p><span class=\"sentence\">Impartial games are interesting to analyse from a mathematical point of view, but once you have found a winning strategy they are not particularly exciting to play – you know right from the beginning who is going to win.</span></p><p><span class=\"sentence\">Unfortunately, there are so many different moves and positions in chess, that it is almost impossible to analyse it using the methods we will develop in this chapter. </span><span class=\"sentence\">After just 10 moves, there are over <em>69 trillion</em> possible states, and the total number of possible sequences of moves might be as big as <span class=\"nowrap\"><span class=\"math\" data-voice=\"10 to the power of 120\"><msup><mn>10</mn><mn>120</mn></msup></span>!</span></span></p><p><span class=\"sentence\">There are many other combinatorial games. </span><span class=\"sentence\">Some, like chess, are so complex that we can’t use methods like the ones above. </span><span class=\"sentence\">Chess computers don’t try millions of different possibilities – they play very much like a human being would: </span><span class=\"sentence\">analysing the current position and following certain strategies.</span></p></x-step>"},{"section":"random-walks","sectionStatus":"dev","id":"step-20","goals":[],"html":"<x-step id=\"step-20\" goals=\"\"><p class=\"todo\"> Coming Soon!</p></x-step>"}],"goals":35,"title":"Game Theory"}