{"euler":{"name":"Euler","born":1707,"died":1783,"bio":"<p><strong>Леонард Эйлер</strong> (1707 - 1783) был одним из величайших математиков в истории. Его работы охватывают все области математики, и он написал 80 томов исследований.</p><p>Эйлер родился в Швейцарии и учился в Базеле, но большую часть жизни прожил в Берлине, Пруссии и Санкт-Петербурге, России.</p><p>Эйлер ввел большую часть современной математической терминологии и обозначений, и сделал важные открытия в исчислении, анализе, теории графов, физике, астрономии и многих других темах.</p>","links":[{"title":"Задача о семи кёнигсбергских мостах","url":"/course/graph-theory/bridges"},{"title":"Формула Эйлера","url":"/course/graph-theory/planar-graphs"},{"title":"Многогранники","url":"/course/polyhedra/polyhedra"}]},"guthrie":{"name":"Guthrie","bio":"<p><strong>Фрэнсис Гатри</strong> (1831 - 1899) был южноафриканским ботаником и математиком, который впервые сформулировал проблему четырех цветов в 1852 году. Он был учеником Августа де Моргана, одного из величайших британских математиков. Помимо того, что Гатри был профессором и учителем математики, он работал юристом и занимался исследованиями в области солнечной энергетики и аэронавтики.</p>"},"haken":{"name":"Haken","bio":"<p><strong>Вольфганг Хакен</strong> (род. 1928) - немецкий математик, известный своими доказательствами <em>теоремы о четырех цветах</em> Кеннета Аппеля. В знак признания он и Аппель получили премию Фалкерсона Американского математического общества. В 1990 году Хакен стал членом Центра перспективных исследований в университете штата Иллинойс, где он в настоящее время является почетным профессором.</p>"},"appel":{"name":"Appel","bio":"<p><strong>Кеннет Аппель</strong> (1932 - 2013) был американским математиком, известным своим доказательством теоремы о четырех цветах с Вольфгангом Хакеном.</p><p>В знак признания он и Хакен получили премию Фулкерсона Американского математического общества.</p><p>Аппель учился в Квинс-Колледже, Нью-Йорк, и в Университете Мичигана. Преподавал в Университете Иллинойса и Университете Нью-Гемпшира.</p>"},"karinthy":{"name":"Karinthy","bio":"<p><strong>Фридьеш Каринти</strong> (1887 - 1938) был венгерским писателем, поэтом и журналистом. Он наиболее известен по рассказу 1929 года «Звенья цепи», в котором впервые была представлена концепция <em>шести уровней разделения</em>.</p>"},"milgram":{"name":"Milgram","bio":"<p><strong>Стэнли Милгрэм</strong> (1933 - 1984) был американским социальным психологом. Он наиболее известен своими экспериментами в области <em>подчинения</em>, проверкой того, насколько готовы взрослые выполнять приказы, даже когда они причиняют вред другим, а также <em>экспериментов в малом мире</em>, который проверяет степень связности общества.</p>"}}