{"euler":{"name":"Euler","born":1707,"died":1783,"bio":"<p><strong>Leonhard Euler</strong> (1707 - 1783) var en av de största matematikerna i historien. Hans arbete sträcker sig över alla områden inom matematik, och han skrev 80 volymer av forskning.</p><p>Euler föddes i Schweiz och studerade i Basel, men bodde större delen av sitt liv i Berlin, Preussen och S: t Petersburg, Ryssland.</p><p>Euler uppfann mycket av den moderna matematiska terminologin och notationen och gjorde viktiga upptäckter inom kalkyl, analys, grafteori, fysik, astronomi och många andra ämnen.</p>","links":[{"title":"Königsberg Bridges Problem","url":"/course/graph-theory/bridges"},{"title":"Euler’s Formula","url":"/course/graph-theory/planar-graphs"},{"title":"Polyhedrons","url":"/course/polyhedra/polyhedra"}]},"guthrie":{"name":"Guthrie","bio":"<p><strong>Francis Guthrie</strong> (1831 - 1899) var en sydafrikansk botaniker och matematiker, som först uttalade fyra färgproblem 1852. Han var student till Augustus De Morgan, en av de största brittiska matematikerna. Förutom att vara matematikprofessor och lärare, arbetade Guthrie som advokat och forskade inom solkraft och luftfart.</p>"},"haken":{"name":"Haken","bio":"<p><strong>Wolfgang Haken</strong> (född 1928) är en tysk matematiker, känd för sitt bevis på <em>fyra färger teorem</em> med Kenneth Appel. Som erkännande fick han och Appell Fulkersonpriset från American Mathematical Society. 1990 blev Haken medlem av Center for Advanced Study vid University of Illinois, där han nu är professor i emeritus.</p>"},"appel":{"name":"Appel","bio":"<p><strong>Kenneth Appel</strong> (1932 - 2013) var en amerikansk matematiker, känd för sitt bevis på fyra färger teorem med Wolfgang Haken.</p><p>Som erkännande fick han och Haken Fulkersonpriset från American Mathematical Society.</p><p>Appel studerade vid Queens College, New York och University of Michigan. Han undervisade vid University of Illinois och University of New Hampshire.</p>"},"karinthy":{"name":"Karinthy","bio":"<p><strong>Frigyes Karinthy</strong> (1887 - 1938) var en ungersk författare, poet och journalist. Han är mest känd för novellen 1929 \"Kedjor\", som först introducerade begreppet <em>sex grader av separation</em>.</p>"},"milgram":{"name":"Milgram","bio":"<p><strong>Stanley Milgram</strong> (1933 - 1984) var en berömd socialpsykolog. Han är mest känd för experiment på <em>lydnad</em>, och testat hur villiga vuxna är att följa beställningar, även när de skadar andra, och för <em>experiment i små världen</em>, som testar graden av koppling av samhällen.</p>"}}