{"euler":{"name":"Euler","born":1707,"died":1783,"bio":"<p><strong>Leonhard Euler</strong> (1707 – 1783) a fost unul dintre cei mai mari matematicieni din istorie. Munca sa acoperă toate ramurile matematicii și el a scris 80 de volume de cercetare.</p><p>Euler s-a născut în Elveția și a studiat la Basel, dar a trăit marea parte a vieții sale în Berlin, Prusia și în St. Petersburg, Rusia.</p><p>Euler a inventat o mare parte din terminologia și notațiile matematicii moderne și a făcut descoperiri importante în analiză, teoria grafurilor, fizică, astronomie și în multe alte subiecte.</p>","links":[{"title":"Königsberg Bridges Problem","url":"/course/graph-theory/bridges"},{"title":"Euler’s Formula","url":"/course/graph-theory/planar-graphs"},{"title":"Polyhedrons"}]},"guthrie":{"name":"Guthrie","bio":"<p><strong>Francis Guthrie</strong> (1831 - 1899) a fost un botanist și matematician sud-african, care a declarat pentru prima dată problema celor patru culori în 1852. El a fost un student al lui Augustus De Morgan, unul dintre cei mai mari matematicieni britanici. Pe lângă faptul că este profesor și profesor de matematică, Guthrie a lucrat ca avocat și a făcut cercetări în energie solară și aeronautică.</p>"},"haken":{"name":"Haken","bio":"<p><strong>Wolfgang Haken</strong> (n. 1928) este un matematician german, cunoscut pentru dovada lui <em>Teorema de patru culori</em> cu Kenneth Appel. În semn de recunoaștere, el și Appell au primit Premiul Fulkerson al Societății Americane de Matematică. În 1990, Haken a devenit membru al Centrului de Studii Avansate de la Universitatea din Illinois, unde acum este profesor emerit.</p>"},"appel":{"name":"Appel","bio":"<p><strong>Kenneth Appel</strong> (1932 - 2013) a fost un matematician american, cunoscut pentru dovada sa de teorema celor patru culori cu Wolfgang Haken.</p><p>În semn de recunoaștere, el și Haken au primit premiul Fulkerson al Societății Americane de Matematică.</p><p>Appel a studiat la Queens College, New York și la Universitatea din Michigan. A predat la Universitatea din Illinois și la Universitatea din New Hampshire.</p>"},"karinthy":{"name":"Karinthy","bio":"<p><strong>Frigyes Karinthy</strong> (1887 - 1938) a fost un autor, poet și jurnalist maghiar. Este cel mai cunoscut pentru povestea scurtă „Lanțuri” din 1929, care a introdus pentru prima dată conceptul de <em>șase grade de separare</em>.</p>"},"milgram":{"name":"Milgram","bio":"<p><strong>Stanley Milgram</strong> (1933 - 1984) a fost un psiholog social celebru. El este cel mai cunoscut pentru experimentele pe <em>ascultare</em>, testând cât de dispuși sunt adulții să urmeze ordinele, chiar și când rănesc pe alții, și pentru <em>experiment pentru lumea mică</em>, care testează gradul de conectare a societățile.</p>"}}