{"euler":{"name":"Euler","full":"Leonhard Euler","born":1707,"died":1783,"bio":"<p><strong>Leonhard Euler</strong> (1707 – 1783) was one the greatest mathematicians in history. His work spans all areas of mathematics, and he wrote 80 volumes of research.</p><p>Euler was born in Switzerland and studied in Basel, but lived most of his life in Berlin, Prussia, and St. Petersburg, Russia.</p><p>Euler invented much of the modern mathematical terminology and notation, and made important discoveries in calculus, analysis, graph theory, physics, astronomy, and many other topics.</p>","links":[{"title":"Königsberg Bridges Problem","url":"/course/graph-theory/bridges"},{"title":"Euler’s Formula","url":"/course/graph-theory/planar-graphs"},{"title":"Polyhedrons","url":"/course/polyhedra/polyhedra"}]},"guthrie":{"name":"Guthrie","bio":"<p><strong>Francis Guthrie</strong> (1831 – 1899) was a South African botanist and mathematician, who first stated the Four Colour Problem in 1852. He was a student of Augustus De Morgan, one of the greatest British mathematicians. In addition to being a mathematics professor and teacher, Guthrie worked as a lawyer and did research in solar power and aeronautics.</p>"},"haken":{"name":"Haken","bio":"<p><strong>Wolfgang Haken</strong> (born 1928) is a German mathematician, known for his proof the <em>Four Colour Theorem</em> with Kenneth Appel. In recognition, he and Appell received the Fulkerson Prize of the American Mathematical Society. In 1990, Haken became a member of the Center for Advanced Study at the University of Illinois, where he is now an Emeritus Professor.</p>"},"appel":{"name":"Appel","bio":"<p><strong>Kenneth Appel</strong> (1932 – 2013) was an American mathematician, known for his proof of the Four Colour Theorem with Wolfgang Haken.</p><p>In recognition, he and Haken received the Fulkerson Prize of the American Mathematical Society.</p><p>Appel studied at Queens College, New York, and the University of Michigan. He taught at the University of Illinois, and the University of New Hampshire.</p>"},"karinthy":{"name":"Karinthy","bio":"<p><strong>Frigyes Karinthy</strong> (1887 – 1938) was a Hungarian author, poet and journalist. He is best known for the 1929 short story “Chains”, which first introduced the concept of <em>six degrees of separation</em>.</p>"},"milgram":{"name":"Milgram","bio":"<p><strong>Stanley Milgram</strong> (1933 – 1984) was a famous social psychologist. He is best known for experiments on <em>obedience</em>, testing how willing adults are to follow orders, even when hurting others, and for the <em>small-world experiment</em>, which tests the degree of connectedness of societies.</p>"}}