{"euler":{"name":"Euler","born":1707,"died":1783,"bio":"<p><strong>Leonhard Euler</strong> (1707 - 1783) là một trong những nhà toán học vĩ đại nhất trong lịch sử. Công việc của ông trải dài trên tất cả các lĩnh vực toán học, và ông đã viết 80 tập nghiên cứu.</p><p>Euler sinh ra ở Thụy Sĩ và học tại Basel, nhưng sống phần lớn cuộc đời ở Berlin, Phổ và St. Petersburg, Nga.</p><p>Euler đã phát minh ra nhiều thuật ngữ và ký hiệu toán học hiện đại, và thực hiện những khám phá quan trọng trong tính toán, phân tích, lý thuyết đồ thị, vật lý, thiên văn học, và nhiều chủ đề khác.</p>","links":[{"title":"Königsberg Bridges Problem","url":"/course/graph-theory/bridges"},{"title":"Euler’s Formula","url":"/course/graph-theory/planar-graphs"},{"title":"Polyhedrons","url":"/course/polyhedra/polyhedra"}]},"guthrie":{"name":"Guthrie","bio":"<p><strong>Francis Guthrie</strong> (1831 - 1899) là nhà thực vật học và toán học người Nam Phi, người đầu tiên đã phát biểu vấn đề Bốn màu vào năm 1852. Ông là học sinh của Augustus De Morgan, một trong những nhà toán học vĩ đại nhất của Anh. Ngoài việc là một giáo sư toán học và giáo viên, Guthrie còn làm luật sư và nghiên cứu về năng lượng mặt trời và hàng không.</p>"},"haken":{"name":"Haken","bio":"<p><strong>Wolfgang Haken</strong> (sinh năm 1928) là một nhà toán học người Đức, được biết đến với bằng chứng <em>Định lý bốn màu</em> với Kenneth Appel. Để công nhận, ông và Appell đã nhận được giải thưởng Fulkerson của Hiệp hội toán học Hoa Kỳ. Năm 1990, Haken trở thành thành viên của Trung tâm nghiên cứu nâng cao tại Đại học Illinois, nơi ông hiện là Giáo sư danh dự.</p>"},"appel":{"name":"Appel","bio":"<p><strong>Kenneth Appel</strong> (1932 - 2013) là một nhà toán học người Mỹ, được biết đến với bằng chứng về Định lý Bốn màu với Wolfgang Haken.</p><p>Để công nhận, ông và Haken đã nhận được giải thưởng Fulkerson của Hiệp hội toán học Hoa Kỳ.</p><p>Appel học tại trường cao đẳng Queens, New York và Đại học Michigan. Ông giảng dạy tại Đại học Illinois và Đại học New Hampshire.</p>"},"karinthy":{"name":"Karinthy","bio":"<p><strong>Frigyes Karinthy</strong> (1887 - 1938) là một tác giả, nhà thơ và nhà báo người Hungary. Ông được biết đến nhiều nhất với truyện ngắn 1929, Chains Chains, lần đầu tiên đưa ra khái niệm <em>sáu độ phân cách</em>.</p>"},"milgram":{"name":"Milgram","bio":"<p><strong>Stanley Milgram</strong> (1933 - 1984) là một nhà tâm lý học xã hội nổi tiếng. Anh ta nổi tiếng với các thí nghiệm về <em>vâng lời</em>, kiểm tra xem người lớn sẵn sàng tuân theo mệnh lệnh như thế nào, ngay cả khi làm tổn thương người khác và cho <em>thí nghiệm thế giới nhỏ</em>, kiểm tra mức độ kết nối của xã hội.</p>"}}