{"euler":{"name":"Euler","born":1707,"died":1783,"bio":"<p><strong>Leonhard Euler</strong> (1707 - 1783) tarixin ən böyük riyaziyyatçılarından biri idi. Onun işi riyaziyyatın bütün sahələrini əhatə edir və 80 cildlik tədqiqat yazmışdır.</p><p>Euler İsveçrədə anadan olmuş və Bazeldə oxumuş, lakin ömrünün çox hissəsini Berlində, Prussiyada və Sankt-Peterburqda keçirmişdir.</p><p>Euler müasir riyazi terminologiyanın və notasiyanın çoxunu icad etdi, hesablama, təhlil, qrafika nəzəriyyəsi, fizika, astronomiya və bir çox digər mövzularda mühüm kəşflər etdi.</p>","links":[{"title":"Königsberg Bridges Problem","url":"/course/graph-theory/bridges"},{"title":"Euler’s Formula","url":"/course/graph-theory/planar-graphs"},{"title":"Polyhedrons","url":"/course/polyhedra/polyhedra"}]},"guthrie":{"name":"Guthrie","bio":"<p><strong>Francis Guthrie</strong> (1831 - 1899) Cənubi Afrikalı botanik və riyaziyyatçı idi, 1852-ci ildə Dörd Rəng Problemini ilk ifadə etdi. O, ən böyük İngilis riyaziyyatçılarından biri Augustus De Morganın tələbəsi idi. Riyaziyyat professoru və müəllimi olmaqdan əlavə Guthrie bir hüquqşünas olaraq çalışdı və günəş enerjisi və aeronavtika sahəsində araşdırmalar etdi.</p>"},"haken":{"name":"Haken","bio":"<p><strong>Wolfgang Haken</strong> (1928-ci il təvəllüdlü) - Alman riyaziyyatçısıdır, Kenneth Appel ilə birlikdə <em>Dörd Rəng Teoremi</em> sübutu ilə məşhurdur. Tanınmasıyla, o və Appell Amerika Riyaziyyat Cəmiyyətinin Fulkerson mükafatını aldılar. 1990-cı ildə Haken, indi də Emeritus Prof.</p>"},"appel":{"name":"Appel","bio":"<p><strong>Kenneth Appel</strong> (1932 - 2013) Wolfgang Haken ilə Dörd Rəng Teoreminin sübutu ilə tanınan bir amerikalı riyaziyyatçı idi.</p><p>Tanınmasıyla o və Haken Amerika Riyaziyyat Cəmiyyətinin Fulkerson mükafatını aldılar.</p><p>Appel Nyu-Yorkdakı Queens Kollecində və Michigan Universitetində təhsil almışdır. İllinoys Universitetində və Nyu Hampşir Universitetində dərs demişdir.</p>"},"karinthy":{"name":"Karinthy","bio":"<p><strong>Frigyes Karinthy</strong> (1887 - 1938) macar yazıçısı, şairi və jurnalisti idi. 1929-cu ildə \"Zəncirlər\" qısa hekayəsi ilə məşhurdur, ilk olaraq <em>altı dərəcə ayrılma</em> anlayışını təqdim etmişdir.</p>"},"milgram":{"name":"Milgram","bio":"<p><strong>Stenley Milgram</strong> (1933 - 1984) məşhur sosial psixoloq idi. O, ən yaxşısı <em>itaət</em> üzrə təcrübələr, böyüklərin əmrlərə tabe olmağa hazır olduqlarını, başqalarına zərər verdikdə də necə olmağını sınamaq və əlaqələrin dərəcəsini sınayan <em>kiçik dünya təcrübəsi</em> üçün ən yaxşı bilinir. cəmiyyətlər.</p>"}}