{"euler":{"name":"Euler","born":1707,"died":1783,"bio":"<p><strong>Leonhard Euler</strong> (1707 - 1783) était l'un des plus grands mathématiciens de l'histoire. Son travail couvre tous les domaines des mathématiques et il a écrit 80 volumes de recherche.</p><p>Euler est né en Suisse et a étudié à Bâle, mais a vécu la majeure partie de sa vie à Berlin, en Prusse et à Saint-Pétersbourg, en Russie.</p><p>Euler a inventé une grande partie de la terminologie et de la notation mathématiques modernes, et a fait d'importantes découvertes en calcul, analyse, théorie des graphes, physique, astronomie et de nombreux autres sujets.</p>","links":[{"title":"Königsberg Bridges Problem","url":"/course/graph-theory/bridges"},{"title":"Euler’s Formula","url":"/course/graph-theory/planar-graphs"},{"title":"Polyhedrons","url":"/course/polyhedra/polyhedra"}]},"guthrie":{"name":"Guthrie","bio":"<p><strong>Francis Guthrie</strong> (1831 - 1899) était un botaniste et mathématicien sud-africain, qui a déclaré pour la première fois le problème des quatre couleurs en 1852. Il était l'élève d'Augustus De Morgan, l'un des plus grands mathématiciens britanniques. En plus d'être professeur et professeur de mathématiques, Guthrie a travaillé comme avocat et a effectué des recherches sur l'énergie solaire et l'aéronautique.</p>"},"haken":{"name":"Haken","bio":"<p><strong>Wolfgang Haken</strong> (né en 1928) est un mathématicien allemand, connu pour sa preuve le <em>théorème des quatre couleurs</em> avec Kenneth Appel. En reconnaissance, lui et Appell ont reçu le prix Fulkerson de l'American Mathematical Society. En 1990, Haken est devenu membre du Center for Advanced Study de l'Université de l'Illinois, où il est maintenant professeur émérite.</p>"},"appel":{"name":"Appel","bio":"<p><strong>Kenneth Appel</strong> (1932 - 2013) était un mathématicien américain, connu pour sa preuve du théorème des quatre couleurs avec Wolfgang Haken.</p><p>En reconnaissance, lui et Haken ont reçu le prix Fulkerson de l'American Mathematical Society.</p><p>Appel a étudié au Queens College de New York et à l'Université du Michigan. Il a enseigné à l'Université de l'Illinois et à l'Université du New Hampshire.</p>"},"karinthy":{"name":"Karinthy","bio":"<p><strong>Frigyes Karinthy</strong> (1887 - 1938) était un auteur, poète et journaliste hongrois. Il est surtout connu pour l'histoire courte \"Chaînes\" de 1929, qui a introduit pour la première fois le concept de <em>six degrés de séparation</em>.</p>"},"milgram":{"name":"Milgram","bio":"<p><strong>Stanley Milgram</strong> (1933 - 1984) était un célèbre psychologue social. Il est surtout connu pour ses expériences sur <em>l'obéissance</em>, pour tester la volonté des adultes de suivre les ordres, même lorsqu'ils blessent les autres, et pour <em>l'expérience du petit monde</em>, qui teste le degré de connectivité de sociétés.</p>"}}