{"euler":{"name":"Euler","born":1707,"died":1783,"bio":"<p>लियोनहार्ड यूलर (१ 17० 17 - १ was was३) इतिहास के सबसे महान गणितज्ञ थे। उनका काम गणित के सभी क्षेत्रों तक फैला हुआ है, और उन्होंने 80 खंडों का शोध लिखा है।</p><p>यूलर का जन्म स्विट्जरलैंड में हुआ था और उसने बेसेल में अध्ययन किया, लेकिन वह अपना अधिकांश जीवन बर्लिन, प्रशिया और सेंट पीटर्सबर्ग, रूस में रहा।</p><p>यूलर ने आधुनिक गणितीय शब्दावली और संकेतन का बहुत आविष्कार किया और कलन, विश्लेषण, ग्राफ सिद्धांत, भौतिकी, खगोल विज्ञान और कई अन्य विषयों में महत्वपूर्ण खोजें कीं।</p>","links":[{"title":"Königsberg Bridges Problem","url":"/course/graph-theory/bridges"},{"title":"Euler’s Formula","url":"/course/graph-theory/planar-graphs"},{"title":"Polyhedrons","url":"/course/polyhedra/polyhedra"}]},"guthrie":{"name":"Guthrie","bio":"<p>__फ्रांसिस गुथरी (१ 18३१ - १ was ९९) एक दक्षिण अफ्रीकी वनस्पतिशास्त्री और गणितज्ञ थे, जिन्होंने पहली बार १.५२ में फोर कलर प्रॉब्लम की बात कही थी। वे ऑगस्टस डी मॉर्गन के छात्र थे, जो सबसे महान ब्रिटिश गणितज्ञों में से एक थे। गणित के प्रोफेसर और शिक्षक होने के अलावा, गुथ्री ने एक वकील के रूप में काम किया और सौर ऊर्जा और एयरोनॉटिक्स में शोध किया।</p>"},"haken":{"name":"Haken","bio":"<p><strong>वोल्फगैंग होकेन</strong> (जन्म 1928) एक जर्मन गणितज्ञ है, जो केनेथ एपेल के साथ अपने सबूत <em>फोर कलर थ्योरम</em> के लिए जाना जाता है। मान्यता में, उन्हें और एपेल को अमेरिकन गणितीय सोसायटी का फुलकर्सन पुरस्कार मिला। 1990 में, इलिनोइस विश्वविद्यालय में हेकन सेंटर फॉर एडवांस स्टडी के सदस्य बने, जहाँ वे अब एमेरिटस प्रोफेसर हैं।</p>"},"appel":{"name":"Appel","bio":"<p>केनेथ एपेल (१ ९ ३२ - २०१३) एक अमेरिकी गणितज्ञ थे, जो वुल्फगैंग हॉक के साथ फोर कलर प्रमेय के अपने प्रमाण के लिए जाने जाते थे।</p><p>मान्यता में, उन्हें और हेकन को अमेरिकन मैथमैटिकल सोसाइटी का फुलकर्सन पुरस्कार मिला।</p><p>एपल ने क्वींस कॉलेज, न्यूयॉर्क और मिशिगन विश्वविद्यालय में अध्ययन किया। उन्होंने इलिनोइस विश्वविद्यालय और न्यू हैम्पशायर विश्वविद्यालय में पढ़ाया।</p>"},"karinthy":{"name":"Karinthy","bio":"<p>फ्रिगेस कारिन्थी (१ 19 19- १ ९ ३ was) एक हंगेरियन लेखक, कवि और पत्रकार थे। उन्हें 1929 की लघु कहानी \"चेन्स\" के लिए जाना जाता है, जिसने पहली बार <em>छह डिग्री पृथक्करण</em> की अवधारणा पेश की।</p>"},"milgram":{"name":"Milgram","bio":"<p><strong>स्टेनली मिलग्राम</strong> (1933 - 1984) एक प्रसिद्ध सामाजिक मनोवैज्ञानिक थे। वह सबसे अच्छा <em>आज्ञाकारिता</em> पर प्रयोगों के लिए जाना जाता है, परीक्षण करता है कि वयस्क कैसे आदेश का पालन करने के लिए तैयार हैं, यहां तक कि दूसरों को चोट पहुंचाने के लिए, और <em>छोटे-विश्व प्रयोग</em> के लिए, जो कि जुड़े की डिग्री का परीक्षण करता है समाज।</p>"}}