{"euler":{"name":"Euler","born":1707,"died":1783,"bio":"<p><strong>Leonhard Euler</strong> (1707 - 1783) foi um dos maiores matemáticos da história. Seu trabalho abrange todas as áreas da matemática e ele escreveu 80 volumes de pesquisa.</p><p>Euler nasceu na Suíça e estudou em Basileia, mas viveu a maior parte de sua vida em Berlim, Prússia e São Petersburgo, Rússia.</p><p>Euler inventou grande parte da terminologia e notação matemática moderna e fez importantes descobertas em cálculo, análise, teoria de grafos, física, astronomia e muitos outros tópicos.</p>","links":[{"title":"Königsberg Bridges Problem","url":"/course/graph-theory/bridges"},{"title":"Euler’s Formula","url":"/course/graph-theory/planar-graphs"},{"title":"Polyhedrons","url":"/course/polyhedra/polyhedra"}]},"guthrie":{"name":"Guthrie","bio":"<p><strong>Francis Guthrie</strong> (1831 - 1899) foi um botânico e matemático sul-africano, que primeiro declarou o Problema das Quatro Cores em 1852. Ele era aluno de Augustus De Morgan, um dos maiores matemáticos britânicos. Além de professor e professor de matemática, Guthrie trabalhou como advogado e pesquisou em energia solar e aeronáutica.</p>"},"haken":{"name":"Haken","bio":"<p><strong>Wolfgang Haken</strong> (nascido em 1928) é um matemático alemão, conhecido por sua prova do <em>Teorema das Quatro Cores</em> com Kenneth Appel. Em reconhecimento, ele e Appell receberam o Prêmio Fulkerson da Sociedade Americana de Matemática. Em 1990, Haken tornou-se membro do Centro de Estudos Avançados da Universidade de Illinois, onde agora é professor emérito.</p>"},"appel":{"name":"Appel","bio":"<p>Kenneth Appel__ (1932 - 2013) era um matemático americano, conhecido por sua prova do Teorema das Quatro Cores com Wolfgang Haken.</p><p>Em reconhecimento, ele e Haken receberam o Prêmio Fulkerson da Sociedade Americana de Matemática.</p><p>Appel estudou no Queens College, em Nova York e na Universidade de Michigan. Ele ensinou na Universidade de Illinois e na Universidade de New Hampshire.</p>"},"karinthy":{"name":"Karinthy","bio":"<p>Frigyes Karinthy undefined (1887 - 1938) foi um autor, poeta e jornalista húngaro. Ele é mais conhecido pelo conto de 1929 \"Chains\", que introduziu o conceito de <em>seis graus de separação</em>.</p>"},"milgram":{"name":"Milgram","bio":"<p>Stanley Milgram (1933 - 1984) foi um famoso psicólogo social. Ele é mais conhecido por experimentos em <em>obediência</em>, testando como os adultos estão dispostos a seguir ordens, mesmo quando magoam os outros, e pelo <em>experimento em mundo pequeno</em>, que testa o grau de conexão de sociedades.</p>"}}