{"graph":{"title":"Đồ thị","text":"<p>Biểu đồlà tập hợp các đỉnh được kết nối bởi các cạnh.</p>","link":"/course/graph-theory/introduction"},"directed-graph":{"title":"Đồ thị có hướng","text":"<p>Trong đồ thị có hướng ____, mọi cạnh đều có một mũi tên của Google, tức là một đỉnh bắt đầu và một đỉnh kết thúc.</p>","link":"/course/graph-theory/introduction#intro-1"},"subgraph":{"title":"Biểu đồ con","text":"<p>Biểu đồ là một sơ đồ concủa một biểu đồ khác, nếu nó được hình thành bởi một tập hợp con của các cạnh và đỉnh đồ thị lớn hơn.</p>","link":"/course/graph-theory/introduction#intro-2"},"graph-order":{"title":"Đặt hàng","text":"<p>Thứ tựcủa đồ thị là số đỉnh trong nó.</p>","link":"/course/graph-theory/introduction#intro-3"},"graph-degree":{"title":"Trình độ","text":"<p><strong>độ</strong> của một đỉnh là số cạnh gặp nhau ở đỉnh đó.</p>","link":"/course/graph-theory/introduction#intro-3"},"complete-graph":{"title":"Đồ thị hoàn chỉnh","text":"<p>Trong <strong>đồ thị hoàn chỉnh</strong>, mọi đỉnh được kết nối với mọi đỉnh khác. Một đồ thị hoàn chỉnh với các đỉnh <em>n</em> có các cạnh <span class=\"nowrap\"><span class=\"math\" data-voice=\"n times open bracket n minus 1 close bracket over 2\"><mfrac><mrow><mi>n</mi><mo value=\"×\">×</mo><mfenced open=\"(\" close=\")\"><mi>n</mi><mo value=\"−\">−</mo><mn>1</mn></mfenced></mrow><mn>2</mn></mfrac></span>.</span></p>","link":"/course/graph-theory/handshakes#handshakes-3"},"bipartite-graph":{"title":"Đồ thị hai bên","text":"<p>Một đồ thị lưỡng cực (hoàn chỉnh)bao gồm hai bộ đỉnh. Mỗi đỉnh được kết nối với tất cả các đỉnh trong tập đối diện, nhưng không có đỉnh nào trong tập riêng của nó.</p>","link":"/course/graph-theory/handshakes#handshakes-4"},"subdivision":{"title":"Phân khu","text":"<p>Để tạo phân vùngcủa biểu đồ, bạn thêm các đỉnh bổ sung dọc theo các cạnh của nó.</p>"},"proof":{"title":"Bằng chứng","text":"<p>Bằng chứnglà một đối số logic cho thấy vượt quá mọi nghi ngờ rằng một tuyên bố nào đó là đúng.</p>"},"polyhedron":{"title":"Khối đa diện","text":"<p>Một đa diện(số nhiều là <em>polyhedra</em>) là một vật rắn ba chiều không có bề mặt hoặc cạnh cong. Tất cả các mặt của khối đa diện đều là đa giác. Ví dụ, một khối lập phương và một kim tự tháp là khối đa diện, nhưng một hình cầu thì không.</p>","link":"/course/polyhedra/polyhedra"},"polygon":{"title":"Đa giác","text":"<p>Đa giáclà hình dạng hình học được tạo thành từ các đoạn thẳng. Đa giác không thể chứa bất kỳ cạnh cong hoặc lỗ. Ví dụ, hình vuông là một đa giác nhưng hình tròn thì không.</p>","image":"polygon.svg","link":"/course/polyhedra/polygons#polygons"},"dna":{"title":"BỆNH GOUT","text":"<p><strong>DNA</strong> (Axit Deoxyribonucleic) là một phân tử có chứa bản thiết kế di truyền của tất cả các sinh vật sống. Hầu hết các DNA bao gồm hai chuỗi tạo thành chuỗi xoắn kép <em>_. Thông tin di truyền được mã hóa theo thứ tự bốn axit nucleic (A, G, C và T) tạo nên DNA. _Trình tự DNA</em> là quá trình trích xuất thông tin này - một kỹ thuật thiết yếu trong sinh học, y học, di truyền và công nghệ sinh học.</p>"},"np":{"title":"Vấn đề khó khăn của NP","text":"<p><em>Lý thuyết về độ phức tạp tính toán</em> là về việc xác định cách giải quyết các vấn đề khó khăn của người dùng máy tính. <strong>NP hard</strong> (độ khó đa thức thời gian không xác định) là lớp của các vấn đề khó khăn nhất.</p>"},"millennium-prize":{"title":"Vấn đề giải thưởng thiên niên kỷ","text":"<p>Bảy <strong>Vấn đề Giải thưởng Thiên niên kỷ</strong> là một số vấn đề mở khó nhất trong Toán học. Chúng được liệt kê vào năm 2000 bởi <em>Viện toán học Clay</em> và mỗi người giữ phần thưởng trị giá 1 triệu đô la:</p><ul> <li><p>P vs NP</p></li><li><p>Phỏng đoán Hodge</p></li><li><p>Giả thuyết Poincaré</p></li><li><p>Giả thuyết Riemann</p></li><li><p>Sự tồn tại của Yang-Mills và khoảng cách lớn</p></li><li><p>Sự tồn tại và mượt mà của Navier-Stokes</p></li><li><p>Giả thuyết của Birch và Swinnerton-Dyer</p></li></ul> <p>Cho đến nay, chỉ một trong những vấn đề, <em>Poincaré Conjecture</em>, đã được giải quyết. Tuy nhiên, nhà toán học đã giải nó, Grigori Perelman, đã từ chối giải thưởng.</p>"}}