{"graph":{"title":"Grafico","text":"<p>Un <strong>grafico</strong> è una raccolta di vertici collegati da bordi.</p>","link":"/course/graph-theory/introduction"},"directed-graph":{"title":"Grafico diretto","text":"<p>In un <strong>grafico diretto</strong>, ogni bordo ha una \"freccia\", cioè un vertice iniziale e un vertice finale.</p>","link":"/course/graph-theory/introduction#intro-1"},"subgraph":{"title":"sottografo","text":"<p>Un grafico è un <strong>sottografo</strong> di un altro grafico, se è formato da un sottoinsieme dei bordi e dei vertici dei grafici più grandi.</p>","link":"/course/graph-theory/introduction#intro-2"},"graph-order":{"title":"Ordine","text":"<p>L'ordinedi un grafico è il numero di vertici in esso.</p>","link":"/course/graph-theory/introduction#intro-3"},"graph-degree":{"title":"Grado","text":"<p>Il <strong>grado</strong> di un vertice è il numero di spigoli che si incontrano in quel vertice.</p>","link":"/course/graph-theory/introduction#intro-3"},"graph-cycle":{"title":"Ciclo","text":"<p><strong>I cicli</strong> sono grafici costituiti da un singolo ciclo di vertici.</p>","link":"/course/graph-theory/introduction#intro-4"},"complete-graph":{"title":"Grafico completo","text":"<p>Nei <strong>grafici completi</strong>, ogni vertice è collegato ad ogni altro vertice. Un grafico completo con <em>n</em> vertici ha <span class=\"math\" data-voice=\"n times open bracket n minus 1 close bracket over 2\"><mfrac><mrow><mi>n</mi><mo value=\"×\">×</mo><mfenced open=\"(\" close=\")\"><mi>n</mi><mo value=\"−\">−</mo><mn>1</mn></mfenced></mrow><mn>2</mn></mfrac></span> bordi.</p>","link":"/course/graph-theory/handshakes#handshakes-3"},"bipartite-graph":{"title":"Grafico bipartito","text":"<p>Un (completo) <strong>grafico bipartito</strong> è costituito da due serie di vertici. Ogni vertice è collegato a tutti i vertici nel set opposto, ma nessuno dei vertici nel suo set.</p>","link":"/course/graph-theory/handshakes#handshakes-4"},"subdivision":{"title":"suddivisioni","text":"<p>Per creare una suddivisionedi un grafico, aggiungi vertici aggiuntivi lungo i suoi bordi.</p>"},"proof":{"title":"Prova","text":"<p>Una <strong>prova</strong> è un argomento logico che mostra oltre ogni dubbio che una certa affermazione è vera.</p>"},"polyhedron":{"title":"Poliedro","text":"<p>Un <strong>poliedro</strong> (il plurale è <em>poliedri</em>) è un solido tridimensionale senza superfici curve o bordi. Tutte le facce di un poliedro sono poligoni. Ad esempio, un cubo e una piramide sono poliedri, ma una sfera no.</p>","link":"/course/polyhedra/polyhedra"},"polygon":{"title":"Poligono","text":"<p>Un poligonoè una forma geometrica costituita da segmenti di retta. I poligoni non possono contenere lati curvi o fori. Ad esempio, un quadrato è un poligono ma un cerchio no.</p>","image":"polygon.svg","link":"/course/polyhedra/polygons#polygons"},"dna":{"title":"GOTTA","text":"<p><strong>DNA</strong> (acido desossiribonucleico) è una molecola che contiene il modello genetico di tutti gli organismi viventi. La maggior parte dei DNA è costituita da due filamenti che formano una <em>doppia elica</em>. Le informazioni genetiche sono codificate nell'ordine di quattro acidi nucleici (A, G, C e T) che compongono il DNA. <em>Il sequenziamento del DNA</em> è il processo di estrazione di queste informazioni, una tecnica essenziale in biologia, medicina, genetica e biotecnologia.</p>"},"np":{"title":"NP Difficoltà","text":"<p><em>La teoria della complessità computazionale</em> riguarda la determinazione di come i problemi \"difficili\" debbano essere risolti da un computer. <strong>NP hard</strong> (tempo polinomiale non deterministico difficile) è la classe dei problemi più difficili.</p>"},"millennium-prize":{"title":"Problemi del premio del millennio","text":"<p>I sette <strong>Millennium Prize Problems</strong> sono alcuni dei problemi aperti più difficili in Matematica. Sono stati elencati nel 2000 dal <em>Clay Mathematics Institute</em>, e ognuno ha un premio di $ 1 milione:</p><ul> <li><p>P vs NP</p></li><li><p>La congettura di Hodge</p></li><li><p>La congettura di Poincaré</p></li><li><p>L'ipotesi di Riemann</p></li><li><p>Esistenza e gap di massa di Yang-Mills</p></li><li><p>Esistenza e fluidità di Navier-Stokes</p></li><li><p>La congettura di Birch e Swinnerton-Dyer</p></li></ul> <p>Finora, solo uno dei problemi, la <em>congettura di Poincaré</em>, è stato risolto. Tuttavia, il matematico che lo ha risolto, Grigori Perelman, ha rifiutato il premio.</p>"}}