{"graph":{"title":"Graph","text":"<p>Ein <strong>Graph</strong> ist eine Menge von Knoten, die durch Kanten verbunden sind.</p>","link":"/course/graph-theory/introduction"},"directed-graph":{"title":"Gerichteter Graph","text":"<p>In einem <strong>gerichteten Graphen</strong>, wird jede Kante als Pfeil dargestellt, d.h. es gibt jeweils einen Start- und einen Endknoten.</p>","link":"/course/graph-theory/introduction#intro-1"},"subgraph":{"title":"Teilgraph","text":"<p>Ein Graph ist ein <strong>Teilgraph</strong> eines anderen Graphen, wenn er durch eine Teilmenge von dessen Kanten und Knoten gebildet wird.</p>","link":"/course/graph-theory/introduction#intro-2"},"graph-order":{"title":"Ordnung","text":"<p>Die <strong>Ordnung</strong> eines Graphen entspricht der Anzahl seiner Knoten in ihm.</p>","link":"/course/graph-theory/introduction#intro-3"},"graph-cycle":{"title":"Zyklus","text":"<p><strong>Zyklen</strong> sind Graphen, die aus einem geschlossenen Ring von Knoten bestehen.</p>","link":"/course/graph-theory/introduction#intro-4"},"graph-degree":{"title":"Grad","text":"<p>Der <strong>Grad</strong> eines Knoten ist die Anzahl der Kanten, die sich an diesem Knoten treffen.</p>","link":"/course/graph-theory/introduction#intro-3"},"complete-graph":{"title":"Vollständiger Graph","text":"<p>In <strong>vollständigen Graphen</strong>ist jeder Knoten mit jedem anderen Knoten verbunden. Ein vollständiger Graph mit <em>n</em> Knoten hat <span class=\"math\" data-voice=\"n times open bracket n minus 1 close bracket over 2\"><mfrac><mrow><mi>n</mi><mo value=\"×\">×</mo><mfenced open=\"(\" close=\")\"><mi>n</mi><mo value=\"−\">−</mo><mn>1</mn></mfenced></mrow><mn>2</mn></mfrac></span> Kanten.</p>","link":"/course/graph-theory/parties-and-dating#handshakes-3"},"bipartite-graph":{"title":"Bipartiter Graph","text":"<p><strong>Bipartite Graphen</strong> bestehen aus zwei Mengen von Eckpunkten. Jeder Knoten ist mit allen Knoten in der gegenüberliegenden Menge verbunden, aber keiner der Knoten in seiner eigenen Menge.</p>","link":"/course/graph-theory/parties-and-dating#handshakes-4"},"subdivision":{"title":"Unterteilungsgraphen","text":"<p>Um einen <strong>Unterteilungsgraphen</strong> eines Graphen zu erstellen, fügt man zusätzliche Knoten entlang seiner Kanten hinzu.</p>"},"proof":{"title":"Beweis","text":"<p>Ein <strong>Beweis</strong> ist ein logisches Argument, das ohne Zweifel zeigt, dass eine bestimmte Aussage wahr ist.</p>"},"polyhedron":{"title":"Polyeder","text":"<p>Ein <strong>Polyeder</strong> (auch <em>Vielflächler</em> genannt) ist ein dreidimensionaler Körper ohne gekrümmte Oberflächen oder Kanten. Alle Flächen eines Polyeders sind Vielecke. Zum Beispiel sind ein Würfel und eine Pyramide Polyeder, aber eine Kugel nicht.</p>","link":"/course/polyhedra/polyhedra"},"polygon":{"title":"Vieleck (Polygon)","text":"<p>Ein <strong>Vieleck</strong> ist eine geometrische Form, die aus geraden Strecken besteht. Vielecke dürfen keine gekrümmten Seiten oder Unterbrechungen enthalten. Zum Beispiel ist ein Quadrat ein Vieleck, ein Kreis aber nicht.</p>","image":"polygon.svg","link":"/course/polyhedra/polygons#polygons"},"dna":{"title":"DNA","text":"<p><strong>DNA</strong> (Desoxyribonukleinsäure) ist ein Molekül, das den genetischen Bauplan aller lebenden Organismen enthält. Die meisten DNAs bestehen aus zwei Strängen, die eine <em>Doppelhelix</em> bilden. Die genetische Information wird in der Größenordnung von vier Nukleinsäuren (A, G, C und T) kodiert, aus denen sich die DNA zusammensetzt. <em>DNA-Sequenzierung</em> ist der Prozess der Extraktion dieser Information - eine wesentliche Technik in Biologie, Medizin, Genetik und Biotechnologie.</p>"},"np":{"title":"NP Probleme","text":"<p>In der <em>Komplexitätstheorie</em> geht es darum, festzustellen, wie \"schwierig\" es ist Probleme durch einen Computer zu lösen. <strong>NP hard</strong> (non-deterministic polynomial-time hard) ist die Klasse der schwierigsten Probleme.</p>"},"millennium-prize":{"title":"Millennium-Probleme","text":"<p>Die sieben <strong>Millennium-Probleme</strong> gehören zu den schwierigsten offenen Problemen in der Mathematik. Sie wurden im Jahr 2000 vom <em>Clay Mathematics Institute</em> aufgelistet und mit jeweils einer Belohnung von 1 Million Dollar für die Lösung ausgeschrieben:</p><ul> <li>Lösung des P-NP-Problems</li><li>Beweis der Vermutung von Hodge</li><li>Beweis der Poincaré-Vermutung</li><li>Beweis der Riemannschen Vermutung</li><li>Erforschung der Gleichungen von Yang-Mills</li><li>Existenz und Regularität von Lösungen der Navier-Stokes-Gleichungen</li><li>Beweis der Vermutung von Birch und Swinnerton-Dyer</li></ul> <p>Bisher wurde nur eines der Probleme, die <em>Poincaré-Vermutung</em>, gelöst. Doch der Mathematiker, der es löste, Grigori Perelman, lehnte die Auszeichnung ab.</p>"}}