{"graph":{"title":"Graph","text":"<p>A <strong>graph</strong> is a collection of vertices connected by edges.</p>","link":"/course/graph-theory/introduction"},"directed-graph":{"title":"Directed Graph","text":"<p>In a <strong>directed graph</strong>, every edge has an “arrow”, i.e. a start vertex and an end vertex.</p>","link":"/course/graph-theory/introduction#intro-1"},"subgraph":{"title":"Subgraph","text":"<p>A graph is a <strong>subgraph</strong> of another graph, if it is formed by a subset of the larger graphs edges and vertices.</p>","link":"/course/graph-theory/introduction#intro-2"},"graph-order":{"title":"Order","text":"<p>The <strong>order</strong> of a graph is the number of vertices in it.</p>","link":"/course/graph-theory/introduction#intro-3"},"graph-degree":{"title":"Degree","text":"<p>The <strong>degree</strong> of a vertex is the number of edges that meet at that vertex.</p>","link":"/course/graph-theory/introduction#intro-3"},"graph-cycle":{"title":"Cycle","text":"<p><strong>Cycles</strong> are graphs that consist of a single loop of vertices.</p>","link":"/course/graph-theory/introduction#intro-4"},"complete-graph":{"title":"Complete graph","text":"<p>In <strong>complete graphs</strong>, every vertex is connected to every other vertex. A complete graph with <em>n</em> vertices has <span class=\"math\" data-voice=\"n times open bracket n minus 1 close bracket over 2\"><mfrac><mrow><mi>n</mi><mo value=\"×\">×</mo><mfenced open=\"(\" close=\")\"><mi>n</mi><mo value=\"−\">−</mo><mn>1</mn></mfenced></mrow><mn>2</mn></mfrac></span> edges.</p>","link":"/course/graph-theory/handshakes#handshakes-3"},"bipartite-graph":{"title":"Bipartite graph","text":"<p>A (complete) <strong>bipartite graph</strong> consists of two sets of vertices. Every vertex is connected to all the vertices in the opposite set, but none of the vertices in its own set.</p>","link":"/course/graph-theory/handshakes#handshakes-4"},"subdivision":{"title":"Subdivisions","text":"<p>To create a <strong>subdivision</strong> of a graph you add additional vertices along its edges.</p>"},"proof":{"title":"Proof","text":"<p>A <strong>proof</strong> is a logical argument that shows beyond any doubt that a certain statement is true.</p>"},"polyhedron":{"title":"Polyhedron","text":"<p>A <strong>polyhedron</strong> (the plural is <em>polyhedra</em>) is a three-dimensional solid with no curved surfaces or edges. All faces of a polyhedron are polygons. For example, a cube and a pyramid are polyhedra, but a sphere is not.</p>","link":"/course/polyhedra/polyhedra"},"polygon":{"title":"Polygon","text":"<p>A <strong>polygon</strong> is geometric shape that is made up of straight line segments. Polygons cannot contain any curved sides, or holes. For example, a square is a polygon but a circle is not.</p>","image":"polygon.svg","link":"/course/polyhedra/polygons#polygons"},"dna":{"title":"DNA","text":"<p><strong>DNA</strong> (deoxyribonucleic acid) is a molecule that contains the genetic blueprint of all living organisms. Most DNAs consist of two strands forming a <em>double helix</em>. Genetic information is encoded in the order of four nucleic acids (A, G, C and T) which make up the DNA. <em>DNA sequencing</em> is the process of extracting this information – an essential technique in biology, medicine, genetics and biotechnology.</p>"},"np":{"title":"NP hard problems","text":"<p><em>Computational complexity theory</em> is about determining how “difficult” problems are to be solved by a computer. <strong>NP hard</strong> (non-deterministic polynomial-time hard) is the class of the most difficult problems.</p>"},"millennium-prize":{"title":"Millennium prize problems","text":"<p>The seven <strong>Millennium prize problems</strong> are some of the most difficult open problems in Mathematics. They were listed in 2000 by the <em>Clay Mathematics Institute</em>, and each hold a $1m reward:</p><ul> <li>P vs NP</li><li>The Hodge conjecture</li><li>The Poincaré conjecture</li><li>The Riemann hypothesis</li><li>Yang-Mills existence and mass gap</li><li>Navier-Stokes existence and smoothness</li><li>The Birch and Swinnerton-Dyer conjecture</li></ul> <p>So far, just one of the problems, the <em>Poincaré conjecture</em>, has been solved. However the mathematician who solved it, Grigori Perelman, declined the award.</p>"}}