{"graph":{"title":"Gráfico","text":"<p>Um gráficoé uma coleção de vértices conectados por arestas.</p>","link":"/course/graph-theory/introduction"},"directed-graph":{"title":"Gráfico Dirigido","text":"<p>Em um gráfico direcionado ____, toda aresta possui uma “seta”, ou seja, um vértice inicial e um vértice final.</p>","link":"/course/graph-theory/introduction#intro-1"},"subgraph":{"title":"Subgráfico","text":"<p>Um gráfico é um <strong>subgrafo</strong> de outro gráfico, se for formado por um subconjunto das arestas e vértices maiores do gráfico.</p>","link":"/course/graph-theory/introduction#intro-2"},"graph-order":{"title":"Ordem","text":"<p>A <strong>ordem</strong> de um gráfico é o número de vértices nele.</p>","link":"/course/graph-theory/introduction#intro-3"},"graph-degree":{"title":"Grau","text":"<p>O <strong>grau</strong> de um vértice é o número de arestas que se encontram nesse vértice.</p>","link":"/course/graph-theory/introduction#intro-3"},"graph-cycle":{"title":"Ciclo","text":"<p><strong>Ciclos</strong> são gráficos que consistem em um único loop de vértices.</p>","link":"/course/graph-theory/introduction#intro-4"},"complete-graph":{"title":"Gráfico completo","text":"<p>Nos <strong>gráficos completos</strong>, todos os vértices estão conectados a todos os outros vértices. Um gráfico completo com <em>n</em> vértices possui <span class=\"math\" data-voice=\"n times open bracket n minus 1 close bracket over 2\"><mfrac><mrow><mi>n</mi><mo value=\"×\">×</mo><mfenced open=\"(\" close=\")\"><mi>n</mi><mo value=\"−\">−</mo><mn>1</mn></mfenced></mrow><mn>2</mn></mfrac></span> arestas.</p>","link":"/course/graph-theory/handshakes#handshakes-3"},"bipartite-graph":{"title":"Gráfico bipartido","text":"<p>Um gráfico bipartido____ (completo) consiste em dois conjuntos de vértices. Todo vértice está conectado a todos os vértices no conjunto oposto, mas nenhum dos vértices em seu próprio conjunto.</p>","link":"/course/graph-theory/handshakes#handshakes-4"},"subdivision":{"title":"Subdivisões","text":"<p>Para criar uma <strong>subdivisão</strong> de um gráfico, adicione vértices adicionais ao longo de suas bordas.</p>"},"proof":{"title":"Prova","text":"<p>Uma provaé um argumento lógico que mostra além de qualquer dúvida que uma determinada afirmação é verdadeira.</p>"},"polyhedron":{"title":"Poliedro","text":"<p>Um <strong>poliedro</strong> (o plural é <em>poliedro</em>) é um sólido tridimensional sem superfícies curvas ou arestas. Todas as faces de um poliedro são polígonos. Por exemplo, um cubo e uma pirâmide são poliedros, mas uma esfera não.</p>","link":"/course/polyhedra/polyhedra"},"polygon":{"title":"Polígono","text":"<p>Um polígonoé uma forma geométrica composta por segmentos de linha reta. Os polígonos não podem conter lados curvos ou furos. Por exemplo, um quadrado é um polígono, mas um círculo não.</p>","image":"polygon.svg","link":"/course/polyhedra/polygons#polygons"},"dna":{"title":"GOTA","text":"<p><strong>DNA</strong> (ácido desoxirribonucleico) é uma molécula que contém a matriz genética de todos os organismos vivos. A maioria dos DNAs consiste em duas cadeias formando uma <em>hélice dupla</em>. A informação genética é codificada na ordem dos quatro ácidos nucleicos (A, G, C e T) que compõem o DNA. <em>Sequenciamento de DNA</em> é o processo de extrair essas informações - uma técnica essencial em biologia, medicina, genética e biotecnologia.</p>"},"np":{"title":"NP Hard Problems","text":"<p><em>A teoria da complexidade computacional</em> trata da determinação de quão \"difíceis\" problemas devem ser resolvidos por um computador. <strong>NP rígido</strong> (tempo polinomial não determinístico) é a classe dos problemas mais difíceis.</p>"},"millennium-prize":{"title":"Problemas com o Prêmio do Milênio","text":"<p>Os sete <strong>Problemas do Prêmio Millennium</strong> são alguns dos problemas abertos mais difíceis em Matemática. Eles foram listados em 2000 pelo <em>Clay Mathematics Institute</em>, e cada um recebe uma recompensa de US $ 1 milhão:</p><ul> <li><p>P vs NP</p></li><li><p>A conjectura de Hodge</p></li><li><p>A conjectura de Poincaré</p></li><li><p>A hipótese de Riemann</p></li></ul> <p>Existência de Yang-Mills e gap de massa</p><p>Existência e suavidade de Navier-Stokes</p><ul> <li>A conjectura de Birch e Swinnerton-Dyer</li></ul> <p>Até o momento, apenas um dos problemas, a <em>Conjectura de Poincaré</em>, foi resolvido. No entanto, o matemático que resolveu, Grigori Perelman, recusou o prêmio.</p>"}}