{"graph":{"title":"Grafic","text":"<p>Un <strong>grafic</strong> este o colecție de vârfuri conectate prin margini.</p>","link":"/course/graph-theory/introduction"},"directed-graph":{"title":"Graficul direcționat","text":"<p>Într-un <strong>grafic direcționat</strong>, fiecare muchie are o „săgeată”, adică un vertex de început și un vertex final.</p>","link":"/course/graph-theory/introduction#intro-1"},"subgraph":{"title":"subgrafic","text":"<p>Un grafic este o <strong>subgrafă</strong> a unui alt grafic, dacă este format dintr-un subset al marginilor și vertexurilor graficelor mai mari.</p>","link":"/course/graph-theory/introduction#intro-2"},"graph-order":{"title":"Ordin","text":"<p>Ordineaa unui grafic este numărul de vârfuri din el.</p>","link":"/course/graph-theory/introduction#intro-3"},"graph-degree":{"title":"grad","text":"<p><strong>gradul</strong> al unui vertex este numărul de muchii care se întâlnesc la acel vertex.</p>","link":"/course/graph-theory/introduction#intro-3"},"graph-cycle":{"title":"Ciclu","text":"<p><strong>Cicluri</strong> sunt grafice care constau dintr-o singură buclă de vârfuri.</p>","link":"/course/graph-theory/introduction#intro-4"},"complete-graph":{"title":"Grafic complet","text":"<p>În <strong>grafice complete</strong>, fiecare vertex este conectat la fiecare alt vertex. Un grafic complet cu <em>n</em> vârfuri are <span class=\"math\" data-voice=\"n times open bracket n minus 1 close bracket over 2\"><mfrac><mrow><mi>n</mi><mo value=\"×\">×</mo><mfenced open=\"(\" close=\")\"><mi>n</mi><mo value=\"−\">−</mo><mn>1</mn></mfenced></mrow><mn>2</mn></mfrac></span> muchii.</p>","link":"/course/graph-theory/handshakes#handshakes-3"},"bipartite-graph":{"title":"Grafic bipartit","text":"<p>Un (complet) <strong>grafic bipartit</strong> este format din două seturi de vârfuri. Fiecare vertex este conectat la toate vârfurile din setul opus, dar niciunul dintre vârfurile din setul propriu.</p>","link":"/course/graph-theory/handshakes#handshakes-4"},"subdivision":{"title":"subdiviziunile","text":"<p>Pentru a crea o <strong>subdiviziune</strong> a unui grafic, adăugați vârfuri suplimentare de-a lungul marginilor sale.</p>"},"proof":{"title":"Demonstrație","text":"<p>O <strong>demonstrație</strong> este un raționament care arată fără nicio urmă de îndoială că o anume afirmație este adevărată.</p>"},"polyhedron":{"title":"Poliedru","text":"<p>Un <strong>poliedru</strong> (pluralul este <em>poliedru</em>) este un solid tridimensional fără suprafețe sau margini curbate. Toate fețele unui poliedru sunt poligoane. De exemplu, un cub și o piramidă sunt poliedre, dar o sferă nu este.</p>","link":"/course/polyhedra/polyhedra"},"polygon":{"title":"Poligon","text":"<p>Un <strong>poligon</strong> este o formă geometrică alcătuită din segmente de linie drepte. Poligoanele nu pot conține laturi curbe sau goluri. De exemplu, un pătrat este un poligon, dar un cerc nu.</p>","image":"polygon.svg","link":"/course/polyhedra/polygons#polygons"},"dna":{"title":"ADN","text":"<p><strong>ADN</strong>-ul (acidul dezoxiribonucleic) este o moleculă care conține codul genetic al fiecărui organism viu. Majoritatea ADN-urilor constau din două lanțuri organice ce formează un <em>dublu helix</em>. Informația genetică este codificată în ordinea a patru acizi nucleici (A, G, C și T). <em>Secvențierea ADN-ului</em> este metoda de extragere a acestei informații - o procedura esențială în biologie, medicină, genetică și biotehnologie.</p>"},"np":{"title":"NP Probleme grele","text":"<p><em>Teoria complexității computaționale</em> se referă la determinarea problemelor „dificile” care trebuie rezolvate de către un computer. <strong>NP greu</strong> (polinomul nedeterminativ timp-dur) este clasa celor mai dificile probleme.</p>"},"millennium-prize":{"title":"Problemele pentru Premiul Mileniului","text":"<p>Cele șapte <strong>Probleme pentru Premiul Mileniului</strong> sunt unele dintre cele mai dificile probleme nerezolvate din matematică. Acestea au fost listate în anul 2000 de către <em>Institutul de Matematică Clay</em> și pentru fiecare există o recompensă de $1.000.000:</p><ul> <li>P vs NP * Conjectura lui Hodge * Conjectura lui Poincaré * Ipoteza Riemann * Teoria Yang-Mills</li><li>Problema de existență și netezime Navier-Stokes * Conjectura Birch și Swinnertod-Dyer</li></ul> <p>Până în acest moment, singura problemă rezolvată este <em>conjectura Poincaré</em>. Cu toate acestea, Grigori Perelman, matematicianul care a rezolvat-o, a refuzat premiul.</p>"}}