{"graph":{"title":"Graphe","text":"<p>Un <strong>graphe</strong> est un ensemble de sommets reliés par des arêtes.</p>","link":"/course/graph-theory/introduction"},"directed-graph":{"title":"Graphe Orienté","text":"<p>Dans un <strong>Graphe Orienté</strong>, chaque arête est une flèche, c'est à dire que chaque arrête est constitué d'un sommet de départ et d'un sommet d'arrivé.</p>","link":"/course/graph-theory/introduction#intro-1"},"subgraph":{"title":"Subgraph","text":"<p>A graph is a <strong>subgraph</strong> of another graph, if it is formed by a subset of the larger graphs edges and vertices.</p>","link":"/course/graph-theory/introduction#intro-2"},"graph-order":{"title":"Ordre","text":"<p>L'<strong>ordre</strong> d'un graphe est le nombre de sommets du graphe.</p>","link":"/course/graph-theory/introduction#intro-3"},"graph-degree":{"title":"Degré","text":"<p>Le <strong>Aegré</strong> d'un sommet est le nombre d'arêtes reliées à ce sommet..</p>","link":"/course/graph-theory/introduction#intro-3"},"graph-cycle":{"title":"Cycle","text":"<p><strong>Cycles</strong> are graphs that consist of a single ring of vertices.</p>","link":"/course/graph-theory/introduction#intro-4"},"complete-graph":{"title":"Graphe Complet","text":"<p>Dans un <strong>graphe complet</strong>, chaque sommet est connecté à tous les autres sommets. Un graphe complet à <em>n</em> sommets a <span class=\"math\" data-voice=\"n times open bracket n minus 1 close bracket over 2\"><mfrac><mrow><mi>n</mi><mo value=\"×\">×</mo><mfenced open=\"(\" close=\")\"><mi>n</mi><mo value=\"−\">−</mo><mn>1</mn></mfenced></mrow><mn>2</mn></mfrac></span> arêtes.</p>","link":"/course/graph-theory/handshakes#handshakes-3"},"bipartite-graph":{"title":"Graphe Biparti","text":"<p>Un <strong>Graphe Biparti</strong> est un graphe constitué de deux groupes de sommets, où chaque sommet est connecté aux sommets de l'autre groupe mais pas aux sommets de son propre groupe.</p>","link":"/course/graph-theory/handshakes#handshakes-4"},"subdivision":{"title":"Subdivisions","text":"<p>To create a <strong>subdivision</strong> of a graph you add additional vertices along its edges.</p>"},"proof":{"title":"Proof","text":"<p>A <strong>proof</strong> is a logical argument that shows beyond any doubt that a certain statement is true.</p>"},"polyhedron":{"title":"Polyhedron","text":"<p>A <strong>polyhedron</strong> (the plural is <em>polyhedra</em>) is a 3-dimensional solid with no curves surfaces or edges. All faces of a polyhedron are polygons. For example, a cube and a pyramid are polyhedra, but a sphere is not.</p>","link":"/course/polyhedra/polyhedra"},"polygon":{"title":"Polygon","text":"<p>A <strong>polygon</strong> is geometric shape that is made up of straight line segments. Polygons cannot contain any curved sides, or holes. For example, a square is a polygon but a circle is not.</p>","image":"polygon.svg","link":"/course/polyhedra/polygons#polygons"},"dna":{"title":"GOUTTE","text":"<p><strong>L'ADN</strong> (acide désoxyribonucléique) est une molécule qui contient le schéma génétique de tous les organismes vivants. La plupart des ADN sont constitués de deux brins formant une <em>double hélice</em>. Les informations génétiques sont codées dans l'ordre de quatre acides nucléiques (A, G, C et T) qui composent l'ADN. <em>Le séquençage de l'ADN</em> est le processus d'extraction de ces informations - une technique essentielle en biologie, médecine, génétique et biotechnologie.</p>"},"np":{"title":"NP Hard Problems","text":"<p><em>Computational complexity theory</em> is about determining how “difficult” problems are to be solved by a computer. <strong>NP hard</strong> (non-deterministic polynomial-time hard) is the class of the most difficult problems.</p>"},"millennium-prize":{"title":"Millennium Prize Problems","text":"<p>The seven <strong>Millennium Prize Problems</strong> are some of the most difficult open problems in Mathematics. They were listed in 2000 by the <em>Clay Mathematics Institute</em>, and each hold a $1m reward:</p><ul> <li>P vs NP * The Hodge Conjecture * The Poincaré Conjecture * The Riemann Hypothesis * Yang-Mills Existence and Mass Gap * Navier-Stokes Existence and Smoothness * The Birch and Swinnerton-Dyer Conjecture</li></ul> <p>So far, just one of the problems, the <em>Poincaré Conjecture</em>, was solved. However the mathematician who solved it, Grigori Perelman, declined the award.</p>"}}