{"graph":{"title":"Grafico","text":"<p>Un <strong>gráfico</strong> es una colección de vértices conectados por aristas.</p>","link":"/course/graph-theory/introduction"},"directed-graph":{"title":"Gráfico dirigido","text":"<p>En un <strong>gráfico dirigido</strong>, cada borde tiene una \"flecha\", es decir, un vértice inicial y un vértice final.</p>","link":"/course/graph-theory/introduction#intro-1"},"subgraph":{"title":"Subgrafo","text":"<p>Un gráfico es un <strong>subgrafo</strong> de otro gráfico, si está formado por un subconjunto de los bordes y vértices de los gráficos más grandes.</p>","link":"/course/graph-theory/introduction#intro-2"},"graph-order":{"title":"Orden","text":"<p>El ordende un gráfico es el número de vértices que contiene.</p>","link":"/course/graph-theory/introduction#intro-3"},"graph-degree":{"title":"La licenciatura","text":"<p>El <strong>grado</strong> de un vértice es el número de aristas que se encuentran en ese vértice.</p>","link":"/course/graph-theory/introduction#intro-3"},"graph-cycle":{"title":"Ciclo","text":"<p><strong>Los ciclos</strong> son gráficos que consisten en un solo bucle de vértices.</p>","link":"/course/graph-theory/introduction#intro-4"},"complete-graph":{"title":"Gráfico completo","text":"<p>En <strong>gráficos completos</strong>, cada vértice está conectado a cualquier otro vértice. Un gráfico completo con vértices <em>n</em> tiene bordes <span class=\"nowrap\"><span class=\"math\" data-voice=\"n times open bracket n minus 1 close bracket over 2\"><mfrac><mrow><mi>n</mi><mo value=\"×\">×</mo><mfenced open=\"(\" close=\")\"><mi>n</mi><mo value=\"−\">−</mo><mn>1</mn></mfenced></mrow><mn>2</mn></mfrac></span>.</span></p>","link":"/course/graph-theory/handshakes#handshakes-3"},"bipartite-graph":{"title":"Gráfica bipartita","text":"<p>Un gráfico bipartito__ (completo)__ consta de dos conjuntos de vértices. Cada vértice está conectado a todos los vértices en el conjunto opuesto, pero ninguno de los vértices en su propio conjunto.</p>","link":"/course/graph-theory/handshakes#handshakes-4"},"subdivision":{"title":"Subdivisiones","text":"<p>Para crear una <strong>subdivisión</strong> de un gráfico, agregue vértices adicionales a lo largo de sus bordes.</p>"},"proof":{"title":"Prueba","text":"<p>Una <strong>prueba</strong> es un argumento lógico que muestra más allá de cualquier duda que cierta afirmación es verdadera.</p>"},"polyhedron":{"title":"Poliedro","text":"<p>Un <strong>poliedro</strong> (el plural es <em>poliedro</em>) es un sólido tridimensional sin superficies curvas o bordes. Todas las caras de un poliedro son polígonos. Por ejemplo, un cubo y una pirámide son poliedros, pero una esfera no lo es.</p>","link":"/course/polyhedra/polyhedra"},"polygon":{"title":"Polígono","text":"<p>Un <strong>polígono</strong> es una forma geométrica que se compone de segmentos de línea recta. Los polígonos no pueden contener lados curvos ni agujeros. Por ejemplo, un cuadrado es un polígono pero un círculo no lo es.</p>","image":"polygon.svg","link":"/course/polyhedra/polygons#polygons"},"dna":{"title":"GOTA","text":"<p><strong>ADN</strong> (ácido desoxirribonucleico) es una molécula que contiene el modelo genético de todos los organismos vivos. La mayoría de los ADN consisten en dos cadenas que forman una <em>doble hélice</em>. La información genética se codifica en el orden de cuatro ácidos nucleicos (A, G, C y T) que forman el ADN. <em>La secuenciación del ADN</em> es el proceso de extracción de esta información, una técnica esencial en biología, medicina, genética y biotecnología.</p>"},"np":{"title":"NP Hard Problems","text":"<p><em>La teoría de la complejidad computacional</em> se trata de determinar cómo una computadora debe resolver los problemas \"difíciles\". <strong>NP hard</strong> (tiempo de polinomio no determinista hard) es la clase de los problemas más difíciles.</p>"},"millennium-prize":{"title":"Problemas del Premio del Milenio","text":"<p>Los siete <strong>Problemas del Premio del Milenio</strong> son algunos de los problemas abiertos más difíciles en Matemáticas. Fueron listados en 2000 por el <em>Clay Mathematics Institute</em>, y cada uno tiene una recompensa de $ 1 millón:</p><ul> <li><p>P vs NP</p></li><li><p>La conjetura de Hodge</p></li><li><p>La conjetura de Poincaré</p></li><li><p>La hipótesis de Riemann</p></li><li><p>Existencia de Yang-Mills y brecha de masa</p></li><li><p>Navier-Stokes Existencia y suavidad</p></li><li><p>La conjetura de Birch y Swinnerton-Dyer</p></li></ul> <p>Hasta ahora, solo uno de los problemas, la <em>Conjetura de Poincaré</em>, se resolvió. Sin embargo, el matemático que lo resolvió, Grigori Perelman, rechazó el premio.</p>"}}