{"escher":{"name":"Escher","born":1898,"died":1972,"bio":"<p><strong>Maurits Cornelis Escher</strong> (1898 - 1972) var en holländsk konstnär som skapade skisser, träsnitt och litografier av matematiskt inspirerade föremål och former: inklusive polyhedra, tessellationer och omöjliga former. Han utforskade grafiskt begrepp som symmetri, oändlighet, perspektiv och icke-euklidisk geometri.</p>","small":true,"links":[{"title":"Tessellations in Art","url":"/course/polyhedra/tessellations#escher"}]},"penrose":{"name":"Penrose","born":1931,"bio":"<p><strong>Sir Roger Penrose</strong> (född 1931) är en brittisk matematiker och fysiker som är känd för sitt banbrytande arbete inom allmän relativitet och kosmologi - ofta i samarbete med andra berömda forskare som Stephen Hawking och Michael Atiyah. Han upptäckte också <em>Penrose Tilings</em>: självliknande, icke-periodiska tessellationer.</p>","links":[{"title":"Penrose Tilings","url":"/course/polyhedra/tessellations#penrose"}]},"euler":{"name":"Euler","born":1707,"died":1783,"bio":"<p><strong>Leonhard Euler</strong> (1707 - 1783) var en av de största matematikerna i historien. Hans arbete sträcker sig över alla områden inom matematik, och han skrev 80 volymer av forskning.</p><p>Euler föddes i Schweiz och studerade i Basel, men bodde större delen av sitt liv i Berlin, Preussen och S: t Petersburg, Ryssland.</p><p>Euler uppfann mycket av den moderna matematiska terminologin och notationen och gjorde viktiga upptäckter inom kalkyl, analys, grafteori, fysik, astronomi och många andra ämnen.</p>","links":[{"title":"Königsberg Bridges Problem","url":"/course/graph-theory/bridges"},{"title":"Euler’s Formula","url":"/course/graph-theory/planar-graphs"},{"title":"Polyhedrons","url":"/course/polyhedra/polyhedra"}]},"plato":{"name":"Plato","born":-425,"died":-347,"bio":"<p><strong>Platon</strong> (c. 425 - 347 fvt) var en filosof i antika Grekland, och - tillsammans med sin lärare Sokrates och hans student Aristoteles - lägger grunden till västerländsk filosofi och vetenskap.</p><p>Platon grundade Academy of Athens, den första institutionen för högre utbildning i den västra världen. Hans många skrifter om filosofi och teologi, vetenskap och matematik, politik och rättvisa gör honom till en av de mest inflytelserika tänkarna genom tiderna.</p>","links":[{"title":"Platonic Solids","url":"/course/polyhedra/platonic"}]},"archimedes":{"name":"Archimedes","born":-287,"died":-212,"bio":"<p><strong>Archimedes</strong> (c. 287 - 212 fvt) var en forntida grekisk forskare och ingenjör och en av de största matematikerna genom tiderna. Han upptäckte många kalkylbegrepp och arbetade inom geometri, analys och mekanik.</p><p>När han badade upptäckte Archimedes ett sätt att bestämma volymen av oregelbundna föremål med den mängd vatten de förflyttade när de var nedsänkta. Han var så upphetsad av denna upptäckt att han sprang ut på gatan, fortfarande avklädd och skrek <em>“Eureka!”</em> (grekisk för <em>“Jag har hittat den!”</em>).</p><p>Som ingenjör byggde han geniala försvarsmaskiner under belägringen av sin hemstad Syracuse på Sicilien. Efter två år lyckades romarna slutligen komma in, och Archimedes dödades. Hans sista ord var <em>“Stör inte mina kretsar”</em> - som han studerade då.</p>","links":[{"title":"Archimedean Solids","url":"/course/polyhedra/platonic#archimedean"}]},"fuller":{"name":"Fuller","bio":"<p><strong>Richard Buckminster “Bucky” Fuller</strong> (1895 - 1983) var en amerikansk arkitekt, designer och uppfinnare. Han är känd för att konstruera <em>geodesisk kupol</em> - stora, sfäriska strukturer. Liknande kolmolekyler, <em>fullerenes</em>, fick senare namn efter honom.</p>"}}