{"escher":{"name":"Escher","born":1898,"died":1972,"bio":"<p><strong>Maurits Cornelis Escher</strong> (1898 – 1972) war ein niederländischer Künstler, der Skizzen, Holzschnitte und Lithographien von mathematisch inspirierten Objekten und Formen schuf: einschließlich Polyeder, Mosaik und unmögliche Formen. He graphically explored concepts like symmetry, infinity, perspective and non-euclidean geometry.</p>","small":true,"links":[{"title":"Tessellations in Art","url":"/course/polyhedra/tessellations#escher"}]},"penrose":{"name":"Penrose","born":1931,"bio":"<p><strong>Sir Roger Penrose</strong> (geb. 1931) ist ein britischer Mathematiker und Physiker der für seine bahnbrechenden Arbeiten in der allgemeinen Relativitätstheorie und Kosmologie bekannt ist - oft in Zusammenarbeit mit anderen berühmten Wissenschaftlern wie Stephen Hawking und Michael Atiyah. Er entdeckte auch die selbstähnlichen und nicht-periodischen <em>Penrose Parkettierungen</em>.</p>","links":[{"title":"Penrose Tilings","url":"/course/polyhedra/tessellations#penrose"}]},"euler":{"name":"Euler","born":1707,"died":1783,"bio":"<p><strong>Leonhard Euler</strong> (1707 – 1783) war einer der größten Mathematiker der Geschichte. Seine Arbeit umfasst alle Bereiche der Mathematik, und er schrieb 80 Forschungsbände.</p><p>Euler wurde in der Schweiz geboren und studierte in Basel, lebte aber den größten Teil seines Lebens in Berlin, Preußen und St. Petersburg, Russland.</p><p>Euler erfand einen Großteil der modernen mathematischen Terminologie und Notation und machte wichtige Entdeckungen in den Bereichen Infinitesimalrechnung, Analysis, Graphentheorie, Physik, Astronomie und vielen anderen Themen.</p>","links":[{"title":"Königsberger Brückenproblem","url":"/course/graph-theory/bridges"},{"title":"Eulersche Formel","url":"/course/graph-theory/planar-graphs"},{"title":"Polyeder","url":"/course/polyhedra/polyhedra"}]},"plato":{"name":"Plato","born":-425,"died":-347,"bio":"<p><strong>Platon</strong> (ca. 425 – 347 v. Chr.) war ein Philosoph im antiken Griechenland und legte - zusammen mit seinem Lehrer Sokrates und seinem Schüler Aristoteles – den Grundstein für die Philosophie des Abendlandes und die Wissenschaft.</p><p>Platon gründete die Akademie von Athen, die erste Hochschule der westlichen Welt. Seine vielen Schriften über Philosophie und Theologie, Naturwissenschaften und Mathematik, Politik und Recht machen ihn zu einem der einflussreichsten Denker aller Zeiten.</p>","links":[{"title":"Platonische Körper","url":"/course/polyhedra/platonic"}]},"archimedes":{"name":"Archimedes","born":-287,"died":-212,"bio":"<p><strong>Archimedes</strong> (ca. 287 – ca. 212 v. Chr.) war ein altgriechischer Wissenschaftler und Ingenieur sowie einer der größten Mathematiker aller Zeiten. Er entdeckte viele Rechenmethoden und beschäftigte sich mit Geometrie, Analysis und Mechanik.</p><p>Beim Baden entdeckte Archimedes eine Möglichkeit, das Volumen unregelmäßiger Objekte anhand der Wassermenge zu bestimmen, die sie beim Eintauchen verdrängen. Er war so begeistert von dieser Entdeckung, dass er, noch immer nackt, auf die Straße rannte und laut <em>“Heureka!”</em> (griechisch für <em>“Ich hab’s gefunden!”</em>) schrie.</p><p>Als Ingenieur baute er während der Belagerung seiner Heimatstadt Syrakus auf Sizilien geniale Verteidigungsmaschinen. Nach zwei Jahren gelang es den Römern endlich sie zu erobern und Archimedes wurde getötet. Seine letzten Worte waren: <em>“Stört meine Kreise nicht”</em> – da er diese damals studierte.</p>","links":[{"title":"Archimedische Körper","url":"/course/polyhedra/platonic"}]},"fuller":{"name":"Fuller","bio":"<p><strong>Richard Buckminster \"Bucky\" Fuller</strong> (1895 - 1983) war ein amerikanischer Architekt, Designer und Erfinder. Er ist berühmt für den Bau von <em>geodätischen Kuppeln</em> - großen, kugelförmigen Strukturen. Ähnlich aussehende Kohlenstoffmoleküle, die <em>Fullerene</em>, wurden später nach ihm benannt.</p>"}}