{"escher":{"name":"Escher","born":1898,"died":1972,"bio":"<p><strong>मॉरिटस कॉर्नेलिस एस्चर</strong> (1898 - 1972) एक डच कलाकार थे, जिन्होंने गणितीय रूप से प्रेरित वस्तुओं और आकृतियों के रेखाचित्र, काष्ठचित्र और लिथोग्राफ बनाए: पॉलीहेड्रा, टेसेलेशन और असंभव आकृतियों सहित। उन्होंने समरूपता, अनन्तता, परिप्रेक्ष्य और गैर-यूक्लिडियन ज्यामिति जैसी अवधारणाओं का रेखांकन किया।</p>","small":true,"links":[{"title":"Tessellations in Art","url":"/course/polyhedra/tessellations#escher"}]},"penrose":{"name":"Penrose","born":1931,"bio":"<p>सर रोजर पेनरोस (जन्म १ ९ ३१) एक ब्रिटिश गणितज्ञ और भौतिक विज्ञानी हैं, जो सामान्य सापेक्षता और ब्रह्मांड विज्ञान में अपने शानदार काम के लिए जाने जाते हैं - अक्सर स्टीफन हॉकिंग और माइकल अतियाह जैसे अन्य प्रसिद्ध वैज्ञानिकों के साथ सहयोग करते हैं। उन्होंने <em>पेनरोज़ टिलिंग्स</em> की खोज की: स्वयं-समान, गैर-आवधिक टेसलेशन।</p>","links":[{"title":"Penrose Tilings","url":"/course/polyhedra/tessellations#penrose"}]},"euler":{"name":"Euler","born":1707,"died":1783,"bio":"<p>लियोनहार्ड यूलर (१ 17० 17 - १ was was३) इतिहास के सबसे महान गणितज्ञ थे। उनका काम गणित के सभी क्षेत्रों तक फैला हुआ है, और उन्होंने 80 खंडों का शोध लिखा है।</p><p>यूलर का जन्म स्विट्जरलैंड में हुआ था और उसने बेसेल में अध्ययन किया, लेकिन वह अपना अधिकांश जीवन बर्लिन, प्रशिया और सेंट पीटर्सबर्ग, रूस में रहा।</p><p>यूलर ने आधुनिक गणितीय शब्दावली और संकेतन का बहुत आविष्कार किया और कलन, विश्लेषण, ग्राफ सिद्धांत, भौतिकी, खगोल विज्ञान और कई अन्य विषयों में महत्वपूर्ण खोजें कीं।</p>","links":[{"title":"Königsberg Bridges Problem","url":"/course/graph-theory/bridges"},{"title":"Euler’s Formula","url":"/course/graph-theory/planar-graphs"},{"title":"Polyhedrons","url":"/course/polyhedra/polyhedra"}]},"plato":{"name":"Plato","born":-425,"died":-347,"bio":"<p>__प्लेटो (सी। ४२५ - ३४CE ईसा पूर्व) प्राचीन ग्रीस में एक दार्शनिक थे, और - अपने शिक्षक सुकरात और उनके छात्र अरस्तू के साथ मिलकर पश्चिमी दर्शन और विज्ञान की बहुत नींव रखी।</p><p>प्लेटो ने पश्चिमी दुनिया में पहली उच्च शिक्षा संस्थान, एथेंस अकादमी की स्थापना की। दर्शन और धर्मशास्त्र, विज्ञान और गणित, राजनीति और न्याय पर उनके कई लेखन, उन्हें अब तक के सबसे प्रभावशाली विचारकों में से एक बनाते हैं।</p>","links":[{"title":"Platonic Solids","url":"/course/polyhedra/platonic"}]},"archimedes":{"name":"Archimedes","born":-287,"died":-212,"bio":"<p><strong>आर्किमिडीज</strong> (सी। 287 - 212 ईसा पूर्व) एक प्राचीन यूनानी वैज्ञानिक और इंजीनियर थे, और सभी समय के महानतम गणितज्ञों में से एक थे। उन्होंने कैलकुलस की कई अवधारणाओं की खोज की और ज्यामिति, विश्लेषण और यांत्रिकी में काम किया।</p><p>स्नान करते समय, आर्किमिडीज़ ने पानी में डूबे हुए पानी की मात्रा का उपयोग करके अनियमित वस्तुओं की मात्रा निर्धारित करने का एक तरीका खोजा। इस खोज से वह इतना उत्तेजित हो गया कि वह सड़क पर दौड़ता रहा, फिर भी <em>\"यूरेका!\"</em> (_के लिए ग्रीक) \"मुझे पता चला!\"</p><p>एक इंजीनियर के रूप में, उन्होंने सिसिली में अपने गृह शहर सिरैक्यूज़ की घेराबंदी के दौरान सरल रक्षा मशीनों का निर्माण किया। दो वर्षों के बाद, रोमन आखिरकार प्रवेश करने में कामयाब रहे, और आर्किमिडीज़ मारे गए। उनके अंतिम शब्द थे <em>\"मेरी मंडलियों को परेशान मत करो\"</em> - जो वह उस समय पढ़ रहे थे।</p>","links":[{"title":"Archimedean Solids","url":"/course/polyhedra/platonic#archimedean"}]},"fuller":{"name":"Fuller","bio":"<p><strong>रिचर्ड बकमिनस्टर \"बकी\" फुलर</strong> (1895 - 1983) एक अमेरिकी वास्तुकार, डिजाइनर और आविष्कारक थे। वह <em>जियोडेसिक गुंबद</em> निर्माण के लिए प्रसिद्ध है - बड़ी, गोलाकार संरचनाएं। इसी तरह के दिखने वाले कार्बन अणु, <em>फुलरेंसेस</em>, बाद में उनके नाम पर रखे गए।</p>"}}