{"escher":{"name":"Escher","born":1898,"died":1972,"bio":"<p><strong>Maurits Cornelis Escher</strong> (1898 - 1972) fue un artista holandés que creó bocetos, grabados en madera y litografías de objetos y formas inspirados matemáticamente: incluyendo poliedros, mosaicos y formas imposibles. Exploró gráficamente conceptos como simetría, infinito, perspectiva y geometría no euclidiana.</p>","small":true,"links":[{"title":"Tessellations in Art","url":"/course/polyhedra/tessellations#escher"}]},"penrose":{"name":"Penrose","born":1931,"bio":"<p><strong>Sir Roger Penrose</strong> (nacido en 1931) es un matemático y físico británico conocido por su trabajo pionero en relatividad general y cosmología, a menudo colaborando con otros científicos famosos como Stephen Hawking y Michael Atiyah. También descubrió <em>Penrose Tilings</em>: teselaciones no periódicas similares.</p>","links":[{"title":"Penrose Tilings","url":"/course/polyhedra/tessellations#penrose"}]},"euler":{"name":"Euler","born":1707,"died":1783,"bio":"<p><strong>Leonhard Euler</strong> (1707-1783) fue uno de los mejores matemáticos de la historia. Su trabajo abarca todas las áreas de las matemáticas, y escribió 80 volúmenes de investigación.</p><p>Euler nació en Suiza y estudió en Basilea, pero vivió la mayor parte de su vida en Berlín, Prusia y San Petersburgo, Rusia.</p><p>Euler inventó gran parte de la terminología matemática moderna y la notación, e hizo importantes descubrimientos en cálculo, análisis, teoría de grafos, física, astronomía y muchos otros temas.</p>","links":[{"title":"Königsberg Bridges Problem","url":"/course/graph-theory/bridges"},{"title":"Euler’s Formula","url":"/course/graph-theory/planar-graphs"},{"title":"Polyhedrons","url":"/course/polyhedra/polyhedra"}]},"plato":{"name":"Plato","born":-425,"died":-347,"bio":"<p><strong>Platón</strong> (c. 425 - 347 a. C.) fue un filósofo en la antigua Grecia y, junto con su maestro Sócrates y su alumno Aristóteles, sentó las bases de la filosofía y la ciencia occidentales.</p><p>Platón fundó la Academia de Atenas, la primera institución de educación superior en el mundo occidental. Sus numerosos escritos sobre filosofía y teología, ciencias y matemáticas, política y justicia, lo convierten en uno de los pensadores más influyentes de todos los tiempos.</p>","links":[{"title":"Platonic Solids","url":"/course/polyhedra/platonic"}]},"archimedes":{"name":"Archimedes","born":-287,"died":-212,"bio":"<p><strong>Arquímedes</strong> (c. 287 - 212 a. C.) fue un antiguo científico e ingeniero griego, y uno de los mejores matemáticos de todos los tiempos. Descubrió muchos conceptos de cálculo y trabajó en geometría, análisis y mecánica.</p><p>Mientras se bañaba, Arquímedes descubrió una forma de determinar el volumen de objetos irregulares utilizando la cantidad de agua que desplazaban cuando se sumergían. Estaba tan emocionado por este descubrimiento que salió corriendo a la calle, todavía desnudo, gritando <em>\"¡Eureka!\"</em> (en griego para <em>\"¡Lo he encontrado!\"</em>).</p><p>Como ingeniero, construyó ingeniosas máquinas de defensa durante el asedio de su ciudad natal, Siracusa, en Sicilia. Después de dos años, los romanos finalmente lograron entrar, y Arquímedes fue asesinado. Sus últimas palabras fueron <em>\"No molestar a mis círculos\"</em>, que estaba estudiando en ese momento.</p>","links":[{"title":"Archimedean Solids","url":"/course/polyhedra/platonic#archimedean"}]},"fuller":{"name":"Fuller","bio":"<p><strong>Richard Buckminster \"Bucky\" Fuller</strong> (1895 - 1983) fue un arquitecto, diseñador e inventor estadounidense. Es famoso por construir <em>domo geodésico</em> - estructuras grandes y esféricas. Moléculas de carbono de aspecto similar, los <em>fullerenos</em>, fueron nombrados después de él.</p>"}}