{"escher":{"name":"Escher","born":1898,"died":1972,"bio":"<p><strong>Maurits Cornelis Escher</strong> (1898 - 1972) était un artiste néerlandais qui a créé des croquis, des gravures sur bois et des lithographies d'objets et de formes d'inspiration mathématique: y compris les polyèdres, les pavages et les formes impossibles. Il a exploré graphiquement des concepts comme la symétrie, l'infini, la perspective et la géométrie non euclidienne.</p>","small":true,"links":[{"title":"Tessellations in Art","url":"/course/polyhedra/tessellations#escher"}]},"penrose":{"name":"Penrose","born":1931,"bio":"<p><strong>Sir Roger Penrose</strong> (né en 1931) est un mathématicien et physicien britannique connu pour ses travaux révolutionnaires en relativité générale et cosmologie - collaborant souvent avec d'autres scientifiques célèbres comme Stephen Hawking et Michael Atiyah. Il a également découvert <em>Penrose Tilings</em>: pavages auto-similaires et non périodiques.</p>","links":[{"title":"Penrose Tilings","url":"/course/polyhedra/tessellations#penrose"}]},"euler":{"name":"Euler","born":1707,"died":1783,"bio":"<p><strong>Leonhard Euler</strong> (1707 - 1783) était l'un des plus grands mathématiciens de l'histoire. Son travail couvre tous les domaines des mathématiques et il a écrit 80 volumes de recherche.</p><p>Euler est né en Suisse et a étudié à Bâle, mais a vécu la majeure partie de sa vie à Berlin, en Prusse et à Saint-Pétersbourg, en Russie.</p><p>Euler a inventé une grande partie de la terminologie et de la notation mathématiques modernes, et a fait d'importantes découvertes en calcul, analyse, théorie des graphes, physique, astronomie et de nombreux autres sujets.</p>","links":[{"title":"Königsberg Bridges Problem","url":"/course/graph-theory/bridges"},{"title":"Euler’s Formula","url":"/course/graph-theory/planar-graphs"},{"title":"Polyhedrons","url":"/course/polyhedra/polyhedra"}]},"plato":{"name":"Plato","born":-425,"died":-347,"bio":"<p><strong>Platon</strong> (vers 425 - 347 avant notre ère) était un philosophe de la Grèce antique et, avec son professeur Socrate et son élève Aristote, a jeté les bases mêmes de la philosophie et des sciences occidentales.</p><p>Platon a fondé l'Académie d'Athènes, la première institution d'enseignement supérieur dans le monde occidental. Ses nombreux écrits sur la philosophie et la théologie, les sciences et les mathématiques, la politique et la justice font de lui l'un des penseurs les plus influents de tous les temps.</p>","links":[{"title":"Platonic Solids","url":"/course/polyhedra/platonic"}]},"archimedes":{"name":"Archimedes","born":-287,"died":-212,"bio":"<p><strong>Archimède</strong> (c. 287 - 212 BCE) était un scientifique et ingénieur grec ancien, et l'un des plus grands mathématiciens de tous les temps. Il a découvert de nombreux concepts du calcul et a travaillé en géométrie, analyse et mécanique.</p><p>En prenant un bain, Archimède a découvert un moyen de déterminer le volume d'objets irréguliers en utilisant la quantité d'eau qu'ils déplaçaient lorsqu'ils étaient immergés. Il était tellement excité par cette découverte qu'il a couru dans la rue, toujours déshabillé, en criant <em>\"Eurêka!\"</em> (Grec pour <em>\"Je l'ai trouvé!\"</em>).</p><p>En tant qu'ingénieur, il a construit des machines de défense ingénieuses pendant le siège de sa ville natale, Syracuse, en Sicile. Après deux ans, les Romains ont finalement réussi à entrer et Archimède a été tué. Ses derniers mots étaient <em>\"Ne pas déranger mes cercles\"</em> - qu'il étudiait à l'époque.</p>","links":[{"title":"Archimedean Solids","url":"/course/polyhedra/platonic#archimedean"}]},"fuller":{"name":"Fuller","bio":"<p><strong>Richard Buckminster \"Bucky\" Fuller</strong> (1895 - 1983) était un architecte, designer et inventeur américain. Il est célèbre pour la construction de <em>dômes géodésiques</em> - de grandes structures sphériques. Des molécules de carbone d'aspect similaire, les <em>fullerènes</em>, ont ensuite été nommées d'après lui.</p>"}}