{"escher":{"name":"Escher","born":1898,"died":1972,"bio":"<p><strong>Maurits Cornelis Escher</strong> (1898. - 1972.) bio je nizozemski umjetnik koji je kreirao skice, reznice i litografije matematički nadahnutih predmeta i oblika: uključujući poliedre, tesselacije i nemoguće oblike. Grafički je istraživao pojmove poput simetrije, beskonačnosti, perspektive i ne-euklidske geometrije.</p>","small":true,"links":[{"title":"Tessellations in Art","url":"/course/polyhedra/tessellations#escher"}]},"penrose":{"name":"Penrose","born":1931,"bio":"<p><strong>Sir Roger Penrose</strong> (rođen 1931.) je britanski matematičar i fizičar koji je poznat po svom revolucionarnom radu u općoj relativnosti i kosmologiji - često surađujući s drugim poznatim znanstvenicima poput Stephena Hawkinga i Michaela Atiyaha. Otkrio je i <em>Penrose Penings</em>: slične, neperiodične teshele.</p>","links":[{"title":"Penrose Tilings","url":"/course/polyhedra/tessellations#penrose"}]},"euler":{"name":"Euler","born":1707,"died":1783,"bio":"<p><strong>Leonhard Euler</strong> (1707. - 1783.) bio je jedan od najvećih matematičara u povijesti. Njegov rad obuhvaća sva područja matematike, a napisao je 80 svezaka istraživanja.</p><p>Euler je rođen u Švicarskoj i studirao je u Bazelu, ali je veći dio života živio u Berlinu, Pruskoj i Sankt Peterburgu u Rusiji.</p><p>Euler je izumio velik dio moderne matematičke terminologije i notacije te je učinio važna otkrića u računici, analizi, teoriji grafova, fizici, astronomiji i mnogim drugim temama.</p>","links":[{"title":"Königsberg Bridges Problem","url":"/course/graph-theory/bridges"},{"title":"Euler’s Formula","url":"/course/graph-theory/planar-graphs"},{"title":"Polyhedrons","url":"/course/polyhedra/polyhedra"}]},"plato":{"name":"Plato","born":-425,"died":-347,"bio":"<p><strong>Platon</strong> (oko 425. - 347. pr.n.e.) bio je filozof u drevnoj Grčkoj, i - zajedno sa svojim učiteljem Sokratom i njegovim učenikom Aristotelom - postavio je sam temelj zapadne filozofije i znanosti.</p><p>Platon je osnovao Atinsku akademiju, prvu visokoškolsku ustanovu u zapadnom svijetu. Njegova mnoga djela o filozofiji i teologiji, znanosti i matematici, politici i pravdi čine ga jednim od najutjecajnijih mislilaca svih vremena.</p>","links":[{"title":"Platonic Solids","url":"/course/polyhedra/platonic"}]},"archimedes":{"name":"Archimedes","born":-287,"died":-212,"bio":"<p><strong>Arhimed</strong> (oko 287. - 212. pr. Kr.) Bio je drevni grčki znanstvenik i inženjer i jedan od najvećih matematičara svih vremena. Otkrio je mnoge pojmove kalkulusa i radio u geometriji, analizi i mehanici.</p><p>Dok se kupao, Arhimed je otkrio način da utvrdi volumen nepravilnih predmeta koristeći količinu vode koju su istisnuli prilikom potapanja. Bio je toliko uzbuđen ovim otkrićem da je istrčao na ulicu, još uvijek skinuta, vičući <em>\"Eureka!\"</em> (grčki za <em>\"Našao sam ga!\"</em>).</p><p>Kao inženjer, izgradio je genijalne obrambene strojeve tijekom opsade svog rodnog grada Sirakuze na Siciliji. Nakon dvije godine, Rimljani su napokon uspjeli ući, a Arhimed je ubijen. Posljednje su mu bile riječi <em>\"Ne uznemiravaj moje krugove\"</em> - koje je tada proučavao.</p>","links":[{"title":"Archimedean Solids","url":"/course/polyhedra/platonic#archimedean"}]},"fuller":{"name":"Fuller","bio":"<p><strong>Richard Buckminster \"Bucky\" Fuller</strong> (1895. - 1983.) bio je američki arhitekt, dizajner i izumitelj. Poznat je po izgradnji <em>geodetske kupole</em> - velike, sferne građevine. Slične karbonske molekule, <em>fullereni</em>, kasnije su nazvane po njemu.</p>"}}