{"escher":{"name":"Escher","full":"M. C. Escher","born":1898,"died":1972,"bio":"<p><strong>Maurits Cornelis Escher</strong> (1898 – 1972) was a Dutch artist who created sketches, woodcuts and lithographs of mathematically inspired objects and shapes: including polyhedra, tessellations and impossible shapes. He graphically explored concepts like symmetry, infinity, perspective and non-euclidean geometry.</p>","small":true,"links":[{"title":"Tessellations in Art","url":"/course/polyhedra/tessellations#escher"}]},"penrose":{"name":"Penrose","full":"Roger Penrose","born":1931,"bio":"<p><strong>Sir Roger Penrose</strong> (born 1931) is a British mathematician and physicist who is known for his groundbreaking work in general relativity and cosmology – often collaborating with other famous scientists like Stephen Hawking and Michael Atiyah. He also discovered <em>Penrose Tilings</em>: self-similar, non-periodic tessellations.</p>","links":[{"title":"Penrose Tilings","url":"/course/polyhedra/tessellations#penrose"}]},"euler":{"name":"Euler","full":"Leonhard Euler","born":1707,"died":1783,"bio":"<p><strong>Leonhard Euler</strong> (1707 – 1783) was one the greatest mathematicians in history. His work spans all areas of mathematics, and he wrote 80 volumes of research.</p><p>Euler was born in Switzerland and studied in Basel, but lived most of his life in Berlin, Prussia, and St. Petersburg, Russia.</p><p>Euler invented much of the modern mathematical terminology and notation, and made important discoveries in calculus, analysis, graph theory, physics, astronomy, and many other topics.</p>","links":[{"title":"Königsberg Bridges Problem","url":"/course/graph-theory/bridges"},{"title":"Euler’s Formula","url":"/course/graph-theory/planar-graphs"},{"title":"Polyhedrons","url":"/course/polyhedra/polyhedra"}]},"plato":{"name":"Plato","born":-425,"died":-347,"bio":"<p><strong>Plato</strong> (c. 425 – 347 BCE) was a philosopher in ancient Greece, and – together with his teacher Socrates and his student Aristotle – laid the very foundation of Western philosophy and science.</p><p>Plato founded the Academy of Athens, the first higher learning institution in the Western world. His many writings on philosophy and theology, science and mathematics, politics and justice, make him one of the most influential thinkers of all time.</p>","links":[{"title":"Platonic Solids","url":"/course/polyhedra/platonic"}]},"archimedes":{"name":"Archimedes","born":-287,"died":-212,"bio":"<p><strong>Archimedes</strong> (c. 287 – 212 BCE) was an ancient Greek scientist and engineer, and one of the greatest mathematicians of all time. He discovered many concepts of calculus and worked in geometry, analysis and mechanics.</p><p>While taking a bath, Archimedes discovered a way to determine the volume of irregular objects using the amount of water they displaced when submerged. He was so excited by this discovery that he ran out on the street, still undressed, yelling <em>“Eureka!”</em> (Greek for <em>“I have found it!”</em>).</p><p>As an engineer, he built ingenious defence machines during the siege of his home city Syracuse in Sicily. After two years, the Romans finally managed to enter, and Archimedes was killed. His last words were <em>“Do not disturb my circles”</em> – which he was studying at the time.</p>","links":[{"title":"Archimedean Solids","url":"/course/polyhedra/platonic#archimedean"}]},"fuller":{"name":"Fuller","bio":"<p><strong>Richard Buckminster “Bucky” Fuller</strong> (1895 – 1983) was an American architect, designer and inventor. He is famous for constructing <em>geodesic dome</em> – large, spherical structures. Similar looking Carbon molecules, the <em>fullerenes</em>, were later named after him.</p>"}}