{"escher":{"name":"Escher","born":1898,"died":1972,"bio":"<p><strong>Maurits Cornelis Escher</strong> (1898 - 1972) là một nghệ sĩ người Hà Lan, người đã tạo ra các bản phác thảo, khắc gỗ và in thạch bản của các vật thể và hình dạng lấy cảm hứng toán học: bao gồm các khối đa diện, hình chữ nhật và hình dạng không thể. Ông đã khám phá đồ họa các khái niệm như đối xứng, vô cực, phối cảnh và hình học phi euclide.</p>","small":true,"links":[{"title":"Tessellations in Art","url":"/course/polyhedra/tessellations#escher"}]},"penrose":{"name":"Penrose","born":1931,"bio":"<p><strong>Sir Roger Penrose</strong> (sinh năm 1931) là một nhà toán học và vật lý người Anh nổi tiếng với công trình đột phá về thuyết tương đối rộng và vũ trụ học - thường hợp tác với các nhà khoa học nổi tiếng khác như Stephen Hawking và Michael Atiyah. Ông cũng phát hiện ra <em>Penrose Tilings</em>: những điều tương tự, không định kỳ.</p>","links":[{"title":"Penrose Tilings","url":"/course/polyhedra/tessellations#penrose"}]},"euler":{"name":"Euler","born":1707,"died":1783,"bio":"<p><strong>Leonhard Euler</strong> (1707 - 1783) là một trong những nhà toán học vĩ đại nhất trong lịch sử. Công việc của ông trải dài trên tất cả các lĩnh vực toán học, và ông đã viết 80 tập nghiên cứu.</p><p>Euler sinh ra ở Thụy Sĩ và học tại Basel, nhưng sống phần lớn cuộc đời ở Berlin, Phổ và St. Petersburg, Nga.</p><p>Euler đã phát minh ra nhiều thuật ngữ và ký hiệu toán học hiện đại, và thực hiện những khám phá quan trọng trong tính toán, phân tích, lý thuyết đồ thị, vật lý, thiên văn học, và nhiều chủ đề khác.</p>","links":[{"title":"Königsberg Bridges Problem","url":"/course/graph-theory/bridges"},{"title":"Euler’s Formula","url":"/course/graph-theory/planar-graphs"},{"title":"Polyhedrons","url":"/course/polyhedra/polyhedra"}]},"plato":{"name":"Plato","born":-425,"died":-347,"bio":"<p><strong>Plato</strong> (khoảng 425 - 347 BCE) là một triết gia ở Hy Lạp cổ đại, và - cùng với giáo viên Socrates và học trò của ông Aristotle - đã đặt nền tảng của triết học và khoa học phương Tây.</p><p>Plato thành lập Học viện Athens, tổ chức học tập cao hơn đầu tiên trong thế giới phương Tây. Nhiều tác phẩm của ông về triết học và thần học, khoa học và toán học, chính trị và công lý, khiến ông trở thành một trong những nhà tư tưởng có ảnh hưởng nhất mọi thời đại.</p>","links":[{"title":"Platonic Solids","url":"/course/polyhedra/platonic"}]},"archimedes":{"name":"Archimedes","born":-287,"died":-212,"bio":"<p><strong>Archimedes</strong> (khoảng 287 - 212 BCE) là một nhà khoa học và kỹ sư Hy Lạp cổ đại, và là một trong những nhà toán học vĩ đại nhất mọi thời đại. Ông đã khám phá ra nhiều khái niệm về tính toán và làm việc trong hình học, phân tích và cơ học.</p><p>Trong khi tắm, Archimedes đã phát hiện ra một cách để xác định khối lượng của các vật thể không đều bằng cách sử dụng lượng nước mà chúng bị dịch chuyển khi ngập nước. Anh ta rất phấn khích vì phát hiện này đến nỗi anh ta chạy ra ngoài đường, vẫn cởi quần áo, hét lên <em>Đổi Eureka! Lần</em> (tiếng Hy Lạp cho _Tôi đã tìm thấy nó!</p><p>Là một kỹ sư, ông đã chế tạo ra những cỗ máy phòng thủ khéo léo trong cuộc bao vây thành phố quê nhà Syracuse ở Sicily. Sau hai năm, người La Mã cuối cùng đã tìm cách vào được, và Archimedes đã bị giết. Những lời cuối cùng của anh ấy là <em>, Đừng làm phiền các vòng kết nối của tôi.</em> - lúc đó anh ấy đang học.</p>","links":[{"title":"Archimedean Solids","url":"/course/polyhedra/platonic#archimedean"}]},"fuller":{"name":"Fuller","bio":"<p><strong>Richard Buckminster Hồi Bucky Hồi Fuller</strong> (1895 - 1983) là một kiến trúc sư, nhà thiết kế và nhà phát minh người Mỹ. Ông nổi tiếng với việc xây dựng <em>vòm trắc địa</em> - các cấu trúc hình cầu lớn. Các phân tử Carbon trông tương tự, <em>fullerenes</em>, sau đó được đặt theo tên ông.</p>"}}