{"escher":{"name":"Escher","born":1898,"died":1972,"bio":"<p><strong>Maurits Cornelis Escher</strong> (1898 – 1972) a fost un artist olandez care a creat schițe, xilogravuri, și litografii pentru obiecte și forme de inspirație matematică: inclusiv poliedre, mozaicări și forme imposibile. El a explorat grafic concepte precum simetria, infinitatea, perspectiva și geometria euclidiană.</p>","small":true,"links":[{"title":"Tessellations in Art","url":"/course/polyhedra/tessellations#escher"}]},"penrose":{"name":"Penrose","born":1931,"bio":"<p><strong>Sir Roger Penrose</strong> (n. 1931) este un matematician și fizician britanic cunoscut pentru lucrările sale inovatoare în relativitatea generală și cosmologie - colaborând adesea cu alți oameni de știință faimoși precum Stephen Hawking și Michael Atiyah. De asemenea, el a descoperit <em>Placările Penrose</em>: mozaicări autosimilare neperiodice.</p>","links":[{"title":"Penrose Tilings","url":"/course/polyhedra/tessellations#penrose"}]},"euler":{"name":"Euler","born":1707,"died":1783,"bio":"<p><strong>Leonhard Euler</strong> (1707 – 1783) a fost unul dintre cei mai mari matematicieni din istorie. Munca sa acoperă toate ramurile matematicii și el a scris 80 de volume de cercetare.</p><p>Euler s-a născut în Elveția și a studiat la Basel, dar a trăit marea parte a vieții sale în Berlin, Prusia și în St. Petersburg, Rusia.</p><p>Euler a inventat o mare parte din terminologia și notațiile matematicii moderne și a făcut descoperiri importante în analiză, teoria grafurilor, fizică, astronomie și în multe alte subiecte.</p>","links":[{"title":"Königsberg Bridges Problem","url":"/course/graph-theory/bridges"},{"title":"Euler’s Formula","url":"/course/graph-theory/planar-graphs"},{"title":"Polyhedrons"}]},"plato":{"name":"Plato","born":-425,"died":-347,"bio":"<p><strong>Platon</strong> (c. 425 - 347 î.e.n.) a fost un filozof în Grecia antică și - împreună cu profesorul său Socrate și elevul său Aristotel - au pus bazele filosofiei și științei occidentale.</p><p>Platon a fondat Academia din Atena, prima instituție de învățare superioară din lumea occidentală. Numeroasele sale scrieri despre filozofie și teologie, știință și matematică, politică și dreptate, îl fac unul dintre cei mai influenți gânditori din toate timpurile.</p>","links":[{"title":"Platonic Solids","url":"/course/polyhedra/platonic"}]},"archimedes":{"name":"Arhimede","born":-287,"died":-212,"bio":"<p><strong>Arhimede</strong> (c. 287 – c. 212 î.Hr.) a fost un om de știință și inginer din Grecia Antică, precum și cel mai mare matematician din toate timpurile. El a descoperit multe concepte de calcul și a lucrat în geometrie, analiză și mecanică.</p><p>Arhimede a descoperit în timp ce făcea baie o metodă de a calcula voumul obiectelor de formă neregulată folosind cantitatea de apă dislocată la scufundare. El a fost atât de entuziasmat de descoperirea lui încât a ieșit în fugă pe stradă, dezbrăcat, strigând <em>“Eureka!”</em> (<em>“Am descoperit!”</em> în limba greacă).</p><p>Ca iniginer, el a construit mașinării ingenioase de apărare în timpul asediului orașului Siracuza din Sicilia în care locuia. După doi ani romanii au reușit până la urmă să intre și Arhimede a fost omorât. Ultimele sale cuvinte au fost <em>“Nu îmi deranjați cercurile”</em> – pe care le studia în acel moment.</p>","links":[{"title":"Archimedean Solids","url":"/course/polyhedra/platonic#archimedean"}]},"fuller":{"name":"Fuller","bio":"<p><strong>Richard Buckminster „Bucky” Fuller</strong> (1895 - 1983) a fost un arhitect, designer și inventator american. Este faimos pentru construirea <em>cupolei geodezice</em> - o structură sferică mare. Moleculele de carbon cu aspect similar, <em>fulerenele</em>, au fost numite mai târziu după el.</p>"}}