{"escher":{"name":"Escher","born":1898,"died":1972,"bio":"<p><strong>Maurits Cornelis Escher</strong> (1898 - 1972), riyazi ilə ilhamlanmış cisim və formaların eskizləri, ağac kəsmələri və litoqrafları yaratmış bir holland sənətkarı idi: polyhedra, tessellations və qeyri-mümkün formalar daxil olmaqla. Simmetriya, sonsuzluq, perspektiv və evklid olmayan həndəsə kimi anlayışları qrafik olaraq araşdırdı.</p>","small":true,"links":[{"title":"Tessellations in Art","url":"/course/polyhedra/tessellations#escher"}]},"penrose":{"name":"Penrose","born":1931,"bio":"<p><strong>Sir Roger Penrose</strong> (1931-ci il təvəllüdlü) - ümumi nisbi və kosmologiyada təməlqoyma işləri ilə tanınan İngilis riyaziyyatçısı və fizikidir - tez-tez Stephen Hawking və Michael Atiyah kimi digər məşhur elm adamları ilə əməkdaşlıq edir. Ayrıca <em>Penrose Tilings</em> -i də aşkar etdi: özünə bənzər, dövri olmayan tessellations.</p>","links":[{"title":"Penrose Tilings","url":"/course/polyhedra/tessellations#penrose"}]},"euler":{"name":"Euler","born":1707,"died":1783,"bio":"<p><strong>Leonhard Euler</strong> (1707 - 1783) tarixin ən böyük riyaziyyatçılarından biri idi. Onun işi riyaziyyatın bütün sahələrini əhatə edir və 80 cildlik tədqiqat yazmışdır.</p><p>Euler İsveçrədə anadan olmuş və Bazeldə oxumuş, lakin ömrünün çox hissəsini Berlində, Prussiyada və Sankt-Peterburqda keçirmişdir.</p><p>Euler müasir riyazi terminologiyanın və notasiyanın çoxunu icad etdi, hesablama, təhlil, qrafika nəzəriyyəsi, fizika, astronomiya və bir çox digər mövzularda mühüm kəşflər etdi.</p>","links":[{"title":"Königsberg Bridges Problem","url":"/course/graph-theory/bridges"},{"title":"Euler’s Formula","url":"/course/graph-theory/planar-graphs"},{"title":"Polyhedrons","url":"/course/polyhedra/polyhedra"}]},"plato":{"name":"Plato","born":-425,"died":-347,"bio":"<p><strong>Platon</strong> (e.ə. 425 - e.ə. 347) qədim Yunanıstanda bir filosof idi və müəllimi Sokrat və tələbəsi Aristotel ilə birlikdə Qərb fəlsəfəsi və elminin əsasını qoydu.</p><p>Platon, Qərb dünyasında ilk ali təhsil müəssisəsi olan Afina Akademiyasını qurdu. Fəlsəfə və ilahiyyat, elm və riyaziyyat, siyasət və ədalət mövzusunda yazdığı çoxsaylı yazıları onu bütün dövrlərin ən nüfuzlu mütəfəkkirlərindən birinə çevirir.</p>","links":[{"title":"Platonic Solids","url":"/course/polyhedra/platonic"}]},"archimedes":{"name":"Archimedes","born":-287,"died":-212,"bio":"<p><strong>Arximed</strong> (e.ə. 287 - e.ə. 212) qədim yunan alimi və mühəndisi və bütün dövrlərin ən böyük riyaziyyatçılarından biri idi. Hesablama anlayışlarının çoxunu kəşf etdi və həndəsə, analiz və mexanikada çalışdı.</p><p>Vanna qəbul edərkən Arximed, suya düşdükləri zaman suyun miqdarından istifadə edərək nizamsız cisimlərin həcmini müəyyənləşdirmək üçün bir yol tapdı. O, bu kəşfdən o qədər həyəcanlandı ki, hələ də soyunmadan, küçəyə çıxdı və <em>\"Evrika!\"</em> (Yunan dilində <em>\"Mən onu tapdım!\"</em>).</p><p>Bir mühəndis kimi, Siciliyadakı vətəni Sirakuzanın mühasirəsi zamanı usta müdafiə maşınları qurdu. İki ildən sonra romalılar nəhayət içəri girə bildilər və Arximed öldürüldü. Son sözləri <em>\"Dairələrimi narahat etmə\"</em> - o vaxt oxudu.</p>","links":[{"title":"Archimedean Solids","url":"/course/polyhedra/platonic#archimedean"}]},"fuller":{"name":"Fuller","bio":"<p><strong>Richard Buckminster \"Bucky\" Fuller</strong> (1895 - 1983) Amerikalı memar, dizayner və ixtiraçı idi. O, <em>geodeziya qübbəsi</em> - iri, sferik quruluşlar tikməklə məşhurdur. Oxşar görünüşlü Karbon molekulları, <em>fullerenes</em> sonradan onun adını aldı.</p>"}}