{"escher":{"name":"Escher","born":1898,"died":1972,"bio":"<p><strong>Maurits Cornelis Escher</strong> (1898 – 1972) matematikten esinlenmiş nesneler ve şekillerin(çokgenler, yüzey kaplamaları ve imkansız şekiller) eskizlerini, tahtadan oyma modellerini ve taş baskılarını yapan Hollandalı bir sanatçıydı. Öklid-dışı geometriler, sonsuzluk, perspektif ve simetri gibi kavramları çizimleri aracılığı ile incelemiştir.</p>","small":true,"links":[{"title":"Sanatta Yüzey Kaplamaları","url":"/course/polyhedra/tessellations#escher"}]},"penrose":{"name":"Penrose","born":1931,"died":2020,"bio":"<p><strong>Sir Roger Penrose</strong> (born 1931) İngiliz bir matematikçi ve fizikçidir. Stephen Hawking ve Michael Atiyah gibi ünlü bilim insanlarıyla birlikte çalışarak, genel görelilik ve kozmoloji alanlarında çığır açan işler yapmıştır. Ayrıca _Penrose Kaplamaları_nı keşfetmiştir: kendisini tekrar eden, periyodik olmayan kaplamalar.</p>","links":[{"title":"Penrose Kaplamaları","url":"/course/polyhedra/tessellations#penrose"}]},"euler":{"name":"Euler","born":1707,"died":1783,"bio":"<p><strong>Leonhard Euler</strong> (1707 – 1783), tüm zamanların en büyük matematikçilerinden biriydi. Yaptığı çalışmalar matematiğin bütün dalları kapsar, tam 80 cilt matematik araştırması vardır!</p><p>İsviçre doğumlu olan Euler, Basel’de eğitim almıştır ancak hayatının büyük bir çoğunluğunu Berlin, Prusya ve St. Petersburg, Rusya’da geçirmiştir.</p><p>Euler modern matematikte kullandığımız terminoloji ve gösterimleri bize kazandıran kişidir. Ayrıca kalkülüs, analiz, çizgeler kuramı, fizik, astronomi ve daha birçok alanda önemli keşifler yapmıştır.</p>","links":[{"title":"Königsberg Köprüsü Problemi","url":"/course/graph-theory/bridges"},{"title":"Euler Formülü","url":"/course/graph-theory/planar-graphs"},{"title":"Çokyüzlüler","url":"/course/polyhedra/polyhedra"}]},"plato":{"name":"Platon","born":-425,"died":-347,"bio":"<p><em>Platon_</em> (M.Ö. 425 – 347 ) antik Yunan’da bir filozoftu, - öğretmeni Socrates ve öğrencisi Aristoteles ile birlikte- Batı felsefesi ve biliminin temelini attı.</p><p>Platon, Batı dünyasında ilk yüksek öğrenim kurumu olan Atina Akademisi'ni kurdu. Felsefe ve teoloji, bilim ve matematik, politika ve adalet üzerine yaptığı birçok yazı onu tüm zamanların en etkili düşünürlerinden biri yapar.</p>","links":[{"title":"Platonik Cisimler","url":"/course/polyhedra/platonic"}]},"archimedes":{"name":"Archimedes","born":-287,"died":-212,"bio":"<p><strong>Arşimed</strong> (M.Ö. 287 – 212 ) eski bir Yunan bilim insanı ve mühendisiydi. Tüm zamanların en büyük matematikçilerinden biriydi. Birçok matematik kavramını keşfetti. Geometri, analiz ve mekanik alanlarında çalıştı.</p><p>Arşimed, banyo yaparken, cisimlerin suya batırılımasıyla meydana gelen suyun yer değiştirme miktarını kullanarak düzensiz cisimlerin hacmini belirlemenin bir yolunu buldu. Bu keşif sayesinde öylesine heyecanlandı ki, sokakta, hala soyunmuş halde iken <em>“Eureka!”</em> diye bağırdı (Yunanca’da <em>“Onu buldum!”</em>).</p><p>Sicilya'daki memleketi Syracuse'nin kuşatması sırasında, bir mühendis olarak, ustalıkla savunma makineleri yaptı. İki yıl sonra, Romalıların sonunda girmeyi başardığı Syracuse’ta Arşimed öldürüldü. Son sözleri, o sırada üzerinde çalıştığı <em>“Çemberlerime dokunma”</em> idi.</p>","links":[{"title":"Arşimed Cisimleri","url":"/course/polyhedra/platonic"}]},"fuller":{"name":"Fuller","bio":"<p><strong>Richard Buckminster “Bucky” Fuller</strong> (1895 – 1983) Amerikalı bir mimar, tasarımcı ve mucittir. Kocaman, küresel yapılar olan <em>jeodezik kubbeler</em> inşalarıyla ünlüdür. Benzer görünümdeki karbon molekülü _fullerenes_in adı buradan gelir.</p>"}}