{"escher":{"name":"Escher","born":1898,"died":1972,"bio":"<p>Maurits Cornelis Escher__ (1898 - 1972) foi um artista holandês que criou esboços, xilogravuras e litografias de objetos e formas matematicamente inspirados: incluindo poliedros, mosaicos e formas impossíveis. Ele explorou graficamente conceitos como simetria, infinito, perspectiva e geometria não euclidiana.</p>","small":true,"links":[{"title":"Tessellations in Art","url":"/course/polyhedra/tessellations#escher"}]},"penrose":{"name":"Penrose","born":1931,"bio":"<p>Sir Roger Penrose__ (nascido em 1931) é um matemático e físico britânico conhecido por seu trabalho inovador em relatividade e cosmologia geral - muitas vezes colaborando com outros cientistas famosos como Stephen Hawking e Michael Atiyah. Ele também descobriu <em>Penrose Tilings</em>: mosaicos auto-semelhantes e não periódicos.</p>","links":[{"title":"Penrose Tilings","url":"/course/polyhedra/tessellations#penrose"}]},"euler":{"name":"Euler","born":1707,"died":1783,"bio":"<p><strong>Leonhard Euler</strong> (1707 - 1783) foi um dos maiores matemáticos da história. Seu trabalho abrange todas as áreas da matemática e ele escreveu 80 volumes de pesquisa.</p><p>Euler nasceu na Suíça e estudou em Basileia, mas viveu a maior parte de sua vida em Berlim, Prússia e São Petersburgo, Rússia.</p><p>Euler inventou grande parte da terminologia e notação matemática moderna e fez importantes descobertas em cálculo, análise, teoria de grafos, física, astronomia e muitos outros tópicos.</p>","links":[{"title":"Königsberg Bridges Problem","url":"/course/graph-theory/bridges"},{"title":"Euler’s Formula","url":"/course/graph-theory/planar-graphs"},{"title":"Polyhedrons","url":"/course/polyhedra/polyhedra"}]},"plato":{"name":"Plato","born":-425,"died":-347,"bio":"<p><strong>Platão</strong> (c. 425 - 347 AEC) era um filósofo na Grécia antiga e - junto com seu professor Sócrates e seu aluno Aristóteles - lançou os fundamentos da filosofia e ciência ocidentais.</p><p>Platão fundou a Academia de Atenas, a primeira instituição de ensino superior do mundo ocidental. Seus muitos escritos sobre filosofia e teologia, ciência e matemática, política e justiça, fazem dele um dos pensadores mais influentes de todos os tempos.</p>","links":[{"title":"Platonic Solids","url":"/course/polyhedra/platonic"}]},"archimedes":{"name":"Archimedes","born":-287,"died":-212,"bio":"<p>Arquimedes__ (c. 287 - 212 aC) era um antigo cientista e engenheiro grego, e um dos maiores matemáticos de todos os tempos. Ele descobriu muitos conceitos de cálculo e trabalhou em geometria, análise e mecânica.</p><p>Enquanto tomava banho, Arquimedes descobriu uma maneira de determinar o volume de objetos irregulares usando a quantidade de água que eles deslocavam quando submersos. Ele ficou tão empolgado com essa descoberta que saiu correndo pelas ruas, ainda sem roupa, gritando <em>“Eureka!”</em> (em grego para <em>“eu encontrei!”</em>).</p><p>Como engenheiro, ele construiu engenhosas máquinas de defesa durante o cerco de sua cidade natal, Siracusa, na Sicília. Depois de dois anos, os romanos finalmente conseguiram entrar e Arquimedes foi morto. Suas últimas palavras foram <em>“Não perturbe meus círculos”</em> - que ele estava estudando na época.</p>","links":[{"title":"Archimedean Solids","url":"/course/polyhedra/platonic#archimedean"}]},"fuller":{"name":"Fuller","bio":"<p>Richard Buckminster \"Bucky\" Fuller__ (1895 - 1983) foi um arquiteto, designer e inventor americano. Ele é famoso por construir <em>cúpula geodésica</em> - grandes estruturas esféricas. Moléculas de carbono com aparência semelhante, os <em>fulerenos</em>, foram posteriormente nomeadas em homenagem a ele.</p>"}}