{"escher":{"name":"Escher","born":1898,"died":1972,"bio":"<p><strong>Мауриц Корнелис Эшер</strong> (1898 - 1972) был нидерландским художником, который создавал эскизы, ксилографии и литографии математически вдохновленных объектов и фигур: включая многогранники, тесселяции и невозможные формы. Он графически исследовал такие понятия, как симметрия, бесконечность, перспектива и неевклидова геометрия.</p>","small":true,"links":[{"title":"Тесселяция в искусстве","url":"/course/polyhedra/tessellations#escher"}]},"penrose":{"name":"Penrose","born":1931,"bio":"<p><strong>Сэр Роджер Пенроуз</strong> (родился в 1931 году) - английский математик и физик, известный своими новаторскими работами в области общей теории относительности и космологии, часто сотрудничающий с другими известными учеными, такими как Стивен Хокинг и Майкл Атья. Он также открыл <em>Мозаику Пенроуза</em>: самоподобные непериодические замощения.</p>","links":[{"title":"Мозаика Пенроуза","url":"/course/polyhedra/tessellations#penrose"}]},"euler":{"name":"Euler","born":1707,"died":1783,"bio":"<p><strong>Леонард Эйлер</strong> (1707 - 1783) был одним из величайших математиков в истории. Его работы охватывают все области математики, и он написал 80 томов исследований.</p><p>Эйлер родился в Швейцарии и учился в Базеле, но большую часть жизни прожил в Берлине, Пруссии и Санкт-Петербурге, России.</p><p>Эйлер ввел большую часть современной математической терминологии и обозначений, и сделал важные открытия в исчислении, анализе, теории графов, физике, астрономии и многих других темах.</p>","links":[{"title":"Задача о семи кёнигсбергских мостах","url":"/course/graph-theory/bridges"},{"title":"Формула Эйлера","url":"/course/graph-theory/planar-graphs"},{"title":"Многогранники","url":"/course/polyhedra/polyhedra"}]},"plato":{"name":"Plato","born":-425,"died":-347,"bio":"<p><strong>Платон</strong> (ок. 425 - 347 гг. До н.э.) был древнегреческим философом и - вместе со своим учителем Сократом и учеником Аристотелем - заложил основы западной философии и науки.</p><p>Платон основал Платоновскую академию, первое высшее учебное заведение в западном мире. Его многочисленные работы по философии и теологии, науке и математике, политике и правосудию делают его одним из самых влиятельных мыслителей всех времен.</p>","links":[{"title":"Платоновы тела","url":"/course/polyhedra/platonic"}]},"archimedes":{"name":"Archimedes","born":-287,"died":-212,"bio":"<p><strong>Архимед</strong> (ок. 287 - 212 до н.э.) был древнегреческим ученым и инженером и одним из величайших математиков всех времен. Он открыл много концепций исчисления и работал в области геометрии, анализа и механики.</p><p>Принимая ванну, Архимед нашел способ определить объем нерегулярных объектов, используя количество воды, которое они вытеснили при погружении в воду. Он был так взволнован этим открытием, что выбежал на улицу, все еще раздетый, крича <em>«Эврика!»</em> (по-гречески <em>«Я нашел это!»</em>).</p><p>Как инженер, он построил гениальные защитные машины во время осады его родного города Сиракузы на Сицилии. Через два года римлянам наконец удалось войти, и Архимед был убит. Его последними словами были <em>«Не мешай моим кругам»</em> - которые он изучал в то время.</p>","links":[{"title":"Архимедово тело","url":"/course/polyhedra/platonic#archimedean"}]},"fuller":{"name":"Fuller","bio":"<p><strong>Ричард Бакминстер «Баки» Фуллер</strong> (1895-1983) был американским архитектором, дизайнером и изобретателем. Он известен строительством <em>геодезического купола</em> - крупных сферических структур. Подобные молекулы углерода, <em>фуллерены</em>, были названы в его честь.</p>"}}