{"polygon":{"title":"Polígono","text":"<p>Un <strong>polígono</strong> es una forma geométrica que se compone de segmentos de línea recta. Los polígonos no pueden contener lados curvos ni agujeros. Por ejemplo, un cuadrado es un polígono pero un círculo no lo es.</p>","image":"polygon.svg","link":"/course/polyhedra/polygons#polygons"},"internal-angle":{"title":"Ángulos internos","text":"<p>Los <strong>ángulos internos</strong> de un polígono son los ángulos en el interior, en cada vértice.</p>","image":"internal-angle.svg"},"concave":{"title":"Polígono cóncavo","text":"<p>Un polígono <strong>cóncavo</strong> tiene al menos un ángulo interno mayor que 180 °. Al menos una de las diagonales se encuentra <em>fuera de</em> el polígono. Una forma común de identificar un polígono cóncavo es buscar un lado \"hundido\" del polígono. <em>Cóncavo</em> es lo opuesto a <em>polígonos convexos</em>.</p>","link":"/course/polyhedra/polygons#concave"},"convex":{"title":"Polígono convexo","text":"<p>Un polígono <strong>convexo</strong> no contiene ángulos internos mayores que 180 °. Todas las diagonales se encuentran dentro del polígono. Esto es lo opuesto a <em>polígonos cóncavos</em>.</p>","link":"/course/polyhedra/polygons#concave"},"regular-polygon":{"title":"Polígono regular","text":"<p>Un <strong>polígono regular</strong> es un polígono en el que todos los lados tienen la misma longitud y todos los ángulos interiores tienen el mismo tamaño.</p>","image":"regular-polygon.svg","link":"/course/polyhedra/polygons#regular-polygons"},"rectangle":{"title":"Rectángulo","text":"<p>Un <strong>rectángulo</strong> es un cuadrilátero en el que los cuatro ángulos son 90 °.</p>","link":"/course/polyhedra/quadrilaterals#quadrilaterals-1"},"rhombus":{"title":"Rombo","text":"<p>Un <strong>rombo</strong> (el plural es <em>rombos</em> o <em>rombo</em>) es un cuadrilátero en el que todos los lados tienen la misma longitud.</p>","link":"/course/polyhedra/quadrilaterals#quadrilaterals-1"},"parallel":{"title":"Lineas paralelas","text":"<p>Dos o más líneas son <strong>paralelas</strong> si nunca se cruzan. Tienen la misma pendiente y la distancia entre ellos siempre es constante.</p>","image":"parallel.svg","link":"/course/euclidean-geometry/definitions#parallel"},"venn-diagram":{"title":"diagrama de Venn","text":"<p>Un <strong>diagrama de Venn</strong> visualiza múltiples propiedades o eventos que se superponen.</p>","image":"venn.svg"},"polygon-diagonal":{"title":"Diagonal","text":"<p>Una <strong>diagonal</strong> de un polígono es un segmento de línea que conecta dos vértices que no están uno al lado del otro.</p>"},"triangle-midsegment":{"title":"Segmento medio","text":"<p>Los <strong>segmentos medios</strong> de un triángulo son las líneas que conectan los puntos medios de diferentes lados del triángulo.</p>","image":"triangle-midsegment.svg","link":"/course/triangles/midsegments"},"parallelogram":{"title":"Paralelogramo","text":"<p>Un <strong>paralelogramo</strong> es un cuadrilátero en el que ambos pares de lados opuestos son paralelos.</p>","link":"/course/polyhedra/quadrilaterals#parallelograms"},"alternate-angles":{"title":"Ángulos alternos","text":"<p><strong>Los ángulos alternos</strong> están formados por dos <em>líneas paralelas</em> que están cruzadas por una línea transversal __, y siempre son congruentes. En el siguiente diagrama, cada uno de los pares de ángulos etiquetados 1, 2, 3 y 4 son alternativos. Los dos ángulos en cada par se encuentran en una línea paralela diferente y en lados opuestos del recorrido.</p><p>Los pares de ángulos 1 y 2 se denominan <strong>ángulos exteriores alternos</strong>, porque se encuentran fuera de las líneas paralelas, y los pares de ángulos 3 y 4 se denominan <strong>ángulos alternos internos</strong>.</p>"},"axis-of-symmetry":{"title":"Eje de simetria","text":"<p>Si una forma tiene simetría de reflexión, el eje de simetríaes la línea que la divide en dos mitades iguales.</p>","image":"reflectional-symmetry.svg","link":"/course/transformations/symmetry#reflectional-symmetry"},"triangle-sss":{"title":"Condición SSS para triángulos","text":"<p>Dos triángulos son <strong>congruentes</strong> si sus tres lados tienen la misma longitud. Esto se llama la <strong>condición de congruencia SSS</strong> para los triángulos.</p>","link":"/course/triangles/congruence#congruence-1"},"cpoct":{"title":"CPOCT","text":"<p>CPOCT significa <strong>partes correspondientes de triángulos congruentes</strong>. Significa que si dos triángulos son congruentes, entonces todos sus componentes correspondientes (ángulos, lados, segmentos medios, ...) también deben ser congruentes entre sí.</p>","link":"/course/triangles/congruence#cpoct"},"supplementary-angles":{"title":"Ángulos suplementarios","text":"<p>Dos ángulos son <strong>suplementarios</strong> si suman 180 ° (un semicírculo).</p>"},"tessellation":{"title":"Mosaico","text":"<p>Una <strong>teselación</strong> es un patrón geométrico que cubre una superficie sin espacios ni superposiciones.</p>","link":"/course/polyhedra/tessellations"},"polygon-vertex":{"title":"Vértice de un polígono","text":"<p>Los <strong>vértices</strong> de un polígono son los puntos donde se encuentran sus lados adyacentes (sus \"esquinas\").</p>"},"irregular-polygon":{"title":"Polígono irregular","text":"<p>Un <strong>polígono irregular</strong> es uno que <em>no es regular</em>. Esto significa que los lados o los ángulos no tienen todos el mismo tamaño.</p>"},"polyhedron":{"title":"Poliedro","text":"<p>Un <strong>poliedro</strong> (el plural es <em>poliedro</em>) es un sólido tridimensional sin superficies curvas o bordes. Todas las caras de un poliedro son polígonos. Por ejemplo, un cubo y una pirámide son poliedros, pero una esfera no lo es.</p>","link":"/course/polyhedra/polyhedra"},"polyhedron-face":{"title":"Cara de un poliedro","text":"<p>Las <strong>caras</strong> de un poliedro son los polígonos que forman su superficie.</p>","link":"/course/polyhedra/polyhedra"},"polyhedron-edge":{"title":"Borde de un poliedro","text":"<p>Los <strong>bordes</strong> de un poliedro son los segmentos de línea donde están conectadas dos de sus caras.</p>","link":"/course/polyhedra/polyhedra"},"polyhedron-vertex":{"title":"Vértice de un poliedro","text":"<p>Las \"esquinas\" de un poliedro se llaman vértices ____.</p>","link":"/course/polyhedra/polyhedra"},"platonic-solid":{"title":"Sólido platónico","text":"<p>Un <strong>sólido platónico</strong> es un poliedro donde cada cara es un polígono regular con el mismo número de aristas, y donde el mismo número de caras se encuentran en cada vértice. Solo hay cinco sólidos platónicos diferentes: el tetraedro, el cubo, el octaedro, el dodecaedro y el icosaedro.</p>","link":"/course/polyhedra/platonic"},"equilateral-triangle":{"title":"Triángulo equilátero","text":"<p>Un <strong>triángulo equilátero</strong> es un triángulo en el que los tres lados tienen la misma longitud.</p>"},"polyhedron-dual":{"title":"Dual de un poliedro","text":"<p>TODO</p>","link":"/course/polyhedra/platonic#platonic-dual"},"archimedean-solid":{"title":"Sólido de Archimedean","text":"<p>Un <strong>sólido Archimedean</strong> es un poliedro formado por diferentes tipos de polígonos regulares, que se ve igual desde todas las direcciones. Hay 13 sólidos de Archimedean diferentes.</p>","link":"/course/polyhedra/platonic#archimedean"},"icosahedron":{"title":"Icosaedro","text":"<p>El <strong>icosaedro</strong> es un sólido platónico y consta de 20 caras que son todos triángulos equiláteros. Tiene 12 vértices y 30 aristas.</p>","link":"/course/polyhedra/platonic#platonic-overview"},"truncated-icosahedron":{"title":"Icosaedro Truncado","text":"<p>El <strong>Icosaedro Truncado</strong> es un <em>sólido Archimedean</em> que consta de 12 pentágonos regulares y 20 hexágonos regulares.</p>","link":"/course/polyhedra/platonic#archimedean"},"tetrahedron":{"title":"Tetraedro","text":"<p>El <strong>Tetraedro</strong> es un sólido platónico y consta de cuatro caras que son triángulos equiláteros. Tiene cuatro vértices y seis aristas.</p>","link":"/course/polyhedra/platonic#platonic-overview"},"cube":{"title":"Cubo","text":"<p>Un <strong>cubo</strong> (a veces llamado <strong>Hexahedron</strong>) es un poliedro regular en el que cada cara es un cuadrado. Es uno de los cinco <em>sólidos platónicos</em>, y tiene 6 caras, 8 vértices y 12 aristas.</p>","link":"/course/polyhedra/platonic#platonic-overview"},"octahedron":{"title":"Octaedro","text":"<p>El <strong>octaedro</strong> es un sólido platónico y consta de 8 caras que son triángulos equiláteros. Tiene 6 vértices y 12 aristas.</p>","link":"/course/polyhedra/platonic#platonic-overview"},"probability":{"title":"Probabilidad","text":"<p>Una <strong>probabilidad</strong> es un número entre 0 y 1 que indica la probabilidad de que ocurra cierto evento. La probabilidad de un evento <em>A</em> se escribe como <span class=\"nowrap\"><span class=\"math\" data-voice=\"P of A\"><mi>P</mi><mfenced><mi>A</mi></mfenced></span>.</span></p>"},"congruent":{"title":"Congruencia","text":"<p>En geometría, dos figuras son <strong>congruentes</strong> si son idénticas en tamaño, forma y medida. Esto significa que podríamos moverlos, voltearlos o rotarlos para encajar exactamente uno encima del otro.</p>","link":"/course/euclidean-geometry/definitions#congruence"},"angle-bisector":{"title":"Bisectriz","text":"<p>Una bisectriz de ánguloes una línea o rayo que divide un ángulo por la mitad, en dos ángulos congruentes y más pequeños.</p>","image":"angle-bisector.svg"}}