{"polygon":{"title":"Poligon","text":"<p>Un <strong>poligon</strong> este o formă geometrică alcătuită din segmente de linie drepte. Poligoanele nu pot conține laturi curbe sau goluri. De exemplu, un pătrat este un poligon, dar un cerc nu.</p>","image":"polygon.svg","link":"/course/polyhedra/polygons#polygons"},"internal-angle":{"title":"Unghiuri interne","text":"<p><strong>Unghiurile interne</strong> ale unui poligon sunt unghiurile din interior aflate la fiecare vârf.</p>","image":"internal-angle.svg"},"concave":{"title":"Poligon concav","text":"<p>Un poligon <strong>concav</strong> are cel puțin un unghi intern cu măsura mai mare ca 180°. Cel puțin una din diagonale se află <em>în exteriorul</em> poligonului. O metodă comună de identificare a unui poligon concav este de a căuta o latură “săpată în interior”. Poligoanele <em>concave</em> sunt opusul poligoanelor <em>convexe</em>.</p>","link":"/course/polyhedra/polygons#concave"},"convex":{"title":"Poligonul convex","text":"<p>Un poligon <strong>convex</strong> nu conține unghiuri interne mai mari de 180 °. Toate diagonalele se află în interiorul poligonului. Acesta este opusul poligonului <em>concav</em>.</p>","link":"/course/polyhedra/polygons#concave"},"regular-polygon":{"title":"Poligon regulat","text":"<p>Un <strong>poligon regulat</strong> este un poligon în care toate laturile au aceeași lungime și toate unghiurile interne au aceeași măsură.</p>","image":"regular-polygon.svg","link":"/course/polyhedra/polygons#regular-polygons"},"rectangle":{"title":"Dreptunghi","text":"<p>Un <strong>dreptunghi</strong> este un patrulater în cate toate cele patru unghiuri au măsura de 90°.</p>","link":"/course/polyhedra/quadrilaterals#quadrilaterals-1"},"rhombus":{"title":"Romb","text":"<p>Un <strong>romb</strong> (pluralul este <em>romburi</em>) este patrulaterul care are toate laturile de aceeași lungime.</p>","link":"/course/polyhedra/quadrilaterals#quadrilaterals-1"},"parallel":{"title":"Drepte paralele","text":"<p>Două sau mai multe drepte sunt <strong>paralele</strong> dacă nu se intersectează niciodată. Ele au aceeași pantă, iar distanța dintre ele este întotdeauna constantă.</p>","image":"parallel.svg","link":"/course/euclidean-geometry/definitions#parallel"},"venn-diagram":{"title":"Diagramă Venn","text":"<p>O <strong>diagramă Venn</strong> prezintă în mod vizual mai multe proprietăți sau evenimente care se suprapun.</p>","image":"venn.svg"},"polygon-diagonal":{"title":"Diagonală","text":"<p><strong>Diagonala</strong> unui poligon este un segment de dreaptă care unește două vârfuri care nu sunt alăturate.</p>"},"triangle-midsegment":{"title":"Linie mijlocie","text":"<p><strong>Liniile mijlocii</strong> ale unui triunghi sunt segmentele care unesc mijloacele a două laturi.</p>","image":"triangle-midsegment.svg","link":"/course/triangles/midsegments"},"parallelogram":{"title":"Paralelogram","text":"<p>Un <strong>paralelogram</strong> este un patrulater în care ambele perechi de laturi opuse sunt paralele.</p>","link":"/course/polyhedra/quadrilaterals#parallelograms"},"alternate-angles":{"title":"Unghiuri alterne","text":"<p><strong>Unghiurile alterne</strong> sunt unghiurile formate de două <em>drepte paralele</em> ce sunt taiate de o linie de <em>traversare</em>. Ele sunt mereu congruente. În diagrama de mai jos, fiecare pereche de unghiuri notate 1, 2, 3 and 4 sunt unghiuri alterne. Cele două unghiuri din fiecare pereche se află pe o linie paralelă diferită și de-o parte si de alta a linie de traversare.</p><p>Perechile de unghiuri 1 și 2 se numesc <strong>unghiuri alterne externe</strong>, deoarece se află pe partea de dinafară a dreptelor parelele, iar perechile de unghiuri 3 și 4 se numesc <strong>unghiuri alterne interioare</strong>.</p>"},"axis-of-symmetry":{"title":"Axa de simetrie","text":"<p>Dacă o formă are simetrie reflexivă, <strong>axa de simetrie</strong> este dreapta care o împarte în două jumătăți egale.</p>","image":"reflectional-symmetry.svg","link":"/course/transformations/symmetry#reflectional-symmetry"},"triangle-sss":{"title":"Criteriul de congruență LLL","text":"<p>Două triunghiuri sunt <strong>congruente</strong> dacă laturile lor au aceeași lungime. Numim aceasta <em>_Ctrieriul de congruență LLL</em> pentru triunghiuri.</p>","link":"/course/triangles/congruence#congruence-1"},"cpoct":{"title":"CPOCT","text":"<p>CPOCT stands for <strong>corresponding parts of congruent triangles</strong>. It means that if two triangles are congruent, then all of their corresponding components (angles, sides, midsegments, …) must also be congruent to each other.</p>","link":"/course/triangles/congruence#cpoct"},"supplementary-angles":{"title":"Unghiuri suplementare","text":"<p>Două unghiuri se numesc <strong>suplementare</strong> dacă suma lor este 180° (un semicerc).</p>"},"tessellation":{"title":"Mozaicare","text":"<p>O <strong>mozaicare</strong> este unșablon geometric care acoperă o suprafață astfel încât să nu existe goluri sau suprapuneri.</p>","link":"/course/polyhedra/tessellations"},"polygon-vertex":{"title":"Vârful unui poligon","text":"<p><strong>Vârfurile</strong> unui poligon sunt punctele de intersecție ale laturilor adiacente (“colțurile” sale).</p>"},"irregular-polygon":{"title":"Poligon neregulat","text":"<p>Un <strong>poligon neregulat</strong> este unul care <em>nu este regulat</em>. Aceasta înseamnă că fie laturile, cât și unghiurile nu au toate aceeași dimensiune.</p>"},"polyhedron":{"title":"Poliedru","text":"<p>Un <strong>poliedru</strong> (pluralul este <em>poliedru</em>) este un solid tridimensional fără suprafețe sau margini curbate. Toate fețele unui poliedru sunt poligoane. De exemplu, un cub și o piramidă sunt poliedre, dar o sferă nu este.</p>","link":"/course/polyhedra/polyhedra"},"polyhedron-face":{"title":"Fața unui poliedru","text":"<p><strong>fețe</strong> ale unui poliedru sunt poligonii care alcătuiesc suprafața sa.</p>","link":"/course/polyhedra/polyhedra"},"polyhedron-edge":{"title":"Marginea unui poliedru","text":"<p><strong>marginile</strong> ale unui poliedru sunt segmentele de linie la care sunt conectate două dintre fețele sale.</p>","link":"/course/polyhedra/polyhedra"},"polyhedron-vertex":{"title":"Vertexul unui poliedru","text":"<p>„Colțurile” unui poliedru sunt numite vârfurile sale 0 0.</p>","link":"/course/polyhedra/polyhedra"},"platonic-solid":{"title":"Corp platonic","text":"<p>Un <strong>corp platonic</strong> este un poliedru în care fiecare față este un poligon regulat ce are același număr de muchii și în care în fiecare vârf se întâlnesc același număr de fețe. Există doar cinci corpuri platonice diferite: tetraedru, cub, octaedru, dodecaedru și icosaedru.</p>","link":"/course/polyhedra/platonic"},"equilateral-triangle":{"title":"Triunghi echilateral","text":"<p>Un <strong>triunghi echilateral</strong> este un triunghi care are toate laturile egale.</p>"},"polyhedron-dual":{"title":"Dual dintr-un poliedru","text":"<p>TOT</p>","link":"/course/polyhedra/platonic#platonic-dual"},"archimedean-solid":{"title":"Solidd arhimedian","text":"<p>Un <strong>solid arhimedian</strong> este un poliedru construit din diferite tipuri de poligoane regulate și care arată la fel din orice direcție. Există 13 tipuri diferite de solide arhimediene.</p>","link":"/course/polyhedra/platonic#archimedean"},"icosahedron":{"title":"icosahedron","text":"<p>Icozaedruleste un solid platonic și este format din 20 de fețe care sunt toate triunghiuri echilaterale. Are 12 vârfuri și 30 de muchii.</p>","link":"/course/polyhedra/platonic#platonic-overview"},"truncated-icosahedron":{"title":"Icosaedru trunchiat","text":"<p><strong>Icosaedrul trunchiat</strong> este un <em>solid arhimedian</em> alcătuit din 12 pentagoane regulate și 20 de hexagoane regulate.</p>","link":"/course/polyhedra/platonic#archimedean"},"tetrahedron":{"title":"Tetraedru","text":"<p>Un <strong>tetaedru</strong> este un corp platonc alcătuit din patru fețe care sunt triunghiuri echilaterale. El are patru vârfuri și șase muchii.</p>","link":"/course/polyhedra/platonic#platonic-overview"},"cube":{"title":"cub","text":"<p>Un <strong>cub</strong> (numit uneori și <strong>hexaedru</strong>) este un poliedru regulat în care fiecare față este un pătrat. Este unul dintre cele cinci <em>solide platonice</em> și are 6 fețe, 8 vârfuri și 12 muchii.</p>","link":"/course/polyhedra/platonic#platonic-overview"},"octahedron":{"title":"Octaedru","text":"<p><strong>Octaedrul</strong> este un solid platonic și este alcătuit din 8 fețe care sunt triunghiuri echilaterale. Are 6 vârfuri și 12 muchii.</p>","link":"/course/polyhedra/platonic#platonic-overview"},"probability":{"title":"Probabilitate","text":"<p>O <strong>probabilitate</strong> este un număr între 0 și 1 care indică șansa apariției unui anumit eveniment. Probabilitatea unui eveniment <em>A</em> se notează cu <span class=\"nowrap\"><span class=\"math\" data-voice=\"P of A\"><mi>P</mi><mfenced><mi>A</mi></mfenced></span>.</span></p>"},"congruent":{"title":"Congruența","text":"<p>În geometrie, două figuri geometrice sunt <strong>congruente</strong> dacă sunt identice ca dimensiune, formă și mărime. Asta înseamnă că le putem muta, răsturna sau roti astfel încât să se potrivească exact una peste alta.</p>","link":"/course/euclidean-geometry/definitions#congruence"},"angle-bisector":{"title":"Bisectoarea unui unghi","text":"<p><strong>Bisectoarea unui unghi</strong> este o dreaptă sau semidreaptă care împarte un unghi pe jumătate, în două unghiuri mai mici, congruente.</p>","image":"angle-bisector.svg"}}