{"polygon":{"title":"Vieleck (Polygon)","text":"<p>Ein <strong>Vieleck</strong> ist eine geometrische Form, die aus geraden Strecken besteht. Vielecke dürfen keine gekrümmten Seiten oder Unterbrechungen enthalten. Zum Beispiel ist ein Quadrat ein Vieleck, ein Kreis aber nicht.</p>","image":"polygon.svg","link":"/course/polyhedra/polygons#polygons"},"internal-angle":{"title":"Innenwinkel","text":"<p>Die <strong>Innenwinkel</strong> eines Vielecks sind die Winkel auf der Innenseite eines jeden Eckpunkts.</p>","image":"internal-angle.svg"},"concave":{"title":"Konkaves Vieleck (Polygon)","text":"<p>Ein <strong>konkaves</strong> Vieleck hat mindestens einen Innenwinkel größer als 180° („nichtkonvexes Vieleck“). Mindestens eine der Diagonalen liegt <em>außerhalb</em> des Vielecks. Eine gängige Methode zur Identifizierung eines konkaven Vielecks ist die Suche nach einer eingefallenen Seite des Vielecks, wobei <em>konkave</em> das Gegenteil von <em>konvexen</em> Vielecken sind.</p>","link":"/course/polyhedra/polygons#concave"},"regular-polygon":{"title":"Regelmäßiges Vieleck","text":"<p>Bei einem <strong>regelmäßigen Vieleck</strong> haben alle Seiten die gleiche Länge und alle Innenwinkel die gleiche Größe.</p>","image":"regular-polygon.svg","link":"/course/polyhedra/polygons#regular-polygons"},"rectangle":{"title":"Rechteck","text":"<p>Ein <strong>Rechteck</strong> ist ein Viereck, bei dem alle vier Winkel 90° betragen.</p>","link":"/course/polyhedra/quadrilaterals#quadrilaterals-1"},"rhombus":{"title":"Raute","text":"<p>Eine <strong>Raute</strong> oder Rhombus (der Plural ist <em>Rhomben</em> oder <em>Rauten</em>) ist ein Viereck, bei dem alle Seiten die gleiche Länge haben.</p>","link":"/course/polyhedra/quadrilaterals#quadrilaterals-1"},"parallel":{"title":"Parallele Geraden","text":"<p>Zwei oder mehr Geraden sind <strong>parallel</strong>, wenn sie sich nie schneiden. Sie haben die gleiche Steigung und der Abstand zwischen ihnen ist immer konstant.</p>","image":"parallel.svg","link":"/course/euclidean-geometry/definitions#parallel"},"venn-diagram":{"title":"Venn-Diagramm","text":"<p>Ein <strong>Venn-Diagramm</strong> visualisiert mehrere Eigenschaften oder Ereignisse, die sich überschneiden.</p>","image":"venn.svg"},"polygon-diagonal":{"title":"Diagonale","text":"<p>Eine <strong>Diagonale</strong> eines Vielecks ist eine Strecke, die zwei Knoten verbindet, die nicht nebeneinander liegen.</p>"},"triangle-midsegment":{"title":"Mittelparallele","text":"<p>Die <strong>Mittelparallelen</strong> eines Dreiecks sind die Strecken, die die Mittelpunkte der verschiedenen Seiten des Dreiecks miteinander verbinden.</p>","image":"triangle-midsegment.svg","link":"/course/triangles/midsegments"},"parallelogram":{"title":"Parallelogramm","text":"<p>Ein <strong>Parallelogramm</strong> ist ein Viereck, bei dem beide Paare von gegenüberliegenden Seiten parallel sind.</p>","link":"/course/polyhedra/quadrilaterals#parallelograms"},"alternate-angles":{"title":"Wechselwinkel","text":"<p><strong>Wechselwinkel (Z-Winkel)</strong> sind zwei Winkel, die sich im Inneren von zwei verschiedenen <em>parallelen Geraden</em> befinden, aber auf den gegenüberliegenden Seiten einer <em>querenden Gerade</em>. Sie sind immer kongruent. In der Abbildung unten ist jedes der mit 1, 2, 3 und 4 gekennzeichneten Winkelpaare Wechselwinkel. Die beiden Winkel jedes Paars liegen auf einer anderen Parallelen und auf den gegenüberliegenden Seiten der querenden Gerade.</p><p>Die Winkelpaare 1 und 2 werden als <strong>äußere Wechselwinkel</strong>bezeichnet, da sie außerhalb der parallelen Linien liegen, und die Winkelpaare 3 und 4 als <strong>innere Wechselwinkel</strong>.</p>"},"axis-of-symmetry":{"title":"Symmetrieachse","text":"<p>Wenn eine Form spiegelsymmetrisch ist, ist die <strong>Symmetrieachse</strong> die Linie, die sie in zwei gleiche Hälften teilt.</p>","image":"reflectional-symmetry.svg","link":"/course/transformations/symmetry#reflectional-symmetry"},"triangle-sss":{"title":"SSS-Satz","text":"<p>Zwei Dreiecke sind <strong>kongruent</strong>, wenn ihre drei Seiten die gleiche Länge haben. Dies wird als <strong>SSS-Satz</strong> für Dreiecke bezeichnet.</p>","link":"/course/triangles/congruence#congruence-1"},"cpoct":{"title":"CPOCT","text":"<p>CPOCT steht für <strong>einander entsprechende Teile von kongruenten Dreiecken</strong>. Das heißt, wenn zwei Dreiecke kongruent sind, dann müssen auch alle zugehörigen Komponenten (Winkel, Seiten, Abschnitte,....) kongruent zueinander sein.</p>","link":"/course/triangles/congruence#cpoct"},"supplementary-angles":{"title":"Suplementärwinkel","text":"<p>Zwei Winkel sind <strong>suplementär</strong> zueinander, wenn sie sich zu 180° (also einem Halbkreis) ergänzen.</p>"},"tessellation":{"title":"Tessellierung","text":"<p>Eine <strong>Tessellierung</strong> ist ein geometrisches Muster, das eine Oberfläche ohne Lücken oder Überlappungen bedeckt.</p>","link":"/course/polyhedra/tessellations"},"polygon-vertex":{"title":"Eckpunkt eines Vielecks","text":"<p>Die <strong>Eckpunkte</strong> eines Vielecks sind die Punkte, an denen sich seine benachbarten Seiten treffen.</p>"},"irregular-polygon":{"title":"Unregelmäßiges Vieleck","text":"<p>Ein <strong>unregelmäßiges Vieleck</strong> (Polygon) ist eines, das <em>nicht regelmäßig</em> ist. Das bedeutet, dass entweder die Seiten oder die Winkel nicht alle die gleiche Größe haben.</p>"},"polyhedron":{"title":"Polyeder","text":"<p>Ein <strong>Polyeder</strong> (auch <em>Vielflächler</em> genannt) ist ein dreidimensionaler Körper ohne gekrümmte Oberflächen oder Kanten. Alle Flächen eines Polyeders sind Vielecke. Zum Beispiel sind ein Würfel und eine Pyramide Polyeder, aber eine Kugel nicht.</p>","link":"/course/polyhedra/polyhedra"},"polyhedron-face":{"title":"Oberfläche eines Polyeders","text":"<p>Die <strong>Oberfläche</strong> eines Polyeders besteht aus Vielecken.</p>","link":"/course/polyhedra/polyhedra"},"polyhedron-edge":{"title":"Kanten eines Polyeders","text":"<p>Die <strong>Kanten</strong> eines Polyeders sind die Strecken, durch die zwei seiner Flächen verbunden sind.</p>","link":"/course/polyhedra/polyhedra"},"polyhedron-vertex":{"title":"Eckpunkt eines Polyeders","text":"<p>Die Ecken eines Polyeders werden seine <strong>Eckpunkte</strong> genannt.</p>","link":"/course/polyhedra/polyhedra"},"platonic-solid":{"title":"Platonischer Körper","text":"<p>Ein <strong>platonischer Körper</strong> ist ein Polyeder, bei dem jede Fläche ein regelmäßiges Vieleck mit der gleichen Anzahl von Kanten ist und bei dem sich an jeder Ecke die gleiche Anzahl von Flächen trifft. Es gibt nur fünf verschiedene platonische Körper: Tetraeder, Würfel, Oktaeder, Dodekaeder und Ikosaeder.</p>","link":"/course/polyhedra/platonic"},"equilateral-triangle":{"title":"Gleichseitiges Dreieck","text":"<p>Ein <strong>gleichseitiges Dreieck</strong> ist ein Dreieck, bei dem alle drei Seiten die gleiche Länge haben.</p>"},"polyhedron-dual":{"title":"Dualität eines Polyeders","text":"<p>TODO</p>","link":"/course/polyhedra/platonic#platonic-dual"},"archimedean-solid":{"title":"Archimedischer Körper","text":"<p>Ein <strong>archimedischer Körper</strong> ist ein Polyeder, der aus verschiedenen Arten von regelmäßigen Vielecken besteht, der aus allen Richtungen gleichaussieht. Es gibt 13 verschiedene archimedische Körper.</p>","link":"/course/polyhedra/platonic#archimedean"},"icosahedron":{"title":"Ikosaeder","text":"<p>Das <strong>Ikosaeder</strong> ist ein platonischer Körper und aus besteht 20 Flächen, die alle gleichseitige Dreiecke sind. Es hat 12 Ecken und 30 Kanten.</p>","link":"/course/polyhedra/platonic#platonic-overview"},"truncated-icosahedron":{"title":"Ikosaederstumpf","text":"<p>Der <strong>Ikosaederstumpf</strong> ist ein <em>archimedischer Körper</em>, der aus 12 regelmäßigen Fünfecken und 20 regelmäßigen Sechsecken besteht.</p>","link":"/course/polyhedra/platonic#archimedean"},"tetrahedron":{"title":"Tetraeder","text":"<p>Das <strong>Tetraeder</strong> ist ein platonischer Körper und besteht aus 4 Flächen, die alle gleichseitige Dreiecke sind. Es hat vier Ecken und sechs Kanten.</p>","link":"/course/polyhedra/platonic#platonic-overview"},"cube":{"title":"Würfel","text":"<p>Ein <strong>Würfel</strong> (manchmal auch <strong>Hexaeder</strong> genannt) ist ein regelmäßiges Polyeder, bei dem jede Fläche ein Quadrat ist. Er ist einer der fünf <em>platonischen Körper</em>, und er hat 6 Flächen, 8 Ecken und 12 Kanten.</p>","link":"/course/polyhedra/platonic#platonic-overview"},"octahedron":{"title":"Oktaeder","text":"<p>Das <strong>Oktaeder</strong> ist ein platonischer Körper und besteht aus 8 Flächen, die alle gleichseitige Dreiecke sind. Er hat 6 Eckpunkte und 12 Kanten.</p>","link":"/course/polyhedra/platonic#platonic-overview"},"probability":{"title":"Wahrscheinlichkeit","text":"<p>Eine <strong>Wahrscheinlichkeit</strong> ist eine Zahl zwischen 0 und 1, die die Möglichkeit des Eintretens eines bestimmten Ereignisses angibt. Die Wahrscheinlichkeit eines Ereignisses <em>A</em> wird als <span class=\"math\" data-voice=\"P of A\"><mi>P</mi><mfenced><mi>A</mi></mfenced></span> geschrieben.</p>"},"congruent":{"title":"Kongruenz","text":"<p>In der Geometrie sind zwei Figuren <strong>kongruent</strong> (deckungsgleich), wenn sie in Größe, Form und Maß identisch sind. Das bedeutet, dass wir sie so bewegen, drehen oder wenden können, dass sie exakt übereinander zu liegen kommen.</p>","link":"/course/euclidean-geometry/axioms#congruence"},"angle-bisector":{"title":"Winkelhalbierende (Winkelsymmetrale)","text":"<p>Eine <strong>Winkelhalbierende</strong> ist eine Gerade, die einen Winkel halbiert sodaß zwei kongruente, kleinere Winkel entstehen.</p>","image":"angle-bisector.svg"}}