{"polygon":{"title":"Đa giác","text":"<p>Đa giáclà hình dạng hình học được tạo thành từ các đoạn thẳng. Đa giác không thể chứa bất kỳ cạnh cong hoặc lỗ. Ví dụ, hình vuông là một đa giác nhưng hình tròn thì không.</p>","image":"polygon.svg","link":"/course/polyhedra/polygons#polygons"},"internal-angle":{"title":"Góc bên trong","text":"<p>Các góc trongcủa đa giác là các góc ở bên trong, ở mọi đỉnh.</p>","image":"internal-angle.svg"},"concave":{"title":"Đa giác lõm","text":"<p>Một đa giác <strong>lõm</strong> có ít nhất một góc bên trong lớn hơn 180 °. Ít nhất một trong các đường chéo nằm <em>bên ngoài</em> đa giác. Một cách phổ biến để xác định một đa giác lõm là tìm kiếm một bên đa giác được cắt ra trong một đa giác. <em>Lõm</em> trái ngược với <em>đa giác lồi</em>.</p>","link":"/course/polyhedra/polygons#concave"},"convex":{"title":"Đa giác lồi","text":"<p>Một đa giác <strong>lồi</strong> không chứa các góc bên trong lớn hơn 180 °. Tất cả các đường chéo nằm bên trong đa giác. Điều này trái ngược với đa giác <em>lõm</em>.</p>","link":"/course/polyhedra/polygons#concave"},"regular-polygon":{"title":"Đa giác đều","text":"<p>Một đa giác <strong>thông thường</strong> là một đa giác trong đó tất cả các cạnh có cùng độ dài và tất cả các góc bên trong có cùng kích thước.</p>","image":"regular-polygon.svg","link":"/course/polyhedra/polygons#regular-polygons"},"rectangle":{"title":"Hình chữ nhật","text":"<p>Hình chữ nhậtlà một hình tứ giác trong đó cả bốn góc là 90 °.</p>","link":"/course/polyhedra/quadrilaterals#quadrilaterals-1"},"rhombus":{"title":"Hình thoi","text":"<p>Một hình thoi(số nhiều là <em>hình thoi</em> hoặc <em>rhombi</em>) là một hình tứ giác trong đó tất cả các cạnh có cùng độ dài.</p>","link":"/course/polyhedra/quadrilaterals#quadrilaterals-1"},"parallel":{"title":"Những đường thẳng song song","text":"<p>Hai hoặc nhiều dòng là <strong>song song</strong> nếu chúng không bao giờ giao nhau. Chúng có cùng độ dốc và khoảng cách giữa chúng luôn không đổi.</p>","image":"parallel.svg","link":"/course/euclidean-geometry/definitions#parallel"},"venn-diagram":{"title":"biểu đồ Venn","text":"<p>Biểu đồ <strong>Venn</strong> hiển thị nhiều thuộc tính hoặc sự kiện chồng lấp.</p>","image":"venn.svg"},"polygon-diagonal":{"title":"Đường chéo","text":"<p>Một đường chéocủa đa giác là một đoạn thẳng nối hai đỉnh không nằm cạnh nhau.</p>"},"triangle-midsegment":{"title":"Xác nhận","text":"<p>Các midsegmentscủa một tam giác là các đường nối các trung điểm của các cạnh khác nhau của tam giác.</p>","image":"triangle-midsegment.svg","link":"/course/triangles/midsegments"},"parallelogram":{"title":"Hình bình hành","text":"<p>Hình bình hànhlà một hình tứ giác trong đó cả hai cặp cạnh đối diện đều song song.</p>","link":"/course/polyhedra/quadrilaterals#parallelograms"},"alternate-angles":{"title":"Góc thay thế","text":"<p><strong>Các góc thay thế</strong> được tạo bởi hai <em>đường thẳng song song</em> được cắt bởi một đường <em>đi qua</em> và chúng luôn đồng dạng. Trong sơ đồ bên dưới, mỗi cặp góc được dán nhãn 1, 2, 3 và 4 là xen kẽ. Hai góc trong mỗi cặp nằm trên một đường thẳng song song khác nhau và hai mặt đối diện của đường ngang.</p><p>Các cặp góc 1 và 2 được gọi là <strong>góc ngoài thay thế</strong>, vì chúng nằm ngoài các đường song song và các cặp góc 3 và 4 được gọi là <strong>góc trong xen kẽ</strong>.</p>"},"axis-of-symmetry":{"title":"Trục đối xứng","text":"<p>Nếu một hình có đối xứng phản xạ, trục đối xứnglà đường chia nó thành hai nửa bằng nhau.</p>","image":"reflectional-symmetry.svg","link":"/course/transformations/symmetry#reflectional-symmetry"},"triangle-sss":{"title":"Điều kiện SSS cho hình tam giác","text":"<p>Hai tam giác là <strong>đồng dạng</strong> nếu ba cạnh của chúng có cùng độ dài. Điều này được gọi là điều kiện đồng dư <strong>SSS</strong> cho các tam giác.</p>","link":"/course/triangles/congruence#congruence-1"},"cpoct":{"title":"CPOCT","text":"<p>CPOCT là viết tắt của <strong>các phần tương ứng của các tam giác đồng dạng</strong>. Điều đó có nghĩa là nếu hai tam giác đồng dạng thì tất cả các thành phần tương ứng của chúng (góc, cạnh, đường giữa, góc) cũng phải đồng dạng với nhau.</p>","link":"/course/triangles/congruence#cpoct"},"supplementary-angles":{"title":"Góc độ bổ sung","text":"<p>Hai góc là <strong>bổ sung</strong> nếu chúng thêm tới 180 ° (một nửa vòng tròn).</p>"},"tessellation":{"title":"Tessname","text":"<p>Một <strong>tessname</strong> là một mô hình hình học bao phủ một bề mặt không có khoảng trống hoặc chồng chéo.</p>","link":"/course/polyhedra/tessellations"},"polygon-vertex":{"title":"Đỉnh của đa giác","text":"<p>Các đỉnhcủa đa giác là các điểm mà các cạnh kề của nó gặp nhau (các góc góc của nó).</p>"},"irregular-polygon":{"title":"Đa giác không đều","text":"<p>Một đa giác không đềulà một đa giác <em>không thường xuyên</em>. Điều này có nghĩa là cả hai bên hoặc các góc của don đều có cùng kích thước.</p>"},"polyhedron":{"title":"Khối đa diện","text":"<p>Một đa diện(số nhiều là <em>polyhedra</em>) là một vật rắn ba chiều không có bề mặt hoặc cạnh cong. Tất cả các mặt của khối đa diện đều là đa giác. Ví dụ, một khối lập phương và một kim tự tháp là khối đa diện, nhưng một hình cầu thì không.</p>","link":"/course/polyhedra/polyhedra"},"polyhedron-face":{"title":"Khuôn mặt của khối đa diện","text":"<p>Các mặtcủa đa diện là các đa giác tạo nên bề mặt của nó.</p>","link":"/course/polyhedra/polyhedra"},"polyhedron-edge":{"title":"Cạnh của khối đa diện","text":"<p>Các cạnhcủa khối đa diện là các đoạn đường mà hai mặt của nó được kết nối.</p>","link":"/course/polyhedra/polyhedra"},"polyhedron-vertex":{"title":"Đỉnh của khối đa diện","text":"<p>Các góc của góc độ của một khối đa diện được gọi là các đỉnh ____.</p>","link":"/course/polyhedra/polyhedra"},"platonic-solid":{"title":"Chất rắn","text":"<p>Một <strong>Platonic solid</strong> là một khối đa diện trong đó mọi mặt là một đa giác đều có cùng số cạnh và trong đó cùng một số mặt gặp nhau ở mọi đỉnh. Chỉ có năm chất rắn Platonic khác nhau: tứ diện, Cube, Octahedron, Dodecahedron và Icosahedron.</p>","link":"/course/polyhedra/platonic"},"equilateral-triangle":{"title":"Tam giác đều","text":"<p>Một tam giác đềulà một tam giác trong đó cả ba cạnh có cùng độ dài.</p>"},"polyhedron-dual":{"title":"Dual của đa diện","text":"<p>MỌI ĐIỀU</p>","link":"/course/polyhedra/platonic#platonic-dual"},"archimedean-solid":{"title":"Archishedean rắn","text":"<p>Một <strong>Archimedean solid</strong> là một khối đa diện được tạo thành từ các loại đa giác thông thường khác nhau, trông giống nhau từ mọi hướng. Có 13 chất rắn Archimedean khác nhau.</p>","link":"/course/polyhedra/platonic#archimedean"},"icosahedron":{"title":"Icosahedron","text":"<p><strong>Icosahedron</strong> là một vật rắn Platonic và bao gồm 20 mặt là tất cả các tam giác đều. Nó có 12 đỉnh và 30 cạnh.</p>","link":"/course/polyhedra/platonic#platonic-overview"},"truncated-icosahedron":{"title":"Cắt ngắn Icosahedron","text":"<p><strong>Icosahedron rút gọn</strong> là một <em>chất rắn Archimedean</em> bao gồm 12 hình ngũ giác đều và 20 hình lục giác đều.</p>","link":"/course/polyhedra/platonic#archimedean"},"tetrahedron":{"title":"Tứ diện","text":"<p>Khối tứ diệnlà một khối rắn Platonic và bao gồm bốn mặt là các tam giác đều. Nó có bốn đỉnh và sáu cạnh.</p>","link":"/course/polyhedra/platonic#platonic-overview"},"cube":{"title":"Khối lập phương","text":"<p>Một khối(đôi khi được gọi là <strong>Hexahedron</strong>) là một khối đa diện đều trong đó mọi mặt là một hình vuông. Nó là một trong năm <em>chất rắn Platonic</em>, và nó có 6 mặt, 8 đỉnh và 12 cạnh.</p>","link":"/course/polyhedra/platonic#platonic-overview"},"octahedron":{"title":"Thiên niên kỷ","text":"<p><strong>Octahedron</strong> là một vật rắn Platonic và bao gồm 8 mặt là các tam giác đều. Nó có 6 đỉnh và 12 cạnh.</p>","link":"/course/polyhedra/platonic#platonic-overview"},"probability":{"title":"Xác suất","text":"<p>Xác suấtlà số từ 0 đến 1 cho biết khả năng xảy ra sự kiện nào đó. Xác suất của một sự kiện <em>A</em> được viết là <span class=\"nowrap\"><span class=\"math\" data-voice=\"P of A\"><mi>P</mi><mfenced><mi>A</mi></mfenced></span>.</span></p>"},"congruent":{"title":"Đồng dư","text":"<p>Trong hình học, hai hình là <strong>đồng dạng</strong> nếu giống hệt nhau về kích thước, hình dạng và số đo. Điều này có nghĩa là chúng ta có thể di chuyển, lật hoặc xoay chúng để khớp chính xác với nhau.</p>","link":"/course/euclidean-geometry/definitions#congruence"},"angle-bisector":{"title":"Góc bisector","text":"<p>Một bisector góclà một đường hoặc tia chia một góc thành một nửa, thành hai góc nhỏ hơn, đồng dạng.</p>","image":"angle-bisector.svg"}}