{"polygon":{"title":"Poligono","text":"<p>Un poligonoè una forma geometrica costituita da segmenti di retta. I poligoni non possono contenere lati curvi o fori. Ad esempio, un quadrato è un poligono ma un cerchio no.</p>","image":"polygon.svg","link":"/course/polyhedra/polygons#polygons"},"internal-angle":{"title":"Angoli interni","text":"<p>Gli <strong>angoli interni</strong> di un poligono sono gli angoli all'interno, ad ogni vertice.</p>","image":"internal-angle.svg"},"concave":{"title":"Poligono concavo","text":"<p>Un poligono <strong>concavo</strong> ha almeno un angolo interno maggiore di 180 °. Almeno una delle diagonali si trova <em>fuori da</em> il poligono. Un modo comune per identificare un poligono concavo è quello di cercare un lato \"polverizzato\" del poligono. <em>concavo</em> è l'opposto di <em>poligoni convessi</em>.</p>","link":"/course/polyhedra/polygons#concave"},"convex":{"title":"Poligono convesso","text":"<p>Un poligono <strong>convesso</strong> non contiene angoli interni superiori a 180 °. Tutte le diagonali si trovano all'interno del poligono. Questo è l'opposto dei <em>poligoni</em> concavi.</p>","link":"/course/polyhedra/polygons#concave"},"regular-polygon":{"title":"Poligono regolare","text":"<p>Un <strong>poligono regolare</strong> è un poligono in cui tutti i lati hanno la stessa lunghezza e tutti gli angoli interni hanno le stesse dimensioni.</p>","image":"regular-polygon.svg","link":"/course/polyhedra/polygons#regular-polygons"},"rectangle":{"title":"Rettangolo","text":"<p>Un rettangoloè un quadrilatero in cui tutti e quattro gli angoli sono 90 °.</p>","link":"/course/polyhedra/quadrilaterals#quadrilaterals-1"},"rhombus":{"title":"Rombo","text":"<p>Un <strong>rombo</strong> (il plurale è <em>rombi</em> o <em>rombi</em>) è un quadrilatero in cui tutte le parti hanno la stessa lunghezza.</p>","link":"/course/polyhedra/quadrilaterals#quadrilaterals-1"},"parallel":{"title":"Linee parallele","text":"<p>Due o più linee sono <strong>parallele</strong> se non si intersecano mai. Hanno la stessa pendenza e la distanza tra loro è sempre costante.</p>","image":"parallel.svg","link":"/course/euclidean-geometry/definitions#parallel"},"venn-diagram":{"title":"diagramma di Venn","text":"<p>Un <strong>diagramma di Venn</strong> visualizza più proprietà o eventi che si sovrappongono.</p>","image":"venn.svg"},"polygon-diagonal":{"title":"Diagonale","text":"<p>Una diagonaledi un poligono è un segmento di linea che collega due vertici che non si trovano uno accanto all'altro.</p>"},"triangle-midsegment":{"title":"Midsegment","text":"<p>I <strong>midsegments</strong> di un triangolo sono le linee che collegano i punti medi dei diversi lati del triangolo.</p>","image":"triangle-midsegment.svg","link":"/course/triangles/midsegments"},"parallelogram":{"title":"parallelogrammo","text":"<p>Un <strong>parallelogramma</strong> è un quadrilatero in cui entrambe le coppie di lati opposti sono parallele.</p>","link":"/course/polyhedra/quadrilaterals#parallelograms"},"alternate-angles":{"title":"Angoli alternati","text":"<p><strong>Gli angoli alternativi</strong> sono formati da due <em>linee parallele</em> che sono attraversate da una <em>linea trasversale</em> e sono sempre congruenti. Nel diagramma seguente, ciascuna delle coppie di angoli etichettati 1, 2, 3 e 4 sono alternate. I due angoli di ogni coppia si trovano su una diversa linea parallela e sui lati opposti della traversa.</p><p>Le coppie di angoli 1 e 2 sono chiamate <strong>angoli esterni alternati</strong>, perché si trovano al di fuori delle linee parallele e le coppie di angoli 3 e 4 sono chiamate <strong>angoli interni alternati</strong>.</p>"},"axis-of-symmetry":{"title":"Asse di simmetria","text":"<p>Se una forma ha una simmetria riflettente, l'asse <strong>di simmetria</strong> è la linea che la divide in due metà uguali.</p>","image":"reflectional-symmetry.svg","link":"/course/transformations/symmetry#reflectional-symmetry"},"triangle-sss":{"title":"Condizione SSS per triangoli","text":"<p>Due triangoli sono <strong>congruenti</strong> se i loro tre lati hanno la stessa lunghezza. Questa è chiamata <strong>condizione di congruenza SSS</strong> per i triangoli.</p>","link":"/course/triangles/congruence#congruence-1"},"cpoct":{"title":"CPOCT","text":"<p>CPOCT sta per <strong>parti corrispondenti di triangoli congruenti</strong>. Significa che se due triangoli sono congruenti, anche tutti i loro componenti corrispondenti (angoli, lati, sezioni centrali, ...) devono essere congruenti tra loro.</p>","link":"/course/triangles/congruence#cpoct"},"supplementary-angles":{"title":"Angoli supplementari","text":"<p>Due angoli sono <strong>supplementari</strong> se si sommano a 180 ° (un semicerchio).</p>"},"tessellation":{"title":"Tassellazione","text":"<p>Una tassellaturaè un motivo geometrico che copre una superficie senza spazi vuoti o sovrapposizioni.</p>","link":"/course/polyhedra/tessellations"},"polygon-vertex":{"title":"Vertice di un poligono","text":"<p>I <strong>vertici</strong> di un poligono sono i punti in cui si incontrano i suoi lati adiacenti (i suoi \"angoli\").</p>"},"irregular-polygon":{"title":"Poligono irregolare","text":"<p>Un <strong>poligono irregolare</strong> è <em>non regolare</em>. Ciò significa che i lati o gli angoli non hanno tutti le stesse dimensioni.</p>"},"polyhedron":{"title":"Poliedro","text":"<p>Un <strong>poliedro</strong> (il plurale è <em>poliedri</em>) è un solido tridimensionale senza superfici curve o bordi. Tutte le facce di un poliedro sono poligoni. Ad esempio, un cubo e una piramide sono poliedri, ma una sfera no.</p>","link":"/course/polyhedra/polyhedra"},"polyhedron-face":{"title":"Volto di un poliedro","text":"<p>Le faccedi un poliedro sono i poligoni che compongono la sua superficie.</p>","link":"/course/polyhedra/polyhedra"},"polyhedron-edge":{"title":"Bordo di un poliedro","text":"<p>I bordidi un poliedro sono i segmenti di linea in cui sono collegate due delle sue facce.</p>","link":"/course/polyhedra/polyhedra"},"polyhedron-vertex":{"title":"Vertice di un poliedro","text":"<p>Gli \"angoli\" di un poliedro sono chiamati <strong>vertici</strong>.</p>","link":"/course/polyhedra/polyhedra"},"platonic-solid":{"title":"Solido platonico","text":"<p>Un <strong>solido platonico</strong> è un poliedro in cui ogni faccia è un poligono regolare con lo stesso numero di bordi e in cui lo stesso numero di facce si incontrano in ogni vertice. Esistono solo cinque diversi solidi platonici: il tetraedro, il cubo, l'ottaedro, il dodecaedro e l'icosaedro.</p>","link":"/course/polyhedra/platonic"},"equilateral-triangle":{"title":"Triangolo equilatero","text":"<p>Un <strong>triangolo equilatero</strong> è un triangolo in cui tutti e tre i lati hanno la stessa lunghezza.</p>"},"polyhedron-dual":{"title":"Doppio di un poliedro","text":"<p>QUALUNQUE COSA</p>","link":"/course/polyhedra/platonic#platonic-dual"},"archimedean-solid":{"title":"Solido di Archimedean","text":"<p>Un <strong>solido di Archimede</strong> è un poliedro composto da diversi tipi di poligoni regolari, che sembra lo stesso da ogni direzione. Esistono 13 diversi solidi di Archimede.</p>","link":"/course/polyhedra/platonic#archimedean"},"icosahedron":{"title":"icosaedro","text":"<p>L'Iosaedro__ è un solido platonico ed è composto da 20 facce che sono tutti triangoli equilateri. Ha 12 vertici e 30 bordi.</p>","link":"/course/polyhedra/platonic#platonic-overview"},"truncated-icosahedron":{"title":"Icosaedro troncato","text":"<p>Il <strong>Icosaedro troncato</strong> è un <em>solido di Archimede</em> composto da 12 pentagoni regolari e 20 esagoni regolari.</p>","link":"/course/polyhedra/platonic#archimedean"},"tetrahedron":{"title":"tetraedro","text":"<p>Il <strong>Tetrahedron</strong> è un solido platonico ed è composto da quattro facce che sono triangoli equilateri. Ha quattro vertici e sei bordi.</p>","link":"/course/polyhedra/platonic#platonic-overview"},"cube":{"title":"Cubo","text":"<p>Un cubo(a volte chiamato <strong>Hexahedron</strong>) è un poliedro normale in cui ogni faccia è un quadrato. È uno dei cinque <em>solidi platonici</em> e ha 6 facce, 8 vertici e 12 spigoli.</p>","link":"/course/polyhedra/platonic#platonic-overview"},"octahedron":{"title":"Ottaedro","text":"<p>Il <strong>Ottaedro</strong> è un solido platonico ed è composto da 8 facce che sono triangoli equilateri. Ha 6 vertici e 12 bordi.</p>","link":"/course/polyhedra/platonic#platonic-overview"},"probability":{"title":"Probabilità","text":"<p>Una probabilitàè un numero compreso tra 0 e 1 che indica la probabilità che si verifichi un determinato evento. La probabilità di un evento <em>A</em> è scritta come <span class=\"nowrap\"><span class=\"math\" data-voice=\"P of A\"><mi>P</mi><mfenced><mi>A</mi></mfenced></span>.</span></p>"},"congruent":{"title":"Congruenza","text":"<p>In geometria, due figure sono <strong>congruenti</strong> se sono identiche per dimensioni, forma e misura. Ciò significa che potremmo spostarli, capovolgerli o ruotarli per adattarli esattamente uno sopra l'altro.</p>","link":"/course/euclidean-geometry/definitions#congruence"},"angle-bisector":{"title":"Bisettrice angolare","text":"<p>Una bisettrice di angoloè una linea o raggio che divide un angolo a metà, in due angoli congruenti e più piccoli.</p>","image":"angle-bisector.svg"}}