{"polygon":{"title":"Polígono","text":"<p>Um polígonoé uma forma geométrica composta por segmentos de linha reta. Os polígonos não podem conter lados curvos ou furos. Por exemplo, um quadrado é um polígono, mas um círculo não.</p>","image":"polygon.svg","link":"/course/polyhedra/polygons#polygons"},"internal-angle":{"title":"Ângulos internos","text":"<p>Os <strong>ângulos internos</strong> de um polígono são os ângulos internos, em todos os vértices.</p>","image":"internal-angle.svg"},"concave":{"title":"Polígono côncavo","text":"<p>Um polígono <strong>côncavo</strong> possui pelo menos um ângulo interno maior que 180 °. Pelo menos uma das diagonais está <em>fora de</em>. Uma maneira comum de identificar um polígono côncavo é procurar um lado \"cavado\" do polígono. <em>Côncavo</em> é o oposto de <em>polígonos convexos</em>.</p>","link":"/course/polyhedra/polygons#concave"},"convex":{"title":"Polígono convexo","text":"<p>Um polígono <strong>convexo</strong> não contém ângulos internos maiores que 180 °. Todas as diagonais estão dentro do polígono. É o oposto de <em>polígonos côncavos</em>.</p>","link":"/course/polyhedra/polygons#concave"},"regular-polygon":{"title":"Polígono regular","text":"<p>Um <strong>polígono regular</strong> é um polígono no qual todos os lados têm o mesmo comprimento e todos os ângulos internos têm o mesmo tamanho.</p>","image":"regular-polygon.svg","link":"/course/polyhedra/polygons#regular-polygons"},"rectangle":{"title":"Retângulo","text":"<p>Um retânguloé um quadrilátero em que todos os quatro ângulos são 90 °.</p>","link":"/course/polyhedra/quadrilaterals#quadrilaterals-1"},"rhombus":{"title":"Rhombus","text":"<p>Um <strong>losango</strong> (o plural é <em>losangos</em> ou <em>rhombi</em>) é um quadrilátero em que todos os lados têm o mesmo comprimento.</p>","link":"/course/polyhedra/quadrilaterals#quadrilaterals-1"},"parallel":{"title":"Linhas paralelas","text":"<p>Duas ou mais linhas são <strong>paralelas</strong> se nunca se cruzarem. Eles têm a mesma inclinação e a distância entre eles é sempre constante.</p>","image":"parallel.svg","link":"/course/euclidean-geometry/definitions#parallel"},"venn-diagram":{"title":"Diagrama de Venn","text":"<p>Um diagrama de Vennvisualiza várias propriedades ou eventos que se sobrepõem.</p>","image":"venn.svg"},"polygon-diagonal":{"title":"Diagonal","text":"<p>Uma <strong>diagonal</strong> de um polígono é um segmento de linha que conecta dois vértices que não estão próximos um do outro.</p>"},"triangle-midsegment":{"title":"Meio segmento","text":"<p>Os <strong>segmentos intermediários</strong> de um triângulo são as linhas que conectam os pontos médios dos diferentes lados do triângulo.</p>","image":"triangle-midsegment.svg","link":"/course/triangles/midsegments"},"parallelogram":{"title":"Paralelogramo","text":"<p>Um paralelogramo __é um quadrilátero em que ambos os pares de lados opostos são paralelos.</p>","link":"/course/polyhedra/quadrilaterals#parallelograms"},"alternate-angles":{"title":"Ângulos alternativos","text":"<p><strong>Ângulos alternativos</strong> são formados por duas <em>linhas paralelas</em> que são cruzadas por uma linha <em>transversal</em> e sempre são congruentes. No diagrama abaixo, cada um dos pares de ângulos marcados 1, 2, 3 e 4 são alternados. Os dois ângulos de cada par estão em uma linha paralela diferente e em lados opostos da travessia.</p><p>Os pares de ângulos 1 e 2 são chamados <strong>ângulos externos alternativos</strong>, porque estão fora das linhas paralelas, e os pares de ângulos 3 e 4 são chamados <strong>ângulos internos alternativos</strong>.</p>"},"axis-of-symmetry":{"title":"Eixo de simetria","text":"<p>Se uma forma tem simetria reflexiva, o eixo de simetria__ é a linha que a divide em duas metades iguais.</p>","image":"reflectional-symmetry.svg","link":"/course/transformations/symmetry#reflectional-symmetry"},"triangle-sss":{"title":"Condição SSS para triângulos","text":"<p>Dois triângulos são <strong>congruentes</strong> se seus três lados tiverem o mesmo comprimento. Isso é chamado de <strong>condição de congruência SSS</strong> para triângulos.</p>","link":"/course/triangles/congruence#congruence-1"},"cpoct":{"title":"CPOCT","text":"<p>CPOCT significa <strong>partes correspondentes de triângulos congruentes</strong>. Isso significa que, se dois triângulos são congruentes, todos os seus componentes correspondentes (ângulos, lados, segmentos intermediários ...) também devem ser congruentes entre si.</p>","link":"/course/triangles/congruence#cpoct"},"supplementary-angles":{"title":"Ângulos suplementares","text":"<p>Dois ângulos são <strong>suplementares</strong> se somarem 180 ° (um semicírculo).</p>"},"tessellation":{"title":"Mosaico","text":"<p>Um mosaicoé um padrão geométrico que cobre uma superfície sem espaços ou sobreposições.</p>","link":"/course/polyhedra/tessellations"},"polygon-vertex":{"title":"Vértice de um polígono","text":"<p>Os <strong>vértices</strong> de um polígono são os pontos em que seus lados adjacentes se encontram (seus “cantos”).</p>"},"irregular-polygon":{"title":"Polígono irregular","text":"<p>Um <strong>polígono irregular</strong> é aquele que <em>não é regular</em>. Isso significa que os lados ou os ângulos não têm o mesmo tamanho.</p>"},"polyhedron":{"title":"Poliedro","text":"<p>Um <strong>poliedro</strong> (o plural é <em>poliedro</em>) é um sólido tridimensional sem superfícies curvas ou arestas. Todas as faces de um poliedro são polígonos. Por exemplo, um cubo e uma pirâmide são poliedros, mas uma esfera não.</p>","link":"/course/polyhedra/polyhedra"},"polyhedron-face":{"title":"Cara de um poliedro","text":"<p>As <strong>faces</strong> de um poliedro são os polígonos que compõem sua superfície.</p>","link":"/course/polyhedra/polyhedra"},"polyhedron-edge":{"title":"Borda de um poliedro","text":"<p>As <strong>arestas</strong> de um poliedro são os segmentos de linha onde duas de suas faces estão conectadas.</p>","link":"/course/polyhedra/polyhedra"},"polyhedron-vertex":{"title":"Vértice de um poliedro","text":"<p>Os \"cantos\" de um poliedro são chamados de <strong>vértices</strong>.</p>","link":"/course/polyhedra/polyhedra"},"platonic-solid":{"title":"Sólido platônico","text":"<p>Um sólido <strong>platônico</strong> é um poliedro em que cada face é um polígono regular com o mesmo número de arestas e onde o mesmo número de faces se encontra em todos os vértices. Existem apenas cinco sólidos platônicos diferentes: o tetraedro, o cubo, o octaedro, o dodecaedro e o icosaedro.</p>","link":"/course/polyhedra/platonic"},"equilateral-triangle":{"title":"Triângulo Equilátero","text":"<p>Um <strong>triângulo equilátero</strong> é um triângulo no qual todos os três lados têm o mesmo comprimento.</p>"},"polyhedron-dual":{"title":"Dual de um poliedro","text":"<p>TUDO</p>","link":"/course/polyhedra/platonic#platonic-dual"},"archimedean-solid":{"title":"Sólido arquimediano","text":"<p>Um sólido arquimediano __é um poliedro formado por diferentes tipos de polígonos regulares, com a mesma aparência em todas as direções. Existem 13 sólidos arquimedianos diferentes.</p>","link":"/course/polyhedra/platonic#archimedean"},"icosahedron":{"title":"Icosaedro","text":"<p>O <strong>Icosahedron</strong> é um sólido platônico e consiste em 20 faces que são todos triângulos equilaterais. Possui 12 vértices e 30 arestas.</p>","link":"/course/polyhedra/platonic#platonic-overview"},"truncated-icosahedron":{"title":"Icosaedro truncado","text":"<p>O <strong>Icosaedro Truncado</strong> é um sólido arquimediano __ que consiste em 12 pentágonos regulares e 20 hexágonos regulares.</p>","link":"/course/polyhedra/platonic#archimedean"},"tetrahedron":{"title":"Tetraedro","text":"<p>O <strong>tetraedro</strong> é um sólido platônico e consiste em quatro faces que são triângulos equilaterais. Possui quatro vértices e seis arestas.</p>","link":"/course/polyhedra/platonic#platonic-overview"},"cube":{"title":"Cubo","text":"<p>Um cubo(às vezes chamado de <strong>hexaedro</strong>) é um poliedro regular em que cada face é um quadrado. É um dos cinco <em>sólidos platônicos</em> e possui 6 faces, 8 vértices e 12 arestas.</p>","link":"/course/polyhedra/platonic#platonic-overview"},"octahedron":{"title":"Octaedro","text":"<p>O <strong>octaedro</strong> é um sólido platônico e consiste em 8 faces que são triângulos equilaterais. Possui 6 vértices e 12 arestas.</p>","link":"/course/polyhedra/platonic#platonic-overview"},"probability":{"title":"Probabilidade","text":"<p>Uma probabilidadeé um número entre 0 e 1 que indica a probabilidade da ocorrência de determinado evento. A probabilidade de um evento <em>A</em> é escrita como <span class=\"nowrap\"><span class=\"math\" data-voice=\"P of A\"><mi>P</mi><mfenced><mi>A</mi></mfenced></span>.</span></p>"},"congruent":{"title":"Congruência","text":"<p>Na geometria, duas figuras são <strong>congruentes</strong> se forem idênticas em tamanho, forma e medida. Isso significa que podemos movê-los, girá-los ou girá-los para encaixá-los exatamente um em cima do outro.</p>","link":"/course/euclidean-geometry/definitions#congruence"},"angle-bisector":{"title":"Bissetriz de ângulo","text":"<p>Uma bissetriz de ânguloé uma linha ou raio que divide um ângulo ao meio, em dois ângulos congruentes e menores.</p>","image":"angle-bisector.svg"}}