{"eratosthenes":{"name":"Eratosthenes","born":-276,"died":-195,"bio":"<p><strong>Eratosthenes</strong> (M.Ö. 276 – 195 ) Cyrene’de doğmuş Yunan matematikçi, coğrafyacı, astronom, tarihçi ve şairdi. Yaşamının uzun bir süresinde Mısır’da bulunan İskenderiye kütüphanesinin yönetimi ile meşgul olmuştur.</p><p>Diğer birçok başarısının yanı sıra, Dünya’nın çevresini hesaplamış, eksen eğikliğini ölçmüş, dünya ile güneş arasındaki mesafeyi tahmin etmiş ve ilk dünya haritasını çizmiştir.</p><p>Ayrıca asal sayıları bulmak için “Eratosthenes Kalburu” isminde bir yöntem geliştirmiştir.</p>","links":[{"title":"Dünya’nın yarıçapı","url":"/course/circles/tangets-chords-arcs#eratosthenes"},{"title":"Eratosthenes Kalburu","url":"/course/divisibility/primes#eratosthenes"}]},"euclid":{"name":"Euclid","born":-330,"died":-270,"bio":"<p><strong>İskenderiye’li Öklid</strong> (M.Ö. 300 civarında) <em>geometrinin babası</em> olarak bilinen Yunan bir matematikçiydi. Öklid geometrisini tanıtan ve geometri ile sayı teorisinde birçok önemli ispat içeren _Elementler _ adında bir kitap yazdı. Bu kitap, 19. yüzyıla kadar ana matematik ders kitabı olarak kullanıldı. İskenderiye'de matematik dersleri verdi, fakat hayatı hakkında çok az şey biliniyor.</p>","links":[{"title":"Öklid Geometrisinin Temel Aksiyomları","url":"/course/euclidean-geometry/euclids-axioms"},{"title":"Asal Sayıların Sonsuzluğu","url":"/course/divisibility/primes#primes3"}]},"euler":{"name":"Euler","born":1707,"died":1783,"bio":"<p><strong>Leonhard Euler</strong> (1707 – 1783), tüm zamanların en büyük matematikçilerinden biriydi. Yaptığı çalışmalar matematiğin bütün dalları kapsar, tam 80 cilt matematik araştırması vardır!</p><p>İsviçre doğumlu olan Euler, Basel’de eğitim almıştır ancak hayatının büyük bir çoğunluğunu Berlin, Prusya ve St. Petersburg, Rusya’da geçirmiştir.</p><p>Euler modern matematikte kullandığımız terminoloji ve gösterimleri bize kazandıran kişidir. Ayrıca kalkülüs, analiz, çizgeler kuramı, fizik, astronomi ve daha birçok alanda önemli keşifler yapmıştır.</p>","links":[{"title":"Königsberg Köprüsü Problemi","url":"/course/graph-theory/bridges"},{"title":"Euler Formülü","url":"/course/graph-theory/planar-graphs"},{"title":"Çokyüzlüler","url":"/course/polyhedra/polyhedra"}]},"ulam":{"name":"Ulam","bio":"<p><strong>Stanisław Ulam</strong> (1909 – 1984) Polonyalı-Amerikalı bir matematikçiydi. Amerika’nın ilk nükleer silahlarının geliştirildiği _Manhatten Projesi_nde önemli rol oynamıştır. Ayrıca nükleer yayılımı kullanan roket ateşleme üzerine çalışmış ve istatistikteki önemli bir kavram olan _Monte Carlo metodu_nu geliştirmiştir.</p>"},"goldbach":{"name":"Goldbach","born":1690,"died":1764,"bio":"<p><strong>Christian Goldbach</strong> (1690 – 1764) Prusyalı bir matematikçiydi. Euler, Leibniz ve Bernoulli’nin çağdaşıydı. Rus çarı 2. Peter’ın eğitmeniydi. “Goldbach Sanısı” ile anılır.</p>","links":[{"title":"Goldbach Sanısı","url":"/course/divisibility/the-distribution-of-primes#goldbach1"}]},"gauss":{"name":"Gauss","born":1777,"died":1855,"bio":"<p><strong>Carl Friedrich Gauss</strong> (1777 – 1855) tarihteki en harika matematikçilerden bir tanesidir. Cebirden sayılar teorisine, istatistikten kalkülüse, geometri, jeoloji ve astronomiye kadar matematiğin her alanında çığır açan keşifler yapmıştır.</p><p>Rivayete göre Gauss daha 3 yaşındayken babasının kendi işiyle alakalı yaptığı bir hesapta hatasını bulup onu düzeltmiştir. Ayrıca 8 yaşındayken 1’den 1000’e kadar olan doğal sayıları toplayabilmenin kolay yolunu bulmuştur. En önemli keşiflerini sunmaya başladığında daha ergenlik çağındaydı. Daha sonra üniversitede çalışırken birçok önemli matematikçiye ders vermiştir.</p>","links":[{"title":"Asal Sayı Teoremi","url":"/course/divisibility/the-distribution-of-primes#riemann"},{"title":"Öklid dışı geometri","url":"/world/Dimensions_and_Distortions"},{"title":"Üçgen sayıların toplamı","url":"/course/sequences/figurate#triangle-sum"}]},"riemann":{"name":"Riemann","born":1826,"died":1866,"overflow":true,"bio":"<p><strong>Bernhard Riemann</strong> (1826 – 1866), analiz ve sayılar kuramı alanlarında çalışmalar yapmış olan Alman bir matematikçidir. İntegralin muntazam ilk tanımını veren kişidir. Aynı zamanda diferansiyel geometri de çalışmış, böylece genel göreliliğin temellerini atmıştır. Asal sayıların dağılımıyla alakalı çığır açan keşifleri de olmuştur.</p>","links":[{"title":"Riemann Hipotezi","url":"/course/divisibility/the-distribution-of-primes#riemann"}]}}