{"eratosthenes":{"name":"Eratosthenes","full":"Eratosthenes of Cyrene","born":-276,"died":-195,"location":"africa","bio":"<p><strong>Eratosthenes of Cyrene</strong> (c. 276 – 195 BCE) was a Greek mathematician, geographer, astronomer, historian, and poet. He spent much of his life in Egypt, as head of the library of Alexandria.</p><p>Among many other achievements, Eratosthenes calculated the circumference of the Earth, measured the tilt of the Earth’s axis of rotation, estimated the distance to the sun, and created some of the first maps of the world.</p><p>He also invented the “Sieve of Eratosthenes”, an efficient way to calculate <em>prime numbers</em>.</p>","links":[{"title":"Radius of the Earth","url":"/course/circles/tangets-chords-arcs#eratosthenes"},{"title":"Sieve of Eratosthenes","url":"/course/divisibility/primes#eratosthenes"}]},"euclid":{"name":"Euclid","full":"Euclid of Alexandria","born":-330,"died":-270,"location":"africa","bio":"<p><strong>Euclid of Alexandria</strong> (around 300 BCE) was a Greek mathematician and is often called the <em>father of geometry</em>. He published a book <em>Elements</em> that first introduced Euclidean geometry and contained many important proofs in geometry and number theory. It was the main mathematics textbook until the 19th century. He taught mathematics in Alexandria, but very little else is known about his life.</p>","links":[{"title":"Euclid’s Axioms","url":"/course/euclidean-geometry/euclids-axioms"},{"title":"Infinitely many Primes","url":"/course/divisibility/primes#primes3"}]},"euler":{"name":"Euler","full":"Leonhard Euler","born":1707,"died":1783,"bio":"<p><strong>Leonhard Euler</strong> (1707 – 1783) was one the greatest mathematicians in history. His work spans all areas of mathematics, and he wrote 80 volumes of research.</p><p>Euler was born in Switzerland and studied in Basel, but lived most of his life in Berlin, Prussia, and St. Petersburg, Russia.</p><p>Euler invented much of the modern mathematical terminology and notation, and made important discoveries in calculus, analysis, graph theory, physics, astronomy, and many other topics.</p>","links":[{"title":"Königsberg Bridges Problem","url":"/course/graph-theory/bridges"},{"title":"Euler’s Formula","url":"/course/graph-theory/planar-graphs"},{"title":"Polyhedrons","url":"/course/polyhedra/polyhedra"}]},"ulam":{"name":"Ulam","bio":"<p><strong>Stanisław Ulam</strong> (1909 – 1984) was a Polish-American mathematician. He played an important part in the American <em>Manhattan Project</em> that developed the first nuclear weapons. He also worked on rocket propulsion using nuclear pulses, and developed the <em>Monte Carlo method</em> – an important concept in statistics.</p>"},"goldbach":{"name":"Goldbach","full":"Christian Goldbach","born":1690,"died":1764,"image":false,"bio":"<p><strong>Christian Goldbach</strong> (1690 – 1764) was a Prussian mathematician and contemporary of Euler, Leibniz and Bernoulli. He was tutor of Russian Tsar Peter II, and is remembered for his “Goldbach Conjecture“.</p>","links":[{"title":"Goldbach Conjecture","url":"/course/divisibility/the-distribution-of-primes#goldbach1"}]},"gauss":{"name":"Gauss","full":"Carl Friedrich Gauss","born":1777,"died":1855,"bio":"<p><strong>Carl Friedrich Gauss</strong> (1777 – 1855) was arguably the greatest mathematician in history. He made groundbreaking discoveries in just about every field of mathematics, from algebra and number theory to statistics, calculus, geometry, geology and astronomy.</p><p>According to legend, he corrected a mistake in his father‘s accounting at the age of 3, and found a way to quickly add up all integers from 1 to 100 at the age of 8. He made his first important discoveries while still a teenager, and later tutored many other famous mathematicians as Professor.</p>","links":[{"title":"Prime Number Theorem","url":"/course/divisibility/the-distribution-of-primes#riemann"},{"title":"Non-Euclidean Geometry","url":"/world/Dimensions_and_Distortions"},{"title":"Sums of Triangle Numbers","url":"/course/sequences/figurate#triangle-sums"}]},"riemann":{"name":"Riemann","full":"Bernhard Riemann","born":1826,"died":1866,"bio":"<p><strong>Bernhard Riemann</strong> (1826 – 1866) was a German mathematician working in the fields of analysis and number theory. He came up with the first rigorous definition of integration, studied differential geometry which laid the foundation for general relativity, and made groundbreaking discoveries regarding the distribution of prime numbers.</p>","links":[{"title":"Riemann Hypothesis","url":"/course/divisibility/the-distribution-of-primes#riemann"}]}}