{"eratosthenes":{"name":"Eratostene","born":-276,"died":-195,"bio":"<p><strong>Eratostene din Cyrene</strong> (c. 276 î.Hr. – 195 î.Hr.) a fost un matematician, geograf, astronom, istoric și poet grec. El și-a petrecut o mare parte din viața sa în Egipt ca șef al bibliotecii din Alexandria.</p><p>Printre multele sale realizări, Eratostene a calculat circumferința Pământului, a măsurat înclinarea axei de rotație a Pământului, a estimat distanța până la Soare și a creat primele hărți ale lumii.</p><p>De asemenea, el a inventat “Ciurul lui Eratostene”, o metodă eficientă de calculare a <em>numerelor prime</em>.</p>","links":[{"title":"Radius of the Earth","url":"/course/circles/tangets-chords-arcs#eratosthenes"},{"title":"Sieve of Eratosthenes","url":"/course/divisibility/primes#eratosthenes"}]},"euclid":{"name":"Euclid","born":-330,"died":-270,"bio":"<p><strong>Euclid din Alexandria</strong> (în jurul 300 î.Hr.) a fost un matematician grec adesea numit <em>părintele geometriei</em>. El a publicat o carte cu titlul <em>Elemente</em> care a introdus pentru prima dată geometria euclidiană și care conținea mult demonstrații importante din geometrie și teoria numerelor. Această carte a fost manual principal de matematică până in secolul al 19lea. El a predat matematica în Alexandria, dar altfel se cunosc foarte puține detalii despre viața sa.</p>","links":[{"title":"Euclid’s Axioms","url":"/course/euclidean-geometry/axioms"},{"title":"Infinitely many Primes","url":"/course/divisibility/primes#primes3"}]},"euler":{"name":"Euler","born":1707,"died":1783,"bio":"<p><strong>Leonhard Euler</strong> (1707 – 1783) a fost unul dintre cei mai mari matematicieni din istorie. Munca sa acoperă toate ramurile matematicii și el a scris 80 de volume de cercetare.</p><p>Euler s-a născut în Elveția și a studiat la Basel, dar a trăit marea parte a vieții sale în Berlin, Prusia și în St. Petersburg, Rusia.</p><p>Euler a inventat o mare parte din terminologia și notațiile matematicii moderne și a făcut descoperiri importante în analiză, teoria grafurilor, fizică, astronomie și în multe alte subiecte.</p>","links":[{"title":"Königsberg Bridges Problem","url":"/course/graph-theory/bridges"},{"title":"Euler’s Formula","url":"/course/graph-theory/planar-graphs"},{"title":"Polyhedrons"}]},"ulam":{"name":"Ulam","bio":"<p><strong>Stanisław Ulam</strong> (1909 – 1984) a fost un matematician polonezo-american. El a avut un rol important în <em>proiectul american Manhattan</em> de dezvoltare a primelor arme nucleare. De asemenea, el a lucrat și la propulsia rachetelor cu impulsuri nucleare și a dezvoltat metoda <em>Monte Carlo</em> – un concept important din statistică.</p>"},"goldbach":{"name":"Goldbach","born":1690,"died":1764,"bio":"<p><strong>Christian Goldbach</strong> (1690 – 1764) a fost un matematician prusac contemporan cu Euler, Leibniz și Bernoulli. El a fost educatorul țarului rus Pentru al II-lea și este a rămas cunoscut pentru conjectura sa - “Conjectura Goldbach“.</p>","links":[{"title":"Goldbach Conjecture","url":"/course/divisibility/the-distribution-of-primes#goldbach1"}]},"gauss":{"name":"Gauss","born":1777,"died":1855,"bio":"<p><strong>Carl Friedrich Gauss</strong> (1777 – 1855) a fost probabil cel mai mare matematician din istorie. El a făcut descoperiri inovatoare în aproape toate domeniile matematicii, de la algebră și teoria numerelor până la statistici, analiză matematică, geometrie, geologie și astronomie.</p><p>Conform legendei, el a corectat o greșeală din calculele de contabilitate ale tatălui său la vâsta de 3 ani și a descoperit o metodă de a aduna rapid toate numerele întregi de la 1 la 100 la vârsta de 8 ani. Primele sale descoperiri importante au fost făcute pe când era adolescent, iar mai târziu a îndrumat ca profesor mulți matematicieni faimoși.</p>","links":[{"title":"Prime Number Theorem","url":"/course/divisibility/the-distribution-of-primes#riemann"},{"title":"Non-Euclidean Geometry","url":"/world/Dimensions_and_Distortions"},{"title":"Sums of Triangle Numbers","url":"/course/sequences/figurate#triangle-sums"}]},"riemann":{"name":"Riemann","born":1826,"died":1866,"overflow":true,"bio":"<p><strong>Bernhard Riemann</strong> (1826 – 1866) a fost un matematician german ce a lucratwas în domeniul analizei matematice și al teoriei numerelor. El a formulat prima definiție riguroasă a operației de integrare matematică, a studiat geometria diferențială ce a pus bazele relativității generale și a făcut descoperiri inovatoare cu privire la distribuția numerelor prime.</p>","links":[{"title":"Riemann Hypothesis","url":"/course/divisibility/the-distribution-of-primes#riemann"}]}}