{"eratosthenes":{"name":"Eratosthenes","born":-276,"died":-195,"bio":"<p><strong>Eratosthene von Kyrene</strong> (ca. 276 v. Chr. – 195 v. Chr.) war ein griechischer Mathematiker, Geograph, Astronom, Historiker und Dichter. Er verbrachte einen Großteil seines Lebens in Ägypten, als Leiter der Bibliothek von Alexandria.</p><p>Neben vielen anderen Errungenschaften berechnete Eratosthenes den Umfang der Erde, maß die Neigung der Drehachse der Erde, schätzte den Abstand zur Sonne und schuf einige der ersten Weltkarten.</p><p>Er erfand auch das “Sieb des Eratosthenes”, eine effiziente Methode zur Berechnung <em>von Primzahlen</em>.</p>","links":[{"title":"Radius der Erde","url":"/course/circles/tangets-chords-arcs#eratosthenes"},{"title":"Sieb des Eratosthenes","url":"/course/divisibility/primes#eratosthenes"}]},"euclid":{"name":"Euclid","born":-330,"died":-270,"bio":"<p><strong>Euklid von Alexandria</strong> (um 300 v. Chr.) war ein griechischer Mathematiker und wird oft als <em>Vater der Geometrie</em> bezeichnet. Er veröffentlichte ein Buch namens <em>Elemente</em>, indem die euklidische Geometrie erstmals eingeführt wurde und das viele wichtige Beweise auf den Gebieten der Geometrie und Zahlentheorie enthielt. Es war bis ins 19. Jahrhundert das wichtigste mathematische Lehrbuch. Er lehrte Mathematik in Alexandria, aber über sein Leben ist nur sehr wenig bekannt.</p>","links":[{"title":"Satz des Euklid","url":"/course/euclidean-geometry/euclids-axioms"},{"title":"Unendlich viele Primzahlen","url":"/course/divisibility/primes#primes3"}]},"euler":{"name":"Euler","born":1707,"died":1783,"bio":"<p><strong>Leonhard Euler</strong> (1707 – 1783) war einer der größten Mathematiker der Geschichte. Seine Arbeit umfasst alle Bereiche der Mathematik, und er schrieb 80 Forschungsbände.</p><p>Euler wurde in der Schweiz geboren und studierte in Basel, lebte aber den größten Teil seines Lebens in Berlin, Preußen und St. Petersburg, Russland.</p><p>Euler erfand einen Großteil der modernen mathematischen Terminologie und Notation und machte wichtige Entdeckungen in den Bereichen Infinitesimalrechnung, Analysis, Graphentheorie, Physik, Astronomie und vielen anderen Themen.</p>","links":[{"title":"Königsberger Brückenproblem","url":"/course/graph-theory/bridges"},{"title":"Eulersche Formel","url":"/course/graph-theory/planar-graphs"},{"title":"Polyeder","url":"/course/polyhedra/polyhedra"}]},"ulam":{"name":"Ulam","bio":"<p><strong>Stanisław Ulam</strong> (1909 – 1984) war ein polnisch-amerikanischer Mathematiker. Er spielte eine wichtige Rolle im amerikanischen <em>Manhattan-Projekt</em> zur Entwicklung der ersten Atomwaffen. Er beschäftigte sich auch mit dem Raketenantrieb mittels nuklearer Impulse durch Atombombenexplosionen und entwickelte die <em>Monte-Carlo-Methode</em> – ein wichtiges Konzept in der Statistik.</p>"},"goldbach":{"name":"Goldbach","born":1690,"died":1764,"bio":"<p><strong>Christian Goldbach</strong> (1690 – 1764) war ein preußischer Mathematiker und Zeitgenosse von Euler, Leibniz und Bernoulli. Er war der Lehrer des russischen Zaren Peter II. und wird für seine “Goldbachsche Vermutung“ in Erinnerung behalten.</p>","links":[{"title":"Goldbachsche Vermutung","url":"/course/divisibility/the-distribution-of-primes#goldbach1"}]},"gauss":{"name":"Gauss","born":1777,"died":1855,"bio":"<p>__Carl Friedrich Gauß (1777 – 1855) war wohl der größte Mathematiker der Geschichte. Er machte bahnbrechende Entdeckungen in fast allen Bereichen der Mathematik, von Algebra und Zahlentheorie über Statistik, Analysis, Geometrie, Geologie und Astronomie.</p><p>Der Legende nach korrigierte er einen Fehler in der Buchhaltung seines Vaters im Alter von 3 Jahren und fand mit 8 Jahren einen Weg, die Zahlen von 1 bis 100 schnell zu addieren. Schon als Teenager machte er seine ersten wichtigen Entdeckungen und unterrichtete später viele andere berühmte Mathematiker als Professor.</p>","links":[{"title":"Primzahlsatz","url":"/course/divisibility/the-distribution-of-primes#riemann"},{"title":"Nichteuklidische Geometrie","url":"/world/Dimensions_and_Distortions"},{"title":"Summen von Dreieckszahlen","url":"/course/sequences/figurate#triangle-sums"}]},"riemann":{"name":"Riemann","born":1826,"died":1866,"overflow":true,"bio":"<p><strong>Bernhard Riemann</strong> (1826 – 1866) war ein deutscher Mathematiker, der auf den Gebieten der Analysis und Zahlentheorie arbeitete. Er entwickelte die erste strenge Definition eines Integrals, studierte Differentialgeometrie, die den Grundstein für die allgemeine Relativitätstheorie legte, und machte bahnbrechende Entdeckungen über die Verteilung von Primzahlen.</p>","links":[{"title":"Riemannsche Vermutung","url":"/course/divisibility/the-distribution-of-primes#riemann"}]}}